{
	"1900-01-01" : "New Year. First day of 1900 <a>Charlie<br>Merritt</a> died at Grand Forks<br>British Columbia yesterday of<br>typhoid fever. To-day is<br><a>election day</a> and papa went<br>up about 3 o'clock and did<br>not get back until nearly<br>10. He brought us some candy<br>chocolate drops. We had a very<br>fat goose for dinner, not a<br>very young one. Had to have<br>good teeth.",
	"1900-01-02" : "Went uptown in afternoon.<br>Was up to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\"> Eckhardt's</a> but <a>Miss<br>Macfarlane</a> was not there so I did<br>not get what I wanted. Called at<br><a>office</a> and <a> Nettie</a> came home<br>with me for tea. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanMr\"> Mr Carman</a><br>came over and borrowed<br>my <a href=\"/s/ital-iasc-2q90/page/literature#MildredsBooks\">Mildred books</a>. Then<br><a>Leta</a> came &amp; borrowed my<br>German Grammar as she forgot<br>hers &amp; left it at school before holiday.<br>Papa, mamma, Nettie &amp; I played<br>crokinole. Mamma &amp; I beat. The<br>2<sup>nd</sup> Contingent left for Toronto today<br>to go to South Africa. <a>Dr King</a>'s son<br>went.",
	"1900-01-03" : "<a>Mrs Trusty</a> was here washing<br>School started to-day, but I<br>was not going this week.<br>Mamma went to the church<br>and then to <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChatfieldMrs\"> Mrs Chatfields</a><br>Took her the church books.<br>The <a href=\"/s/ital-iasc-2q90/page/locations#QueenStBaptistChurch\"> Queen Street Baptist Church</a><br>had a service of praise this<br>evening. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChapmanMiss\"> Miss V Chapman</a> is<br>organist &amp; <a>Mrs Read-Muir</a> sang<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#ArmstrongGeorge\">Mrs George Armstrong</a> has a<br>daughter was born on New<br>Year's day.",
	"1900-01-04" : "Went over to Carman's to have<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> go with me to <a>Dunn's</a><br>greenhouse. We went about half<br>past three. I brought a primrose<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#ChaplinMiss\">Miss Chaplin</a> was in there.<br>Mamma went to <a>Mrs Klotz</a><br>at home <a>Beatrice</a> helped.<br>Papa &amp; I went to Sunday School<br>entertainment at night. Had<br>a very long programme. There<br>was a dialogue called <a href=\"/s/ital-iasc-2q90/page/literature#AuntKitty\">&quot;Aunt Ketty's [sic]<br>shopping</a> which was good, and<br>a shaving scene. <a>Mr Perry</a> gave<br>a tableful of prizes away. <a>Beatrice</a><br>came home with us. They had<br>a drill of girls &amp; they sang<br><a>&quot;Soldiers of the Queen&quot;</a>",
	"1900-01-05" : "Sweep day. I read &quot;<a href=\"/s/ital-iasc-2q90/page/literature#Camerons\">At the Camerons</a>&quot;<br>in the &quot;<a>Harper's Young People</a>&quot; when<br>mamma was sweeping. We had<br>a beggar in afternoon asking for a<br>few cents as he had a long way<br>to go. <u>Rats</u>! Went over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\"> Lee's</a><br>in afternoon after eggs. Took a<br>&quot;Young Ladies Journal&quot; <a>Mrs Pay</a> lent<br>me. Her kitty has a sore<br>tail. <a>Mrs Malcolmson</a> came after<br>eggs when I was there. She got<br>large sum of 2. Had some candy<br>at night.",
	"1900-01-06" : "Took my music lesson. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ReadAngelo\">Mr Read</a><br>had not had his breakfast when<br>I got there so <a href=\"/s/ital-iasc-2q90/page/communitymembers#CampbellMrs\"> Mrs Campbell</a><br>showed me some of <a href=\"/s/ital-iasc-2q90/page/communitymembers#CampbellRobert\">Robert<br>Campbell's</a> sketches. Mr Read<br>just had <a>2 new songs</a> he<br>designed the cover himself for<br>them. Took the <a href=\"/s/ital-iasc-2q90/page/music#CzernyCarl\">6th Etude of<br>Czerny Op 740</a>. Went to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\"> Eckhardt's</a> &amp;<br>got my <a>Mathew's History of Music</a><br>&amp; a scribbling pad. <a>Mrs Trusty</a><br>was here ironing. Mamma &amp; I<br>went uptown in the afternoon.<br>She got a very pretty chrysanthemum<br>centerpiece at <a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Miss Anderson's</a> Papa got<br>5 rabbits. Have Deceptive Cadences<br>in Harmony for next week.",
	"1900-01-07" : "My birthday 18 years Oh! I am getting<br>very old. The first Sunday<br>in the new year. Went to<br>church in the morning.<br><a>Mr Perry</a> read an address from the<br>Bishops of the different dioceses<br>for Foreign &amp; Canadian missions<br>Did not go to Sunday School as it<br>was raining. Read some in my new<br>History of Music. It is very interesting.<br>Papa, mamma &amp; I went to<br>church at night. Text &quot;There is salvation<br>in no other&quot;. <a>Charlie Merrit</a> was<br>buried this afternoon.",
	"1900-01-08" : "I really started to school this<br>morning. Staid [sic] home &amp; practiced<br>in afternoon as the club meets<br>to-night at <a>Dwyers</a>. Papa had<br>to go to <a>Lodge</a> first so mamma &amp;<br>I went. There was hardly any of<br>the club there. <a>Mrs Klotz</a> &amp; <a>Mr &amp;<br>Mrs Marshall</a> were there. <a>Mrs Klotz</a><br>won the ladies prize a little<br>hot water teapot &amp; papa won the<br>gentleman's an ebony hat brush.<br><a>Waldeman Klotz</a> called for his<br>mother. I played some &amp; so did<br>he. <a>Mrs Pay's</a> niece <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleOlive\"> Olive Boyle</a><br>died on Sunday.",
	"1900-01-09" : "Practised in the morning as I have<br>to go to school this afternoon.<br>Went to school and <a>Annie Gardiner</a><br>&amp; I sat together. Came home with<br>the trio <a>Leta</a>, <a> Laura Newman</a> &amp; <a>Nellie<br>Lloyd</a>. I went with <a>Nell</a> around Duke<br>St. Toronto is getting to be a bad<br>place. A <a>Miss Ferguerson</a> was<br>sandbagged on Friday night &amp; died,<br>then last night a young boy<br>was knocked down.",
	"1900-01-10" : "Did not go to school to-day<br>Mamma has been lengthening<br>my Heather mixture skirt &amp; I wore<br>it to-day. Went to <a>Dwyer's</a> after<br><a>Beatrice</a> to go with me to try<br>the piano in <a>Wherry's Hall</a>, but<br>she &amp; <a> May Henderson</a> went out to<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BarnesNellie\">Nellie Barnes</a> as she has been sick.<br>Went &amp; got <a>Nettie</a> to go with<br>me. The one piano is a good one<br>They are both <a>Nordheimers</a>. Papa<br>&amp; mamma went to <a>Coy's</a><br>at night. Papa got a nice<br>calendar from the <a href=\"/s/ital-iasc-2q90/page/locations#PetersCartridgeCo\"> Peters<br>Cartridge Co.</a> &amp; to-day at noon <a><br>J.N . Walker</a> the popular druggist was<br>married to-day to <a>Miss Lake</a>",
	"1900-01-11" : "Did not go to school in the afternoon. The &quot;Musician&quot; for January came to-night. I have to play at Muscial to-night. Called for <a> Beatrice</a> &amp; then Beatrice mamma &amp; I went up <a> Wellington St.</a> to meet<a> Ethel McEdward</a>. When we got the programmes there was a mistake in printing &amp; my name was not on but I played just the same. <a href=\"/s/ital-iasc-2q90/page/music/#GodardB\">&quot;Au Matin&quot; by Godard</a>. <a> Miss G. Champman</a> came home with us <a>Eva Robertson</a> played a pretty <a href=\"/s/ital-iasc-2q90/page/music/#GodardB\">&quot;Gigue&quot; by Godard</a>.",
	"1900-01-12" : "Went to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> then to school. <a>Annie Gardiner</a> intended stopping and going to the Art School in Buffalo but is not going. <a>Miss Nelson</a> is there. <a>Annie</a> &amp; I went uptown. She went to <a href=\"/s/ital-iasc-2q90/page/locations#AmericanBazaarStore\">Bazaar</a> &amp; I went to <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren's</a> after some hairpins &amp; to <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> &amp; <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lloyd's</a> after the teapot. Mamma went over to <a>Mrs Pays</a> in afternoon. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt Allie</a> sent me a birthday present. A book &quot;<a href=\"/s/ital-iasc-2q90/page/literature#Kedar\">In the Tents of Kedar</a>. She has been in Buffalo &amp; just got home on the 9<sup style=&quot;font-size: x-small;\">th</sup>",
	"1900-01-13" : "Took my music lesson. Took <a href=\"/s/ital-iasc-2q90/page/music#Mendelssohn\">No<br>27. Funeral March in &quot;Songs without<br>Words&quot; by Mendelssohn</a> &amp; the <a href=\"/s/ital-iasc-2q90/page/music#CzernyCarl\">7<sup>th</sup> Etude<br>Czerny's 749</a>. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ReadAngelo\">Mr Read</a> heard I did very well<br>Thursday. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CampMrs\">Mrs Camp</a> told him. Went<br>uptown in the afternoon to get<br>premium trading stamps. They<br>stamp ten spaces instead of giving<br>stamps. Went down to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CrawfordMiss\">Miss<br>Crawford's</a>. Miss McLaren was<br>there. Did not get home until<br>nearly six.",
	"1900-01-14" : "Did not go to church in the morning<br>as it is very rainy and sloppy.<br>Then in the afternoon did not<br>go to Sunday School as it was<br>raining harder still. Papa is reading<br>&quot;<a href=\"/s/ital-iasc-2q90/page/literature#Kedar\">in Tents of Kedar</a>&quot;. I have been reading<br>the Musicains. There is one very good<br>article on &quot;The Development of Technique<br>from Bach to Liszt&quot;. We did not<br>go to church as it was<br>rainy again. I wish we did not<br>have rainy Sundays. I finished<br>&quot;In Tents of Kedar&quot; to-night",
	"1900-01-15" : "Went to school in morning,<br>but had my walk for<br>nothing for they had the<br>weekly examinations. Miss<br>Fowler on Queen St. died<br>yesterday in the hospital.<br>Papa got five books at<br>night. Premaums [?] with the<br>&quot;Hall Hour&quot; Four by <a href=\"/s/ital-iasc-2q90/page/literature#DoyleArthur\">A. Conan<br>Doyle</a> and one by <a href=\"/s/ital-iasc-2q90/page/literature#StevensonRobert\">Robert Louis<br>Stevenson</a>. It rained very<br>hard at night.",
	"1900-01-16" : "Went to school in afternoon.<br>Papa went to Hamilton to-night<br>to the <a href=\"/s/ital-iasc-2q90/page/locations#HamiltonGunClub\">Hamilton Gun Club</a> shoot.<br>Called in Dwyer's in afternoon to<br>see if she would go with<br>mamma &amp; I to <a href=\"/s/ital-iasc-2q90/page/locations#KnoxChurch\">Knox Church</a><br>to-night. Mamma &amp; I called<br>for her at night. They had an<br>entertainment called &quot;<a href=\"/s/ital-iasc-2q90/page/literature#ParsonL\">Jerusha<br>Dow's Family Album</a>. It<br>was fine. Mrs McClive was<br>the grandmother and explained<br>each picture. Mrs McGhie<br>came home with us. Lost<br>my little black pin from my<br>skirt.",
	"1900-01-17" : "Went to school in morning.<br>Annie Gardiner is taking drawing<br>lessons at <a href=\"/s/ital-iasc-2q90/page/locations#DemillCollege\">Demill College</a>. She<br>has to go Monday, Tuesday, &amp;<br>Thursday mornings. <a href=\"/s/ital-iasc-2q90/page/communitymembers#TrustySusan\">Mrs Trusty</a><br>was here. The clothes did not dry.<br>Mamma went to Church. Mrs Haun<br>wanted to know why I had not<br>been at the Bible class for 3 Sundays<br>Mrs Greenwood &amp; Mabel had<br>an &quot;At Home&quot; Mamma<br>went. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> came home<br>with her",
	"1900-01-18" : "Practiced in the morning. Got<br>ready to go to school, but it<br>was raining. Waited for a<br>while then went uptown.<br>Got some Glycerine &amp; Celery King<br>at <a href=\"/s/ital-iasc-2q90/page/locations#WalkerAndAbbs\">Walker's &amp; Abbs</a>. Then to the<br><a href=\"/s/ital-iasc-2q90/page/locations#Lees\">library</a>. Got <a href=\"/s/ital-iasc-2q90/page/literature#AllenJames\">&quot;The Choir Invisible&quot;,<br>by James Lane Allen</a>. Went to<br><a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a> &amp; paid for my musical<br>history. Got the papers. <a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingMr\">Mr<br>Bunting</a> was in the office<br>Mamma went to Mrs Notman's<br>at Home. Mrs Pay and Mrs<br>Dudley were with her.",
	"1900-01-19" : "Was at school in the morning<br>Sat with Leta. Papa came<br>home from Hamilton last<br>night. Practiced in afternoon.<br>Mamma made a very pretty<br>cushion for parlor. Tapestry front<br>and brown back. Papa brought<br>us some candy at night. He<br>bought three tickets for the<br><a href=\"/s/ital-iasc-2q90/page/locations#RedpathConcertCo\">Redpath Concert Co.</a> that is to be<br>here on Tuesday. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ReadAngelo\">Mr Read</a> &amp; Mr<br>Macgregor are bringing them here.<br>Wrote a letter to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\"> Aunt Allie</a>",
	"1900-01-20" : "Took my music lesson. Took<br>the 7<sup>th</sup> Etude (as I did not practice<br>it for this week as I had too<br>many reviews) and <a href=\"/s/ital-iasc-2q90/page/music/#Mendelssohn\">Mendelssohn's<br>&quot;Fr&uuml;hlingslied&quot;</a>. It was raining<br>when I went, and has been<br>raining all day. <a href=\"/s/ital-iasc-2q90/page/communitymembers#TrustySusan\">Mrs Trusty</a><br>came to iron through all the<br>wet. Mamma is making<br>another cushion. It is of<br>peacock blue sateen covered<br>with Battenburg. In my<br>Harmony I had to work out<br>from exercises in Open instead<br>of Close Position.",
	"1900-01-21" : "Went to church in morning.&nbsp;<br>Sermon was Phil. 3 &amp; the 1<sup>st</sup> &amp; second&nbsp;<br>verses. Mrs Louis Meritt sat in&nbsp;<br>our seat as theirs was filled.&nbsp;<br>I finished the &quot;<a href=\"/s/ital-iasc-2q90/page/literature/#AllenJames\">Choir Invisible</a>&quot;<br>this afternoon before Sunday<br>School. Went to Sunday School&nbsp;<br>Mrs Haun gave me a &quot;Golden Text&nbsp;<br>Book&quot; for year 1900. Came home&nbsp;<br>with Lizzie. Mr O'Loughlins&nbsp;<br>mother is not expected to live.<br>Did not go to church at&nbsp;<br>night.",
	"1900-01-22" : "Did not got to school in the morning&nbsp;<br>as I took &quot;Celery King&quot;. Mamma went&nbsp;<br>out collecting for ladies aid in the&nbsp;<br>afternoon, and uptown after some&nbsp;<br>silk for doily of chrysanthemums. I<br>went uptown after some birdseed&nbsp;<br>and cotton. Went to the office <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BuntingMr\"> Mr<br>Bunting</a> and Mrs McGhie was in there&nbsp;<br>Met Helen and she said she was&nbsp;<br>coming over. The entertainmnet in&nbsp;<br><a href=\"/s/ital-iasc-2q90/page/locations/#KnoxChurch\">Knox Church</a> was repeated to-night.<br>Mr O'Loughlin's mother died&nbsp;<br>yesterday.",
	"1900-01-23" : "Went to school in the afternoon.<br>Then papa mamma &amp; I went<br>to the <a href=\"/s/ital-iasc-2q90/page/locations#RedpathConcertCo\">Redpath Concert Co.</a> The<br>concert was fine. I never heard<br>anything I liked as well. There<br>were four singers 1 violinist and<br>1 pianist. Mme Meredith soprano<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#ClaryMaryLouise\">Miss Clary</a>, contralto. Dr Carl Dufft basso<br>Mr Town, Tenor, Miss Von Fursch<br>violinist and Miss Koler pianist<br>all of them were encored twice<br>and Mr Dufft three times. All the<br>ladies got a beautiful boquet.<br>The first part was <a href=\"/s/ital-iasc-2q90/page/music#LehmanLiza\">L[iza]. Lehmann's &quot;In a Persian Garden&quot;</a>.",
	"1900-01-24" : "Went to school in the morning.<br>Annie Gardiner was not there<br>Mrs Dwyer and Beatrice called<br>in the afternoon. Beatrice and<br>Percy were at the concert but I<br>did not see them. Beatrice thought<br>it was not worth 75&cent; last<br>night. Well everybody did not<br>think so or they would not<br>have encored them as they did.<br>Mamma finished her Buttenburg<br>cushion. Hellen was coming<br>over this afternoon, but she did<br>not get here.",
	"1900-01-25" : "Went to school in afternoon, the<br>Inspector was there, dear man, I<br>did not try to answer questions.<br>Mr Henderson lent Miss Dougan<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BensonMiss\">Miss Benson</a> &amp; I his umbrella<br>as it was raining hard when<br>we came out of school. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\"> Ella</a> came<br>over and brought &quot;<a href=\"/s/ital-iasc-2q90/page/literature/#HopeAnthony\">Dolly Dialogues</a>&quot;<br>home. She borrowed our rat trap<br>At night it snowed and blew<br>phew! and I could not go to the<br>Musical which I was very sorry<br>for as it was Russian night &amp; Miss Mc<br>Farlane played. Papa brought some candy.",
	"1900-01-26" : "We burnt a lamp last night as<br>the gasbills are so high. It is very<br>nice to burn lamps. Did not go<br>to school this morning as it was<br>cold &amp; blustry. 10<sup style=&quot;font-size: x-small;\">0</sup> below zero.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanMr\">Mr Carman</a> came over with a<br>rat for Pansy to catch it, and<br>the naught thing wouldn't as the<br>rat bit him on the lip. Mamma<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMattie\">Mattie</a> went to Mrs<br>C. Moore's card party in afternoon<br>from 3 to 6 o'clock <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AdlumMrs\"> Mrs Adlum</a><br>won first Miss Bate the second<br>and <a href=\"/s/ital-iasc-2q90/page/communitymembers#ClarkKate\">Miss Kate Clark</a> the third<br>prize. The first was a tea cozey, 2<sup style=&quot;font-size: x-small;\">nd</sup><br>an orange knife, the third a<br>book.",
	"1900-01-27" : "Took my music lesson. Had<br>to go to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardts</a> after a piece<br><a href=\"/s/ital-iasc-2q90/page/music#Chaminde\">&quot;Pierrette&quot; by Chaminde Op 41</a><br>About tweleve o'clock two &nbsp;<br>women called with a book<br>they were trying to sell, and<br>were more bother than their<br>worth. Mamma &amp; I went<br>uptown. I took Mr Henderson's<br>umbrella home. I bought<br>three sponge taffy squares as I<br>had 3 coppers. Mr Overholt came<br>here. Papa went up to meet him<br>and they did not get back until 2 o'clock",
	"1900-01-28" : "Papa &amp; Mr Overhold saw Charlie<br>Gould. Did not go to church as<br>it was after time when we<br>got up from breakfast. About<br>12 o'clock Charlie &amp; Mr Dean<br>a friend of his came down.<br>When they went to catch 2.45<br>train Mr Overhold went with<br>them. Went to Sunday School<br>The lesson was the<br>&quot;Temptation of Jesus&quot; Did not<br>go at night as mamma<br>said she would go to<br>sleep as was up so<br>late last night.",
	"1900-01-29" : "Went to school in the morning<br>but <a href=\"/s/ital-iasc-2q90/page/communitymembers#CloneyMiss\">Miss Cloney</a> had went<br>home. I staid [sic] the hour and<br>the girls had a high old time<br>Called in at <a>Mrs Pay's</a> when I<br>went as she wanted to know<br><a>Mrs Notman's</a> day. Mamma is<br>working a chrysanthemum<br>centerpiece. <a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingMr\">Mr Bunting</a> came<br>home with papa for tea<br>and then they went to<br>the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a> to '<a>A Trip to<br>Coontown</a>.",
	"1900-01-30" : "They had examination at<br>school so I did not have<br>to go. <a>Mrs Killmer</a> called on<br>mamma in afternoon and<br>brought back two books papa<br>lent them. I have been<br>working some on a doily.<br><a href=\"/s/ital-iasc-2q90/page/literature/#ParsonL\">Jerusha's Dow's Album</a> was<br>repeated last night in <a href=\"/s/ital-iasc-2q90/page/locations#StBarnabasChurch\">St.<br>Barnabas Church</a>. I got an<br>invitation at noon <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\"> Allie Coy</a><br>is going to have an &quot;At Home&quot;<br>Friday afternon from 4 to 6,<br>Papa brought some buttercups<br>and peppermints. DePachman<br>the Russian painist played<br>in Toronto last night.",
	"1900-01-31" : "<a href=\"/s/ital-iasc-2q90/page/communitymembers/#TrustySusan\">Mrs Trusty</a> is here. Did not go to<br><a href=\"/s/ital-iasc-2q90/page/locations/#CollegiateInstitute\">school</a> but went to <a href=\"/s/ital-iasc-2q90/page/locations#Library\"> library</a><br>and got a book <a href=\"/s/ital-iasc-2q90/page/literature/#SwanAnnie\">&quot;The Guinea<br>Stamp</a>&quot; by Annie S Swan.<br>Mamma went to church, and<br>they got $27. The Ladies Aid is doing<br>all right. Mamma went to a<br>musicale held at <a>Mrs Larkin's</a><br>for Red Cross fund. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanWinnie\">Winnie</a><br>and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMattie\">Mattie</a> sang, <a>Louisa Groves</a><br>&amp; <a>Mrs Marquis</a> played and <a>Mr<br>Garry</a>. Papa went to <a>lodge</a> and<br>the <a href=\"/s/ital-iasc-2q90/page/locations#CitizensHouse\">Citizens House</a> supper.",
	"1900-02-01" : "Went to school in afternoon<br><a>Annie Gardiner</a> was there. She<br>has not been there for a long<br>while, She came to Queen street<br>with me. I finished &quot;<a>The Guinea<br>Stamp</a>&quot; last night I am a very<br>swift reader. Mamma went<br>out to call on <a>Mrs Klotz</a>. She<br>went uptown and bought me<br>a pair of gray kid gloves<br>for to-morrow afternoon.<br>Did my German for to-morrow<br>at night. Have 30 and 31 pages of<br>&quot;<a>Das Kalte Herz</a>&quot;.",
	"1900-02-02" : "Was at <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a> in morning Sat<br>with <a>Miss Hesiott</a>. Had the German<br>class in the Class Room. <a>Mrs<br>Pay</a> was over in the afternoon<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie Coy</a> had an &quot;At Home&quot; from<br>4 o'clock to 6. <a>Mabel</a><br>the only one ahead of me.<br><a>Mollie</a>, <a>Hellen</a>, <a>Carrie Norris</a> were<br>there. Had very nice<br>refreshment. <a>Miss Ethel Dougan</a><br>help them serve. I had to<br>take my gloves off and play",
	"1900-02-03" : "Took my music lesson <a href=\"/s/ital-iasc-2q90/page/music#Chaminade\">&quot;Pierrette&quot;<br>by Chaminade</a> and the <a href=\"/s/ital-iasc-2q90/page/music#Chaminade\">11<sup style=&quot;font-size:x-small;\">th</sup> Etude Op #40</a><br>Have to get <a href=\"/s/ital-iasc-2q90/page/music#CzernyCarl\">Six Octave Studies<br>by Czerny Op 553</a>. A man came<br>to the door peddling eggs. We<br>got 4 1/2 doz eggs to-day. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#TrustySusan\">Mrs<br>Trusty</a> did not come til noon.<br>Washed handkerchiefs and some<br>little things. Went up to<br>order those Octave Studies. Got<br>some cake at <a href=\"/s/ital-iasc-2q90/page/locations#Shelleys\">Shelleys</a>. Went<br>in to see <a>Lizzie</a>, but she was<br>not home. <a>Nettie</a> has left<br>papa. <a>Judge Senkler</a> died<br>yesterday in Winnipeg",
	"1900-02-04" : "Did not do much all day. In<br>the morning it was snowing<br>hard, then about Sunday<br>School time and night the<br>same old thing so I staid [sic]<br>at home all day which I did<br>not like. Teased <a>Pansy</a> by tying<br>meat on a string. Read some<br>in &quot;<a href=\"/s/ital-iasc-2q90/page/lliterature#WallaceLew\">Ben-Hur</a>&quot; as I have forgotten<br>it, read some in a &quot;<a>Trip<br>Through Europe</a> and a <a href=\"/s/ital-iasc-2q90/page/lliterature#DoyleArthur\">Case<br>of Identity&quot; by A Conan<br>Doyle</a>.",
	"1900-02-05" : "Went to <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a> in the morning<br>They got back their German<br>examination papers so we did<br>not have much of a lesson<br>Stopped in <a>Mrs Pay</a>'s on my<br>way home. They had just<br>recived a picture off <a>Mrs &amp;<br>Mr Pay</a> of South Africa in their<br>carriage and a Christmas card.<br>Mamma &amp; <a>Mrs Pay</a> called on<br><a>Mrs Dudley</a>, <a>Mrs J Notman</a> and<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#ArmstrongGeorge\">Mrs G Armstrong</a> Papa and<br>mamma went to Pay's at<br>night. <a>Lizzie</a> came down<br>came about 2 min. after they<br>left",
	"1900-02-06" : "I got out of going to <a href=\"/s/ital-iasc-2q90/page/locations/#CollegiateInstitute\">school</a> to-day<br>and it was a good thing as<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CloneyMiss\">Miss Cloney</a> was cranky<br>Had fun with <a href=\"/s/ital-iasc-2q90/page/communitymembers#Dexter\">Dexter</a>. Shovelled<br>the snow off the verandeh,<br>and the steps. Then threw<br>snowballs at him. <a>Leta</a> came<br>over to have me go with<br>her uptown. It was after<br>five when we went. <a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait's</a> have<br>an imitation pipe organ in<br>their window covered with<br>silver sheen dress lining.",
	"1900-02-07" : "Went to school in morning<br><a>Annie Gardiner</a> was there. There<br>was a little dog waiting outside<br>the door for some one, but I did<br>not let him in. Mamma<br>went to the church. <a>Auxiliary<br>Day</a>. There are to have the pound<br>social Friday night. Papa had<br>to go over to the station to<br>meet one of the big guns of the<br><a>Lodge</a> as they have a blowout<br>to-night <a href=\"/s/ital-iasc-2q90/page/communitymembers#ButlerDr\">Dr Butler</a> of<br>Buffalo, and <a>Mr Waterson</a> of<br>Brantford are here to attend<br>it. <a>Judge Senkler</a> is to be buried<br>in Brockville.",
	"1900-02-08" : "Went to <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a> in afternoon<br>Had to write on the board oh!!!!<br>dear. Then after school I went<br>to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a>, but they did not<br>have what I wanted. <a>Miss<br>McFarlane</a> has been sick<br>Mamma &amp; I went to the<br><a>Musical</a>. It was held in<br><a href=\"/s/ital-iasc-2q90/page/locations#KnoxChurch\">Knox Church</a>. <a>Dr Smith</a> gave a<br>paper which was very dry.<br><a>Mr Thompson</a> played <a href=\"/s/ital-iasc-2q90/page/music#Wagner\">&quot;Introduction<br>from Lohengrin by Wagner</a> on the<br>organ. I liked it the best.",
	"1900-02-09" : "Was at school. She made us<br>write a lot of sentences from<br>the translation. Went to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardts</a><br>agan, but got my Octave Studies<br>this time. <a>Miss Tucker</a> was<br>here tryig to sell tickets<br>for <a>the recital</a> they are getting<br>up. Mamma went over to<br><a>Carman's</a>. Went to the church<br>to a pound social in the<br>basement. <a>Miss Fisher</a> of<br>Thorold gave some very<br>good recitations. <a href=\"/s/ital-iasc-2q90/page/communitymembers#BurrellMr\">Mr Burrell</a><br>read. <a>Beatrice</a> played <a>Ivy<br>Southcott</a> gave a metalophone [sic] solo.",
	"1900-02-10" : "Took my music lesson. I had<br>to get a new book. <a href=\"/s/ital-iasc-2q90/page/music/#Grieg\">6 Poetic<br>Tone Pictures Op 3 Grieg</a>. Mamma<br>went with <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> to <a>Miss<br>Emily Bate's</a> mariage in<br><a href=\"/s/ital-iasc-2q90/page/locations#StGeorgeChurch\">St. Georges Church</a> in the<br>afternoon, and them uptown.<br>I was over to <a>Dudley's</a> to see<br><a>Leta</a> but she was at the<br>rink. Then I went to <a>Dwyer's</a><br><a>Beatrice</a> and I went uptown<br>and I stayed to tea. <a>Mr</a>, <a>Mrs<br>Dwyer</a>, <a>Beatrice</a> &amp; I played euchre<br>from 8 o'clock till about 10.",
	"1900-02-11" : "Went to church in the morning<br><a>Sermon Psalm XLIV. 2, 3. verses</a><br>We had a service of <a>Humiliation<br>and Prayer</a> on account of the<br>war. <a>Beatrice</a>, <a>Leslie</a> and I<br>went around to <a>Notmans</a> as I<br>wanted to tell them we could<br>not go to club on Tuesday so she<br>changed it to Wednesday. I called<br>in <a>Pay's</a> and told them. Went to<br>Sunday School. Lesson Jesus<br>and Nicodemus. Met <a>Annie Lloyd</a><br>as I was coming home and she<br>came to the corner. Papa, mamma<br>I were at Church at night. Sermon<br>John III 9<sup style=&quot;font-size:x-small;\">th</sup> verse. They song<br><a href=\"/s/ital-iasc-2q90/page/music/#Kipling\">Kipling's</a> &quot;<a>Recessional</a>&quot; this morning.",
	"1900-02-12" : "Got out of going to <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a>.<br>Mamma went calling in<br>the afternoon. She called on<br><a>Mrs Sheahan</a> and <a>Mrs C. Moore</a>.<br>I went up to <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a><br>Could not get anything I<br>wanted. Got <a href=\"/s/ital-iasc-2q90/page/literature#Hullah\">&quot;Modern Music&quot;<br>by Hullah</a>. Went to <a>the office</a><br>Papa has a new girl <a>Mabel<br>Hodge</a>. She used to live in <a>Miss<br>Frasers</a> room, when I was<br>there. <a>Miss Vandenburg's mother</a><br>died Saturday night.",
	"1900-02-13" : "I went uptown before I went to<br>school. To the office to tell papa<br>not to forgot the towels as to-morrow<br>is washday. Went to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a><br>after &quot;<a href=\"/s/ital-iasc-2q90/page/music#Grieg\">Poetische Tonbilder</a>&quot; got it.<br>When I got to school it<br>was 20 minutes to four so<br>I did not go up. Staid [sic] there<br>awhile with <a>Allie Vanderburg</a><br><a>Miss Tucker</a> is having a<br>muscial and literary concert<br>in aid of the Red Cross<br>fund to-night. Mamma and<br>papa went to <a>Dr Klotz</a><br>at night",
	"1900-02-14" : "Did not have to go to <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a> to-day<br>as they were examined in<br>Latin and Euclid. The club met<br>at <a>Notman's</a> to-night. At last!<br>All the club were there except<br>the <a>McGhie's</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#ArmstrongGeorge\">Mrs Armstrongs</a><br>and the two <a>Miss Seymours</a> were there <a class=&quot;empty\">Beatrice</a><br>and I played some. Her piece was the<br>&quot;<a href=\"/s/ital-iasc-2q90/page/music/#Suckert\">Picaninny [sic] Shuffle</a>&quot; <a>Mrs Pay</a> won<br>the ladies prize and papa the<br>gentleman's. Mrs Pays was a little<br>hand painted jewel box and tray, and<br>papa's a roller blotter with ebony<br>handle and sterling trimmings.",
	"1900-02-15" : "Went to school in the afternoon<br>Sat with <a>Leta</a>. I went by the<br>stove when <a href=\"/s/ital-iasc-2q90/page/communitymembers#CloneyMiss\">Miss Cloney</a> told us to go<br>to the board and she said she<br>thought I would find it too hot<br>which I was very glad of. Was<br>to the <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">postoffice</a> to mail two<br>letters for <a>Phoebe</a>. We waited and<br>waited for papa to come gome<br>for tea, but he did not come<br>so <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> came over<br>and we were playing the<br>second game of euchre when<br>he came sailing in. <a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingMr\">Mr Bunting</a><br>gave him his supper.",
	"1900-02-16" : "Went to <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a> in the morning<br>and <a>Miss Gardiner</a> was really<br>there with a nice cold. It<br>is quite cold out. <a>Kimberley</a><br>has been relieved. Hurrah<br>for the British, and bad luck<br>to the Boers. Papa is invited<br>out to-night to a stay<br>party. It is <a>Mr McGhie's</a><br>birthday, and <a>Mrs McGhie</a><br>is getting up a surprise<br>party for him.",
	"1900-02-17" : "Took my music lesson. Have the<br><a href=\"/s/ital-iasc-2q90/page/music#Grieg\">4<sup style=&quot;font-size:x-small;\">th</sup> &amp; 1<sup style=&quot;font-size:x-small;\">st</sup> &quot;Poetische Tonbilder</a>&quot; and<br>13<sup style=&quot;font-size:x-small;\">th</sup> Etude. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ReadAngelo\">Mr Read</a> said <a>Mrs<br>Marquis</a> and <a>Miss Noriss</a> have<br>been having a fine time in New<br>York. They heard <a href=\"/s/ital-iasc-2q90/page/music#Gounod\">Faust</a> by<br>Graw Co<sup>1</sup>Carmen, <a>Lohengrin</a> and<br>others. <a>Mrs Trusty</a> was here<br>ironing this afternoon. Mamma<br>and I went uptown in the<br>afternoon. Got a cataloggue from<br><a href=\"/s/ital-iasc-2q90/page/locations#SteeleBros\">Steeles'</a> for <a>Phoebe</a>. <a>Mr</a> and<br><a>Mrs Dwyer</a> were over at night<br><a>Leslie</a> caught four muskrats<br>to-day. Got our tickets for<br><a>recital</a> Tuesday night.",
	"1900-02-18" : "Went to church in the morning<br>The Bishop is here and<br>preached both morning and<br>evening. Morning sermon<br>was Rev 12. 7 verse. Was at<br>Sunday School in afternoon.<br>The lesson was &quot;The Woman<br>of Samaria. We have to find<br>out all we can about Sychan<br>or Shechem for next Sunday<br>Mamma &amp; I went at night<br>could not get papa to go. Sermon<br>II. Corinthians 11 chapter 17 verse.",
	"1900-02-19" : "Went to <a href=\"/s/ital-iasc-2q90/page/locations#ColliegiateInstitute\">school in morning.<br>Had a review of the 8<sup style=&quot;font-size:x-small;\">th</sup>, 9<sup style=&quot;font-size:x-small;\">th</sup> and<br>10<sup style=&quot;font-size:x-small;\">th</sup> chapters. It said in the</a><br><a>Star</a> to-night that the Bishop<br>preached two of the best<br>patriotic sermons ever heard<br>in St. Catharines. They are<br>going to have a concert in<br>the church to-night for the<br>benefit of the Sunday School.<br>Could not go as papa and<br>mamma went over to <a>Dwyer's</a><br><a>Mr Dwyer</a> wanted to see papa<br>about some <a>lodge</a> busniess.<br>The British are entering<br>Dodrecht and killed lots of<br>Boers.",
	"1900-02-20" : "Papa did not come home for<br>dinner. Took dinner with<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingMr\">Mr Bunting</a>. Did not go to<br><a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a>. Mamma went calling<br>Papa could not go with us<br>to the recital to-night so<br>mamma &amp; I went. It was given in<br><a>Masonic Hall</a> under auspices of<br>the <a>Musical Circle</a>. Proceeds in aid of<br><a>Hospital</a>. <a>Miss Durno</a>, pianist, and<br><a>Miss McCallum</a> reader. I liked<br>the <a href=\"/s/ital-iasc-2q90/page/music#Leschetizky\">Tarantelle by Leschetizky</a><br><a href=\"/s/ital-iasc-2q90/page/music#Schumann\">Schumann's Allegro</a> from <a>Taschingschwank</a><br>and <a href=\"/s/ital-iasc-2q90/page/music#Liszt\">Rhapsody No.12 by Liszt</a>",
	"1900-02-21" : "Papa went to Toronto to-day<br>to Dental Convention which<br>lasts to-day, to-morrow and<br>Friday. Was at <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a> in<br>morning. Sat with <a>Laura<br>Newman</a>. Mamma went to<br>the church as it is the<br>annual meeting of the <a>Womans<br>Auxilary</a>. Shes has given up<br>the Recording Secretaryship as she<br>has had it ever since it<br>was organized and is now on<br>the Board of Management. It<br>is reported Ladysmith has<br>been relieved. Several<br>Canadians have been killed and<br>wounded.",
	"1900-02-22" : "Did not go out of the house<br>all day Mamma made<br>a fruit cake. I painted on<br>a toy drum Mamma has<br>got for the booby Monday.<br>&quot;Something you can beat&quot;<br>Papa went from Toronto to<br>Buffalo to the Mason's<br>banquet in honor of the Grand<br>Master of New York<sup>1</sup>. I wanted to<br>go to the Musical but oh! my<br>the weather so I played<br>selections from <a href=\"/s/ital-iasc-2q90/page/music#Schubert\">Schubert</a> &amp; <a href=\"/s/ital-iasc-2q90/page/music#Bach\">Bach</a> &amp; C[?]<br>as it was German night and and dreamt I was there",
	"1900-02-23" : "Went to <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a>. <a>Annie Gardiner</a><br>was there, and she asked<br>me to go uptown with her so<br>I did. We did not have to<br>stay at school as <a href=\"/s/ital-iasc-2q90/page/communitymembers#CloneyMiss\">Miss Cloney</a><br>was not there. Mamma went<br>out on a collecting trip. We lost<br>our neighors yesterday.<br><a>Beatrice</a> brought me a programme<br>of the Musical this afternoon.<br>Papa came home to-night<br>and brought mamma a pair<br>of rubber gloves and me two<br>pieces. <a href=\"/s/ital-iasc-2q90/page/music#Loraine\">&quot;Salome&quot; by Wm. Loraine</a><br>and <a href=\"/s/ital-iasc-2q90/page/music#Hoffman\">Ben-Hur Waltzes by Charles Hoffman</a><br>They are very pretty.",
	"1900-02-24" : "Took my music lesson. The <a href=\"/s/ital-iasc-2q90/page/music#Grieg\">2<sup style=&quot;font-size:x-small;\">nd</sup><br>Poetic Tonepicture of Grieg</a> and 14<sup style=&quot;font-size:x-small;\">th</sup><br>Etude Shave Modulation of a Passage<br>of Music for next day in Harmony.<br>It has been raining nearly all<br>day. I wrote a letter to <a>Mamie</a>.<br>Mamma went uptown to<br>get the prizes for Monday<br>night and to <a href=\"/s/ital-iasc-2q90/page/locations#RidleyCollege\">Ridley College</a> to see<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CleghornMiss\">Miss Cleghorn</a> about the auxiliary<br>Mamma got a pack of cards for<br>gentleman's prize and a cute cup<br>and saucer for the ladies. Papa<br>brought some peanuts home at night.",
	"1900-02-25" : "Went to church in the morning<br>It was so cold in the church<br>that <a>Mr Perry</a> would not preach<br>the sermon he had prepared<br>so he read an appeal for<br>the Lenten season from our<br>Bishop. <a>Beatrice</a> wanted me to<br>come Queen St but when we<br>got to the church door, and saw<br>the snow, and heard the wind I<br>didn't see the point. Read the<br><a href=\"/s/ital-iasc-2q90/page/literature#IngrahamJoseph\">Prince of the Home of David</a>.<br>I enjoyed it very much,<br>Papa is reading &quot;<a href=\"/s/ital-iasc-2q90/page/literature#WallaceLew\">Ben-Hur</a>&quot;<br>Did not go to church at night",
	"1900-02-26" : "It was very cold and I did<br>not go to <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">school</a>. <a>The Ladies<br>Home Journal</a> came to-day<br>The club meets here to-night<br>They were all here expect<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#ArmstrongGeorge\">Armstrongs</a> and <a>McGhies</a>.<br><a>Mr Pay</a> won the gentleman's<br>prize <a>Mrs Macgregor</a> the ladies<br>and <a>Mrs Notman</a> the booby<br>As we were eating lunch<br>the cannons started to go<br>off and we thought Ladysmith was relieved some, <a>Mr Macgregor</a> is<br>not going to clean his boots until it is relieved.",
	"1900-02-27" : "It was a false report about<br>Ladysmith, but <a href=\"https://militarybruce.com/the-last-surviving-royal-canadian-regiment-veteran-of-the-battle-of-paardeberg-died-47-years-ago/\">Cronje</a> had<br>surrendered. They had a<br>patriotic concert in the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">opera<br>House</a> last night for Red Cross<br>fund. Mamma went uptown in<br>afternoon and I went afer<br>to the <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">Post office</a> and <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a><br>I sent for three pieces of 10 cent<br>music from <a href=\"/s/ital-iasc-2q90/page/locations#DentonCottierAndDaniels\">Denton Cottier &amp; Daniels</a><br>Buffalo. They were at the <a href=\"/s/ital-iasc-2q90/page/music#Liszt\">Spring by Liszt</a><br><a href=\"/s/ital-iasc-2q90/page/music#Leschetizby\">Two Larks by Leschetizby</a>, &amp; <a href=\"/s/ital-iasc-2q90/page/music#Wagner\">Tannhauser<br>March by Wagner</a>. I got the &quot;<a>Heavenly<br>Twins</a>&quot; out of the Library. Mamma<br>got a color cord (Corticelli) and the<br>colors are grouped so harmoniously<br><a>Phoebe</a> got a letter from <a>Jennie Tucker</a>",
	"1900-02-28" : "Last night the boys and men<br>celebrated <a href=\"https://militarybruce.com/the-last-surviving-royal-canadian-regiment-veteran-of-the-battle-of-paardeberg-died-47-years-ago/\">Cronje's</a> surrender<br>by bonfires, firecrackers<br>and the band played on.<br>They stole about $50 worth<br>of boxes from <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLarens</a> and<br>sent in a false alarm to get the<br>firement out. Mamma went to<br>church as it is the Ladies Aid<br>monthly meeting. There she staid [sic]<br>to the first Lenten service. To-day is<br>Ashwednesday. <a>Phoebe</a> got a picture<br>of <a>Edna Potters</a>. It has been snowing<br>nearly all day. Papa brought some peanuts home.",
	"1900-03-01" : "When I awoke this morning the<br><a>Meritton whistle</a> was blowing<br>pretty soon the Town bell then<br><a href=\"/s/ital-iasc-2q90/page/locations#StGeorgeChurch\">St George's Chruch</a> chimes so I<br>knew <a>Ladysmith was relieved</a><br>Hurrah! It has been blowing<br>and snowing Oh! how hard.<br>It is the worst snowstorm<br>we have had this year.<br>Another day in the house.<br>Mamma strained her wine<br>to-day. I arranged the pictures<br>in my room as I had got<br>tired of them. I found a pretty<br>picture yesterday in an old<br><a>Montreal Star</a> of the Madonna and<br>Christ child so I put it up",
	"1900-03-02" : "The <a href=\"/s/ital-iasc-2q90/page/locations#RidleyCollege\">Ridley boys</a> were out in full<br>force yesterday with Kruger's dummy<br>on a stretcher. Yesterday afternoon<br>was a holiday and the people<br>were wild. It was papa's<br>birthday yesterday. They had a<br>free concert in the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a><br>last night by the band. Got<br>my music I sent for on Tuesday<br>and a catalogue besides. <a>Tannhauser<br>March</a> and <a>Two Larks</a> are pretty, but<br>the other one is hard.",
	"1900-03-03" : "Took my music lesson <a>Cradle Song</a><br>by <a>Mendelssohn</a>. <a>Mr Read</a> played<br>an introduction and the first part<br>of a cycle of Japanese songs. The<br>introduction is very pretty and<br>is founded upon the Japanese<br>scale. <a>Mrs Trusty</a> is here.<br>Mamma and I were uptown.<br>Mamma got a waist for working<br>in and me some print for<br>a blouse waist. We saw <a>Mrs<br>Pay</a> and she had just been in<br><a>Dwyer's</a> before she came uptown,<br>and the thought <a>old Mrs Dwyer</a><br>was dying.",
	"1900-03-04" : "Was at church in the morning<br>Sermon <a draggable=&quot;false\">Phil 3. 13 &amp; 14<sup style=&quot;font-size:x-small;\">th</sup> verses</a><br>Communion Sunday. In the<br>afternoon it was snowing<br>hard so I did not go to<br>Sunday School. Mamma had<br>a headache so we did not<br>go at night. I read &quot;<a draggable=&quot;false\">Titus</a>&quot;<br>over again. The chief character<br>is Titus the son of the high priest<br>Caiaphas, but he was stolen by<br>a servant Prisea when he was young<br>and her husband was a ruffian and<br>Titus &amp; the supposed father were the thieves hung<br>on the cross at Christ's crucifixion.",
	"1900-03-05" : "tarted back to school after a<br>week's rest. They got back<br>their French papers. Called in<br><a draggable=&quot;false\">Dwyer's</a> to see how <a draggable=&quot;false\">old Mrs<br>Dwyer</a> was. She is just about<br>the same. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> was over in<br>the afternoon she brought my<br><a draggable=&quot;false\">Mildred books</a> &amp; mousetrap back.<br><a draggable=&quot;false\">Mrs Jeeves</a> is sick and is to<br>have an operation performed this<br>afternoon at the hospital.<br>I went to the church to the<br>5 o'clock service. <a draggable=&quot;false\">Mr Perry</a> spoke<br>on the first chapter of <a draggable=&quot;false\">Romans<br>from 13 to 17</a> verses.",
	"1900-03-06" : "<a>Old Mrs Dwyer</a> died this morning<br>and is to be buried Thursday<br>in <a href=\"/s/ital-iasc-2q90/page/locations#CoEBurialGround\">English Church burying ground</a><br>at Port. It has been thawing<br>nearly all day, and the<br>walking is awful. Papa<br>got water in over his overshoes<br>Did not go to school. Wanted<br>to go to the church, but<br>walking was too bad.",
	"1900-03-07" : "The walks have frozen to-day<br>and the walking is as bad<br>as ever. Very rough. <a>Miss Eva<br>Vine</a> fell on Queen St. in<br>front of <a href=\"/s/ital-iasc-2q90/page/locations#ThomsonAndMoores\">Thomson &amp; Moores</a> office<br>and she was unconcious [sic] for 20<br>minutes. Did not go to school<br>or church. Was over to Carman's<br>in afternoon. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> was showing<br>me the darning needle work.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#RollsWinnie\">Winnie</a> was showing me some<br>of her Christmas presents. She got<br>a very nice picture with <a>Mozart</a>, <a>Shubert</a>,<br><a>Beethoven</a>, <a>Mendelssohn</a>, <a>Wagner</a>, &amp; <a>Haydn</a><br>framed in it. She got a silver pudding<br>dish with her stamp book.",
	"1900-03-08" : "<a>Mrs Dwyer</a> was buried this afternoon<br>Mamma and I went to church.<br>We were late. We had <a>Mr Miller</a><br>as I suppose <a>Mr Perry</a> was at the<br>funeral. Then we went to the <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">Post</a><br>Mamma sent for some samples from<br><a>Simpson's</a>. We really went to the<br><a>Musical</a> to-night. <a>Mr Williams</a><br>led it. <a>Miss Macfarlane</a> played a<br>pretty <a>Bercuse</a> [sic] by <a>Selytte</a><br>and <a>Mr Thompson</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers#BursonMiss\">Miss Burson</a><br>played <a>Chaconne</a> by <a>Jadassohn</a> I<br>liked these the best. It was<br><a>Scandinavian night</a>.",
	"1900-03-09" : "Went to school. <a>Annie</a> was<br>there. She went with me<br>as far as the <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a>. I<br>got &quot;<a>A House-Boat on the<br>Styx</a>&quot;, by <a>J. K. Bangs</a> after<br>so long as I have been<br>trying to get it for nearly<br>a year. Finished it to-night.<br>We expected <a>Dr</a> and <a>Mrs<br>Klotz</a> over to spend<br>the evening, but they<br>did not come. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMattie\">Mattie</a> is<br>going back in the choir and<br><a>Frank</a> too.",
	"1900-03-10" : "Took my music lesson. Took the<br><a>17<sup style=&quot;font-size:x-small;\">th</sup> Song</a> and <a>15<sup style=&quot;font-size:x-small;\">th</sup> Etude</a>. Had<br>to go to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a> after <a>March<br>Op. 39. No 1.</a> by <a>Hollaender</a> and <a>Valse<br>Serenade Op 71.</a> by <a>Godard</a>. Met<br><a>Percy</a> and <a>Beatrice</a> as I was<br>coming home. Mamma and I<br>went uptown. Stopped in <a>Mrs<br>Pay</a>'s and she went with us.<br>As we were comming home<br>met <a>Helen</a> and I went back<br>uptown with her. I took the<br><a>Musical</a> programme &amp; a catalogue to<br><a>Beatrice</a>. <a>D. M. Walkers</a> had a bargain? sale.",
	"1900-03-11" : "Was at church in the morning.<br>We had <a>Mr Gardner</a> of<br>Port. He was preaching on the<br>different missions they want<br>us to contribute to next Sunday.<br>The text was in Psalms the Lord is<br>King. Went to Sunday School<br>lesson &quot;<a>The Paralytic healed</a>.&quot;<br>Mamma, papa &amp; I were to church<br>at night. We had <a>Mr Perry</a> Sermon<br><a>St John V. 39 &amp; 40</a>. <a>Mr</a> and <a>Mrs<br>Macgregor</a> were down<br>at night. <a>Mollie Phelps</a> was<br>with <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie Coy</a> to church in<br>the morning. The sermon to<br>night was God's appeal to the<br>intellect.",
	"1900-03-12" : "Did not go to school in<br>the morning Mamma<br>went to Mrs Len Smiths to get<br>a shirtwaist pattern and<br>to Mrs Pay's to show her<br>some samples we got from<br><a href=\"/s/ital-iasc-2q90/page/locations#AMurrayAndCo\">Murray's</a>. I went to <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> &nbsp;<br>and got &quot;But Men must work by<br>Rusa N. Carey. Then I went to<br>church. Mamma went too Mr Perry<br>is speaking on prayer this week<br>To-day it was about the women<br>of Samaria asking Jesus where to pray<br>at Jerusaleum &amp; Samaria and He answers<br>neither as God is a spirit and we must<br>worship in spirit and truth.",
	"1900-03-13" : "Mrs Jeeves died yesterday morning<br>in the hospital. Papa brought<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingMr\">Mr Bunting</a> home to dinner.<br>Did not go to school again<br>Went over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> and<br>then to church. The subject<br>for to-day was taken from<br>Matt VI. &amp; 6 verse. It was about<br>praying to God in secret and<br>He will rewarded us openly.<br>The March Musicians came<br>to-day <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanWinnie\">Winnie</a> came home<br>with me I was introduced to<br>Miss Lampman. Mrs Lovelace &amp;<br>Mrs McCordick called on mamma<br>Lizzie was down at night.",
	"1900-03-14" : "Mrs Trusty was here this<br>morning. Did not go to<br>school. Mrs Jeeves was<br>buried this afternoon.<br>Papa went to the house.<br>The coffin was a mass<br>of flowers. Mrs L. Smith<br>came over this afternoon,<br>and cut out a new waist<br>pattern. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr Coy</a> sent over<br>some moose steak. First<br>we ever had. Mr Coy is<br>alone and he had a few friends<br>in. Papa went over.",
	"1900-03-15" : "Guess I won't go to school<br>any more. I went over to<br><a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> and I met <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a>.<br>She was going up to the<br>millnery openings. Bobs[sic]<br>is in Blonfontein [sic] and<br>sleeping in Steyn's house.<br>I went to see Mrs Dwyer and<br>uptown. She came to<br>church too. Mr Perry spoke<br>on Matt VII. 7. Seek and ye shall find<br>ask &amp; receive, knock and it shall be<br>opened. We got our goods from<br><a href=\"/s/ital-iasc-2q90/page/locations#AMurrayAndCo\">Murray &amp; Co.</a> for shirtwaists and<br>mamma got enough goods at <a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait's</a> for one.",
	"1900-03-16" : "In the afternoon I went<br>uptown. Called for Beatrice<br>but she was out with<br>Percy. Went to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a><br>Got my pieces to-day.<br>Mr. Thomspon was in there.<br>Went to <a href=\"/s/ital-iasc-2q90/page/locations#Dunns\">Dunn's</a> and bought<br>a shamrock for to-morrow.<br>He said they came from<br>Ireland. Mr and Mrs<br>Pay were over at<br>night. They played<br>euchre.",
	"1900-03-17" : "St. Patrick's Day. Took my<br>music lesson. Mr Read<br>asked me where my green<br>was and told me to come home<br>and put it on. Took the &quot;Marsch&quot;[sic]<sup style=&quot;font-size:x-small;\">1</sup><br>by Hollaender. The other was<br>wrong and I had to take it<br>back. I wanted the one by<br>Benj. Godard and the one I got<br>was by Ch. Godard and was<br>not much good. Very cold.<br>Mamma and I did the<br>ironing as Mrs Trusty did<br>not come.",
	"1900-03-18" : "Did not go to church in the<br>morning. It is warmer, but<br>snowing nearly all the<br>time. Those Evangelists <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CrossleyHughT\">Crossely</a> [sic]<br>and Hunter<sup style=&quot;font-size:x-small;\">1</sup> are in Toronto.<br>I suppose the Methodisits will<br>try to get them here as they<br>were here a few years ago.<br>Did not go to Sunday School<br>but papa, mamma &amp; I went<br>to church at night. Sermon<br>St. John XIV &amp; 1 verse. It<br>was God's appeal to the heart.<br>Rained at night.",
	"1900-03-19" : "Very bright, and warm this<br>morning. Finished the<br>Harmony for next Saturday<br>this morning. It is<br>getting hard. Am at Part<br>II. Suspensions. Papa said<br>at noon that water was<br>very cheap as it has been<br>thawing and the rain last<br>night. I intended going to<br><a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> and church but<br>it rained very hard.",
	"1900-03-20" : "My blue print waist Mrs<br>Smith cut out is finished<br>Papa and Mr Marquis<br>went to the Falls this<br>evening. I went to the<br><a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> and got &quot;The<br>Incidental Bishop&quot; by<br>Grant Allen. Got the papers<br>as papa did not come home<br>and then went to church<br>It was very smoky. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanWinnie\">Winnie</a><br>came home with me.<br>De Pachmann gave a piano<br>recital in Buffalo last night.",
	"1900-03-21" : "Mamma went to church<br>this afternoon. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> came<br>over in the afternoon.<br>Her little bird is dead.<br>I went to <a href=\"/s/ital-iasc-2q90/page/locations#WWGreenwoods\">Greenwoods</a><br>for Phoebe then went<br>to church. Mr Perry<br>spoke on St. John IV 63 &amp; 68.<br>It was smoky again.<br>Mamma &amp; I went<br>uptown after to <a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Miss<br>Anderson's</a>, <a href=\"/s/ital-iasc-2q90/page/locations#Shelleys\">Shelleys</a>, <a href=\"/s/ital-iasc-2q90/page/locations#MYKeating\">Keatings</a>,<br>and Greenwood's after the<br>things as they have no<br>boy.",
	"1900-03-22" : "Mamma went out collecting<br>and then she went<br>uptown and to church.<br>She got my piece Valse<br>Serenade Op 71 by Godard.<br>We went to the Musical<br>at night Mrs Marquis<br>played the prettiest one<br>Premiere Mazurka by Strelezki<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a> played, but I did<br>not like her piece.<br>Got a letter from<br>Mamie.",
	"1900-03-23" : "I started to read &quot;In<br>Black &amp; White by Kipling<br>but it is very funny.<br>I do not care much for it.<br>Mrs Len Smith was over<br>in the afternoon. Got<br>the Ladies home Journal.<br>I am reading &quot;The Parson's<br>Butterfly&quot; in it. It is a nice<br>story. I had to go over to<br><a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> before tea. Mrs Smith<br>was with me. Laura<br>brought us buttermilk. Mamma<br>was down to see Maggie about<br>making <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt Allie</a> a dress.",
	"1900-03-24" : "Took my music lesson. Took<br>16<sup style=&quot;font-size:x-small;\">th</sup> Etude. I have to copy<br>the Harmony from the full<br>score to the open using<br>the treble, alto, tenor, and<br>bass clefs. In the afternoon<br>Leta came after me and<br>we were down to her aunts<br>and then uptown. Mamma<br>was uptown, and bought<br>me goods for a shirtwaist<br>red and white. Mrs Pay<br>has been sick.",
	"1900-03-25" : "Went to church in the morning<br>Sermon St. Matt IV. 1 verse.<br>It is nice and warm this<br>morning. Was at Sunday<br>School. We have to find<br>how long Christ's ministry<br>lasted for next Sunday. To-night<br>the sermon is to be &quot;God<br>and the concience. Did not<br>go, but papa and I went<br>to the <a href=\"/s/ital-iasc-2q90/page/locations#QueenStBaptistChurch\">Queen St. Baptist</a>. Mr<br>Trotter preached. Exodus XII. 22 &amp; 23<br>verses. Saw Beatrice as we<br>were coming home.",
	"1900-03-26" : "Made marmalade. Papa and<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingSidney\">Sidney Bunting</a> went to the<br>Falls. Mamma and I<br>went to the club at night<br>It was at <a href=\"/s/ital-iasc-2q90/page/communitymembers/#ArmstrongGeorge\">Armstrong's</a>. There<br>were only six of the club<br>there and Mr &amp; Mrs J. Jeffrey<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BuchananDr\">Dr Buchanan</a>, <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BurleighWill\">Will Burleigh</a>,<br>Miss Harris, &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CreelmanMr\">Mr Creelman</a> Mrs<br>Jeffrey's brother. Saw the baby.<br>Dr Buchanan came home<br>with mamma &amp; I",
	"1900-03-27" : "Mamma was out collecting<br>in afternoon at <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy's</a><br>Mrs Smith's Mrs Reynold's<br>Mrs Pay is sick with<br>grippe and he has been<br>sick. Mrs Varley called on<br>mamma. Papa and Sid<br>went to the Falls<br>again to-night. They<br>me[?] after <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BeattyHerbert\">Mr Herbert<br>(Irrigation) Beatty</a>. Sid came<br>and staid [sic] here all night.<br>They got home about 1<br>o'clock.",
	"1900-03-28" : "They have <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BeattyHerbert\">Mr Beatty</a> in<br><a href=\"/s/ital-iasc-2q90/page/locations#WellandJail\">Welland jail</a> Sid was here<br>for breakfast Mamma<br>went to the Ladies Aid<br>meeting and staid [sic] to church.<br>I took a jar of marmalade<br>over to Mrs Pay. She is<br>better. Then I took Beatrice<br>the Musical programme.<br>Beatrice and I went up to<br><a href=\"/s/ital-iasc-2q90/page/locations#Shelleys\">Shelley's</a> after cake and I<br>staid [sic] to tea. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChapmanGenevra\">Miss G. Chapman</a><br>showed us the programme<br>of the sacred concert to be held in<br><a href=\"/s/ital-iasc-2q90/page/locations#QueenStBaptistChurch\">Queen St. Baptist Church</a> on Monday.",
	"1900-03-29" : "I sent 4 cents for some sample<br>pictures from Beverly Mass.<br>and I got them last night.<br>Gen. Joubert commander<br>of Boer forces died yesterday<br>at Pretoria. They say Kruger<br>is to take command. Went<br>to church in afternoon. Mr<br>Perry spoke on Matt 6. 10 verses.<br>&quot;They will be done in earth as<br>it is in Heaven&quot;. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChapmanMiss\">Miss V. Chapman</a><br>gave me a programme for the<br><a href=\"/s/ital-iasc-2q90/page/locations#QueenStBaptistChurch\">Queen St. Baptist</a> Sacred Concert<br>Papa, mamma, &amp; I intended going<br>to Welland Ave. Church to hear<br>a lecture on Boer War by Dr<br>Livingstone but we didn't.",
	"1900-03-30" : "Carrie is seriously ill in Santa<br>Barbara. Mr Gould started there<br>on Wednesday. I sent for<br>26 picutes from <a href=\"/s/ital-iasc-2q90/page/locations#BrownAndCo\">Brown &amp; Co.</a> this<br>morning. Went uptown when<br>mamma was sweeping to<br>the <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">Post</a> and <a href=\"/s/ital-iasc-2q90/page/locations#Library\">Library</a>. Got The<br>Pursuit of the House Boat,<br>by John K. Bangs. Laura brought<br>the buttermilk. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr Coy</a> wanted<br>papa to go to the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a><br>to-night. The play is<br>&quot;Zaza&quot;[?].",
	"1900-03-31" : "Took my lesson. Took the 17<sup style=&quot;font-size:x-small;\">th</sup><br>Etude ad Valse Serenad&eacute;<br>by Godard. Mrs Trusty came<br>to iron. Mamma and I<br>went uptown. It was<br>premium day at stamp<br>store. Got 10 stamped. Mamma<br>got a new waist called<br>coin spot at <a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait's</a> and I<br>got two rings for a pulley<br>belt, the newest belt. Saw<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#ArmstrongGeorge\">Mr Armstrong</a> in <a href=\"/s/ital-iasc-2q90/page/locations#WalkerAndAbbs\">Walker &amp; Abbs</a><br>and he was asking me<br>whether I had been having<br>better luck than when I saw<br>him last.",
	"1900-04-01" : "Went to church in the<br>morning Sermon <a>Matt. 28-19</a>.<br>It was nice and warm<br>this morning. Left my cape<br>off, and put on my jacket to<br>my green skirt when I<br>went to Sunday School. <a href=\"/s/ital-iasc-2q90/page/communitymembers#RollsWinnie\">Winnie<br>Rolls</a> is coming to the Bible<br>class. The lesson was the<br>&quot;<a>Beatitudes</a>&quot;. Papa went for a<br>walk. <a>Mr. Coy</a> went with him.<br>Papa, mamma, and I went<br>to church at night. I think the<br>sermon was &quot;The Soul, its flight<br>outward &amp; upwards&quot;. <a>Mr Kimberley</a><br>sang.",
	"1900-04-02" : "Was raining in the afternoon<br>and I was going to church<br>but was misty. Papa and<br>I intended going to the<br>concert in the <a href=\"/s/ital-iasc-2q90/page/locations#QueenStBaptistChurch\">Queen St.<br>Baptist Church</a>. But it was<br>raining harder than ever,<br><a>Mrs Read-Muir</a> was the first<br>on the programme. They had<br>the <a>Halleluyah chorus</a> of<br><a>Handel's</a>. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMattie\">Mattie Coy</a> and <a>Mrs<br>Van Dusen</a> were in an<br>octette.",
	"1900-04-03" : "Mamma has my blue waist from<br><a href=\"/s/ital-iasc-2q90/page/locations#AMurrayAndCo\">Murray's</a> nearly finished. I started<br>over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> and I met <a>Mrs Haun</a><br>and <a>Mrs Keyes</a> so I had to come<br>back. I intended going to church<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CarrollLillie\">Lillie Carroll</a> was in. Papa and I<br>went to the confirmation in the<br>church to-night. There were 5<br>ministers beside the <a>Bishop</a>. <a>Mayde</a><br>and <a>Grace Greenwood</a>, and the <a href=\"/s/ital-iasc-2q90/page/communitymembers/#Cougles\">3 Miss<br>Cougles</a> were confirmed. The Bishop<br>spoke on <a>Gen 3.8 verse</a>. He told about<br>concience [sic] before a sin was committed<br>pleading, and telling us to resist and after<br>it was committed it rebukes.",
	"1900-04-04" : "I sent for some pictures on Friday<br>from Beverly, Mass and they came<br>to-day, but they sent them to<br>the customs, and charged 5 cents<br>Mamma went to the church<br>to Auxiliary. Then I went to<br>the service. <a>Mr. Perry</a> spoke on <a>1<br>Peter 1.4 verse</a>. The Bishop staid [sic] at<br><a>Merritt's</a> and conducted the Lenten<br>service in <a href=\"/s/ital-iasc-2q90/page/locations#StGeorgeChurch\">St. George's Church</a> yesterday<br>afternoon. Papa brought the pictures<br>home. They are very nice. There are<br>a lot of them on the &quot;Life of Christ&quot;.<br><a>Dr</a> &amp; <a>Mrs Klots</a> were here in<br>the evening. They played <a>King<br>Pedro</a>",
	"1900-04-05" : "I was over to <a>Mrs Pay's</a> in the<br>afternoon to see how she was.<br>She intends having the club on<br>Monday evening. From there I<br>went to <a href=\"/s/ital-iasc-2q90/page/locations#InksaterBros\">Inksater's</a>. Mamma ordered<br>some cotton yesterday, but it did not come<br>Then I went to church. <a>Mr Perry</a><br>spoke on the same verse as yesterday.<br>&quot;An inheritance uncorruptible, undefiled<br>and unfading&quot;. He said God was the<br>only person that was not corruptible, defiled<br>or fading. Mamma, <a>Phoebe</a> &amp; I sent for<br>some seeds from <a href=\"/s/ital-iasc-2q90/page/locations#SteeleBros\">Steele Bros</a>. I ordered<br>an elephants ear (variegated).",
	"1900-04-06" : "<a>Sweep day</a>. In the afternoon<br>I practiced. Papa brought<br>home a magazine &quot;<a>The Wide<br>World</a>, at night. There was<br>one piece that told about<br>the awful sufferings<br>of a missionary in South<br>Africa and it gave his<br>picture. Papa went to<br>a stag party <a>Mr F. Southcott</a><br>gave at night. Each had a<br>carnation and a little Union<br>Jack.",
	"1900-04-07" : "Took my music lesson. <a>Mr<br>Read</a> heard some good news<br>about me. Someone from the<br>college said I was the best young<br>player in <a>Musical</a>. He wants me<br>to go to the closing, and after it<br>start in Sept. to go and practice<br>duos, quartettes &amp; c. He gave me <a>Basque<br>Danse</a>, one of his own. I went over<br>to <a>Leta's</a> in afternoon. <a>Mrs Dudley</a><br>she and I went uptown. She<br>got a new pair of shoes.",
	"1900-04-08" : "Went to church. The sermon<br>was <a>John 12. 19 verse</a>. This is<br>Palm Sunday. I put up<br>some of the Brown pictures<br>in my room when I got<br>home. Went to Sunday School<br><a>Lizzie</a> came to meet me. Our<br>lesson on the paper was &quot;Christ<br>Crucified&quot;, but <a>Mrs Haun</a><br>took the regular lesson<br>Precepts and Promises. Papa<br>and mamma went for a<br>walk. Did not go to<br>church at night.",
	"1900-04-09" : "Staid [sic] at home and practiced<br>to-day as the club meets<br>at <a>Mrs Pay's</a> to-night.<br>Papa, mamma and I went.<br><a>Notmans</a> couldn't come so<br>Mrs Pay got <a>Percy</a> and<br><a>Beatrice</a> to come. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#ArmstrongGeorge\">Armstrongs</a><br>and <a>Macgregor's</a> were there<br>Beatrice won the ladies prize<br>a bottle of perfume. <a>Mr<br>Macgregor</a> the gentleman's a<br>knife and Mr Armstrong<br>the booby a chocolate hen.<br>Papa borrowed a book &quot;<a>Farmer Ballads</a>.",
	"1900-04-10" : "At noon papa brought home<br>a box of seeds from <a href=\"/s/ital-iasc-2q90/page/locations#SteeleBros\">Steele's</a><br>My elephant's ear was in it<br>The bulbs will come later<br>Mamma got a letter from<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt Allie</a> she is not coming<br>next week. We heard from<br><a>Carrie</a> she is much better. I<br>went to <a href=\"/s/ital-iasc-2q90/page/locations#MYKeating\">Keatings</a> to have one<br>of my little pictures framed a<br>head of Christ. Got '<a>A Kentucky<br>Cardinal</a>&quot; out of the <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a>.<br><a>Annie Lloyd</a> came home with<br>me as far as <a>Lock II hill</a>.<br>They had a great time at school. They<br>got up a petition not to go to<br>school next two days everybody signed<br>it and <a>John</a> caught them",
	"1900-04-11" : "<a>Mrs Trusty</a> is sick so we had a<br><a>Miss Freeman</a> to wash. Early in<br>the afternoon I went over to <a>Dwyer's</a><br>and asked <a>Beatrice</a> to go with<br>me to <a href=\"/s/ital-iasc-2q90/page/locations#GraniteHall\">Granite Hall</a> to practice my piece<br>We went, and I came home<br>with her. Then she came<br>home with me for tea.<br>We played euchre, and<br>beat all but one game Papa<br>went to Thorold. Percy came<br>after <a>Beatrice</a>. They leave some<br>violets out, and they smell<br>like spring. Raining hard.",
	"1900-04-12" : "Went over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> in morning<br>looks like rain. We were<br>to have our ironing done<br>but she had to go to <a>S. Smith's</a><br>to wash. Mamma and I went<br>to <a>Musical</a> at night. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CampMrs\">Mrs Camp</a><br>led to-night. <a>Mrs Marquis</a> was<br>the only married person on the<br>programme (nearly all Misses). <a>Bella<br>Kilner</a> played &quot;<a>Moment Musical</a>&quot;<br>by <a>Scharwenka</a>. The best one<br>was a <a>Rondo for two pianos</a><br>by <a>Chopin</a>. <a>Miss Paterson</a> first<br>piano and Mrs Marquis<br>the second. I think I got<br>through mine alright.",
	"1900-04-13" : "Papa went to Port Colborne<br>then if he had time he was<br>going to <a>Ridgeway</a>. <a>Miss<br>Freeman</a> came to iron in morning<br>went to church. <a>Lizzie</a> saw me<br>coming and met me. <a>Mr<br>Perry</a> spoke on the first<br>three sayings out of seven<br>words on the cross. He intends<br>speaking on other four to-night.<br>Papa came home. He brought<br>a picture of <a>Hibbard's store</a><br>in Ridgeway.",
	"1900-04-14" : "Took my music lesson. Have<br>the <a>19<sup style=&quot;font-size:x-small;\">th</sup> Etude</a> and <a>C# minor<br>valse</a> of <a>Chopin</a>. <a>Mr Zimmerman</a><br>brough our syrup, then<br>after he came for dinner.<br>We had an old man cleaning<br>the yard. Mamma and<br>I went uptown. She<br>bought goods for me a<br>suit and a shirt for<br>herself. Intend having<br>an Eton jacket. My suit is<br>brown. Got <a>&quot;What is Good<br>Music&quot;</a> out of <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a>. The<br>Musician came to-day.<br>Went to <a>Mrs Sullivan's</a>.",
	"1900-04-15" : "Went to church in morning.<br>They had a few flowers around<br>the pulpit. The choir sang<br>Awake Thou that Sleepest &quot;by Maker&quot;<br>and <a>Mr. Kimberley</a> sang. Sermon<br>Rom 6. 4.5 Staid [sic] to Communion in<br>morning. The Sunday School had<br>a service in church. Papa &amp; mamma<br>were for a walk. We all went<br>at night. Sermon Mark 16. 4.5. The<br>anthumn [sic] was an excerpt from<br><a>Dudley Burk's</a> Cantata. Christ the<br>Victor. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMattie\">Mattie Coy</a> sang The Lord<br>is Risen&quot; from <a>Arthur Sullivan's</a> <a>&quot;Light of the World&quot;</a>.",
	"1900-04-16" : "The old man finished<br>cleaning the yard to-day.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#BurrowsMrs\">Mrs Burrows</a> was<br>married to <a>Mr Powell</a>.<br>She was married in <a href=\"/s/ital-iasc-2q90/page/locations#StBarnabasChurch\">St.<br>Barnabas</a>. <a>Mrs Pay</a> was<br>over in the afternoon.<br>She was in Toronto last<br>week. She brought us<br>some dried corn. The<br>annual vestry meeting of<br>our church was held<br>to-night, Papa was going<br>with <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr Coy</a> but he<br>wouldn't go. I took a &quot;Chase&quot;<br>and did not feel well.",
	"1900-04-17" : "Looks like rain and very<br>gloomy. I went calling<br>Took <a>Beatrice</a> the musical<br>programme. <a>Percy</a> sent for<br>a skeleton calendar, and<br>he got it. Went to see<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CrawfordMiss\">Miss Crawford</a>. They were<br>going out for tea so I did<br>not stay long Mamma<br>went collecting. When I got<br>home <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> was there.<br>Mamma came home, changed<br>her skirt, and went uptown.",
	"1900-04-18" : "Very warm like summer.<br>I went up to <a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait's</a> in<br>morning before 9 o'oclock<br>to change a pair of corsets.<br>Papa and <a>Mr Marquis</a><br>went to Thorold.<br>Mamma went to see<br><a>Mr Ross</a>, <a>Mrs Trusty</a> and then<br>to the church. It started to<br>rain hard in afternoon and<br>after it stopped I went to<br><a>Mrs Sullivan's</a>. She will be<br>ready on Monday. Enough to<br>make anyone swear. Saw <a>Helen</a>.<br>Went to papas as it started to<br>pour. Got a wall flower they<br>had rooted in water.",
	"1900-04-19" : "Mamma went collecting this<br>afternoon, and I was to<br>meet her uptown. Took a<br>net doily to <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanWinnie\">Winnie</a>. I went to<br>office and waited for mamma.<br>We went to <a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Anderson's</a> Had two<br>hats sent down. Papa mamma,<br>and I went to the &quot;Little Minister&quot;{1}.<br>at night. It was fine. The<br>minister had a queer head. <a>Babbie</a><br>was pretty. <a>Mr Ira A. Hards</a> took<br>the part of Cavin [sic] Dishart the minister<br>and <a>Adelaide Thurston</a> <a>Lady Babbie</a>.<br>Got some medicine from Cincinnati.",
	"1900-04-20" : "Went uptown in morning.<br>Got some white ribbon for<br>a tie and belt at <a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Miss Anderson's</a><br>Changed <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book, got &quot;In<br>Deacon's Order&quot; by <a>Walter Besant</a><br>Was talking to <a>Lulu Riggins</a>.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanWinnie\">Winnie</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> were over<br>at night, Winnie is going to<br>start Monday night and is<br>married next week. Papa had<br>to go uptown. They had<br>&quot;Faust&quot; in the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a><br>to-night. I would like to<br>have seen it. Picked out<br>a hat. A brown trimmed<br>with ivy, brown chiffon and<br>pink silk.",
	"1900-04-21" : "Took my music lesson. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ReadAngelo\">Mr Read</a><br>was not ready so <a href=\"/s/ital-iasc-2q90/page/communitymembers#CampbellMrs\">Mrs Campbell</a><br>gave me a book to read.<br>Had to go to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhartt's</a> after<br>two pieces Romance Op 42. No 1<br>by <a>Gr&uuml;nfeld</a> and Valse<br>Arabasque by <a>Th. Lack</a>. <a>Lizzie</a><br>came in when I was there.<br>My eyeglasses broke. Had them<br>fixed this afternoon. Mamma and<br>I were uptown. Have our stamp book<br>full got a silver pudding dish.<br>Papa and <a>Dr Kilner</a> were out. Got<br>a pike, mudeates[?] &amp; perch. <a>Frank Overholt</a> of South<br>Africa is home.",
	"1900-04-22" : "Went to church in morning.<br>We had <a>Mr McGinnis</a> and<br><a>Mr Perry</a> preached in Grantham<br>and Virgil. Sermon Cor. 15 35.<br>Very warm and spring like.<br>Mamma, papa and I<br>went down Ontario St for<br>a walk. Took <a>Dexter</a>. Did<br>not go to Sunday School<br>Papa mamma &amp; I went<br>to church at night. Had<br><a>Mr McGinnis</a> again. Sermon<br>Num. 13. 30. <a>Lizzie</a> kept<br>mamma and I on the<br>corner for about half an<br>hour.",
	"1900-04-23" : "Our bulbs came from<br><a href=\"/s/ital-iasc-2q90/page/locations#SteeleBros\">Steele's</a> to-day a clematis<br>agapanthus, &amp; gay queen,<br>chrysanthemums <a>Ross</a> was<br>here cleaning shutters. I<br>went uptown to <a>Mrs<br>Sullivan's</a>. Saw <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie Coy</a>.<br>Got my little picture from<br><a href=\"/s/ital-iasc-2q90/page/locations#MYKeating\">Keatings</a> of Christ. Got a<br>book out of <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> Christ<br>in Art. Mamma &amp; I went<br>over to Carman's to bid <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanWinnie\">Winnie</a><br>goodbye. Papa went to Falls.",
	"1900-04-24" : "<a>Mr Ross</a> was here washing<br>the shutters. Mamma went<br>out calling and collecting<br>in afternoon. Men came to<br>take storm windows off<br>I took my wheel out for first<br>time and rode up Ontario,<br>where I met <a>Helen</a> &amp; <a>Francis<br>Dawson</a>. <a>Lizzie</a> was down<br>after some foxgloves. Mamma<br>and papa went to <a>Dwyer's</a><br>Nobody home so they went<br>to Coy's.",
	"1900-04-25" : "<a>Mrs Trusty</a> is here. <a>Beatrice</a><br>came over in afternoon to<br>have me to go to Port, but I had<br>to go to <a>Mrs Sullivan's</a>. Took<br><a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book back and got &quot;<a>Dr<br>Luttrell's First Patient</a>&quot;. Met <a>Leta</a><br>when I was coming home<br>and went back uptown with<br>her. Mamma was at church<br>Ladies Aid. There are going to have<br>a social a week from Tuesday.<br>Each house has to bring a cup &amp;<br>saucer for admission. <a>Mr Perry</a><br>wants me to play.",
	"1900-04-26" : "<a>Beatrice</a> brought a waist home.<br>Then she was going to the Hall<br>to Practice. I went as far as<br>James with her. Then to <a>Mrs<br>Sullivan's</a> and to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a><br>Got Romanze Op 42 No 1 by A. Gr{u}nfeld<br>The other will be here to-morrow.<br>Mamma &amp; I went to bush. Got a<br>lot of addertongue snakeflower, &amp;<br>trilliums. Took <a>Carman's</a> some<br>The Grange Hall bush is all cut down<br>Mamma &amp; I called for <a>Beatrice</a> &amp; <a>Percy</a>.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#ReadAngelo\">Mr Read</a> was at the Musical and<br>gave a paper on the &quot;National<br>Characteristics in Music. They<br>had a Sextette. <a>Mr Thompson's</a><br>pieces were the best. This is the last<br>meeting.",
	"1900-04-27" : "In the afternoon I went to<br><a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a> after Valse Arabesque<br>by Lack. Then to <a>Mrs<br>Sullivan's</a>. She had jacket<br>done and skirt nearly done.<br>As I was coming home<br>Queen St. I saw <a>Hattie</a> and<br>then we caught <a>Mrs Pay</a><br>as I was talking to Mrs<br>Pay <a>Mr Perry</a> came past<br>and asked me to play at<br>church. <a>Stella Smith</a> is<br>coming over to-morrow. <a>Mrs<br>Jones</a> is very sick.",
	"1900-04-28" : "Took my music lesson.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#ReadAngelo\">Mr Read</a> was talking to<br>me about the Musical.<br>I have to play &quot;<a>Au Matin</a>&quot;<br>at the church. He wants<br>me to come to <a href=\"/s/ital-iasc-2q90/page/locations#DemillCollege\">Demill</a> next<br>Thursday. I went uptown<br>for mamma in afternoon<br>then she and I went for<br>a drive down Lake St.<br>through Port. &amp; to <a>Ross'</a><br><a>Mrs Sullivans</a> &amp; home.<br>Papa went out to Lake St<br>frog ponds. My suit came<br>home to-night. Bought<br>a thimble of <a>Fred Smith</a>.",
	"1900-04-29" : "Went to church in morning<br>Sermon St. John II. 11 verse. It was<br>about the first miracle of Christ<br>the marriage in Cana of Galilee<br><a>Beatrice</a> and I went around by<br><a>Pay's</a> to see if <a>Stella Smyth</a><br>came. She didn't. Went to<br>Sunday School in afternoon.<br>Mamma and papa went<br>for a drive. Mamma got<br>some hepaticas on the bank<br>of eighteen. White, blue, pink<br>ones. Did not go to church.<br>Had fresh mudeats[?] &amp; a pike for tea.",
	"1900-04-30" : "Took a book &amp; bowl home to<br><a>Mrs Pay's</a>. Papa did not come<br>home for dinner as <a>Mr F.<br>Overholdt</a> was there. Mamma<br>and I went to <a>Mrs<br>Sullivan's</a> and I stopped<br>at <a>Riggins</a> to see <a>Lulu</a>. Mamma<br>and Mrs Pay went over to<br>call on <a>Mrs Hull</a>. She was not<br>home, down at<br><a>Collins</a>. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CollinsMrs\">Mrs Collins</a> is not expected to live<br>Mamma bought a Scarlet Pamela<br>and <a>Paul Neyson</a> [sic] rose (pink.) <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs<br>Coy</a> brought over a pink fall<br>phlox and we gave her a<br>white one.",
	"1900-05-01" : "Lizzie came in the morning<br>to get a vine, but mamma had<br>pulled it up. Last<br>night she had a bone taken<br>out of her nose. Mrs Mason, Hilda<br>and Mr Wilfred were over.<br>While she was here <a href=\"/s/ital-iasc-2q90/page/communitymembers#ComfortDr\">Mrs<br>Horace Comfort</a> &amp; Mrs Dr.<br>Sheahan called. Mamma<br>went up to Mrs Sullivan's<br>Mrs Pay got some samples<br>from England to-day, and she<br>called mamma to see them. Papa<br>&amp; mamma were over to Dwyer's at night<br>Got a cortrielli needlework book.<br>Paderewski played in Toronto this afternoon.",
	"1900-05-02" : "Papa and mamma started<br>about 8 o'clok for Mr S. Jones.<br>Trout fishing. Dwyer's gave us<br>a pint jar full of Jersy cream<br>last night. I had to get dinner.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanWinnie\">Winnie Carman</a> was married<br>on Monday in Minneapolis to<br>Rev. M. Simpson. Beatrice and<br>Lulu were over at night.<br>Lulu is going to-morrow night<br>and I have to call for her<br>about 7.20 Mrs C. Quackenbush<br>formerly of Port was killed in Niagara<br>Falls by a Lehigh valley train<br>She was on her bicycle and tried<br>to cross the track. Paderewski<br>plays in Buffalo at Central Church to-night.",
	"1900-05-03" : "I went over to Jones to<br>inquire how Mrs Jones was<br>and took her 3 trout.<br>The men came and took<br>down the stoves. Mamma<br>went uptown bought<br>enough pique for me a dress.<br>Called for Lulu then went to<br>Hendersons and met Daisy<br>Ratcliffe. The programme opened<br>with a piano quartette. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#ReadAngelo\">Mr<br>Read was Chairman and read<br>the same paper as he read at<br>Musical. Had eating afterwards.</a>",
	"1900-05-04" : "<a href=\"/s/ital-iasc-2q90/page/communitymembers/#ReadAngelo\">We started housecleaning<br>We expected Mrs Tish but<br>she disappointed us.<br>Mr Ross and Mr Lewis cleaned<br>the carpets out of mamma's<br>room, mine and Phoebe's.<br>Rode uptown to see </a><br><a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren's</a> &quot;<u>cheap</u>&quot; ties and they<br>were cheap. Got one at<br><a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait's</a> a white satin bow<br>Papa got a new calendar<br>from Bank of Commerce<br>with map of South Africa<br>on it. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BorrowmanMrs\">Mrs Adam Borrowman</a><br>died last night.",
	"1900-05-05" : "Took my music lesson.<br>Valse Arabesque by Lack<br><a href=\"/s/ital-iasc-2q90/page/communitymemberslocations#ReadAngelo\">Mr Read</a> said that he had heard<br>good &amp; bad reports about me.<br>A pupil of &quot;another teacher&quot;<br>said there was no expression<br>whatever in my playing oh! my.<br>And another said I was one of<br>the best if not the best junior<br>in the Musical. Mr Read believes<br>the latter as they are far the<br>best judge of music I went<br>uptown to <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> Got &quot;The Dean's<br>Daughter&quot; by Gore. Stopped in Kellogg's<br>to see Lizzie about making a skirt.",
	"1900-05-06" : "Went to church. They have<br>the Easter Reports printed<br>to-day. Sermon St. John 4. 3-3.<br>Papa and mamma drove<br>to the cemetery to pick<br>out a lot from the new<br>part that has been opened<br>up. Lizzie was down in afternoon.<br>She is going to Toronto to-morrow.<br>Did not go to Sunday School<br>Mamma &amp; I went to church<br>at night. Papa did not go as he<br>felt sick. Sermon I Tim[?] 4.-8. Mr<br>&amp; Mrs Pay come home<br>with us but papa had<br>gone to bed.",
	"1900-05-07" : "Started to clean dinning room<br>and sitting room Mr. Ross<br>&amp; Mr Lewis cleaned the<br>carpets. Tommy Tucker<br>came over after 1.30 and<br>staid [sic] till after four. Did<br>not have the carpets<br>put down to-day. They<br>had a service of<br>praise in <a href=\"/s/ital-iasc-2q90/page/locations#KnoxChurch\">Knox Church</a><br>to-night. Gaul's sacred<br>Cantata &quot;The Holy City&quot; is to<br>be in our church next<br>Thursday.",
	"1900-05-08" : "The gentlemen came and<br>put down the carpets<br>Mamma went up to<br>Mrs Sullivans. I fixed<br>my pulley belt Mamma<br>papa &amp; I went to church<br>at night. It rained hard<br>both going and coming<br>home. I played &quot;Au Matin&quot;<br>and Miss L Phillips played<br>and Miss Alice &quot;sang. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AdieJessie\">Miss Jessie<br>Adie</a> and Marion McGeachie<br>recited. They had refreshments<br>Papa got an electric shock<br>from street car.",
	"1900-05-09" : "The little wood stove smoked<br>and blacked the spare bedroom<br>ceiling. Mrs Trusty is here.<br>Washed &amp; ironed. Gave her<br>my black &amp; green wool jacket.<br>Went over to <a href=\"/s/ital-iasc-2q90/page/locations#AMeyerCoLtd\">Meyer's</a> after<br>gingersnaps. In the paper<br>to-night it gave the<br>programme in the<br>church. Very cold.",
	"1900-05-10" : "Mamma cleaned the spare room.<br>I went over to Dwyer's in<br>afternoon to see Beatrice.<br>She is going to Galt &amp;<br>Winona to-morrow. And<br>she was just going for a<br>drive when I came so I<br>did not stay. When I came<br>home <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a> came over, which is<br>a wonder as she has not<br>been here since Fall.<br>Mamma went to Mrs.<br>Sullivan's and she was not<br>ready. Papa brought a new<br>magazine called Ainslee's Magazine<br>Do not care much for it.",
	"1900-05-11" : "Had our first asparagus<br>to-day. It came from <a href=\"/s/ital-iasc-2q90/page/locations#Jeeves\">Jeeves</a>,<br>Mamma cleared the little<br>front room. I planted<br>my nasturtium seeds<br>this afternoon. So did<br>mamma &amp; Phoebe plant their<br>seeds. Papa &amp; Mamma<br>intended going to <a href=\"/s/ital-iasc-2q90/page/locations#RidleyCollege\">Ridley<br>College</a>. Assault-at-Arms in<br>Masonic Hall, but papa had<br>to go to Lodge.",
	"1900-05-12" : "I took my lesson Romance by<br>Gr<em>&uuml;</em>nfeld. Have triads for next<br>day. Lizzie came down to<br>try&nbsp;on Phoebe's skirt. She<br>has an awful cold,<br>mamma and I went to<br>the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a> to the<br>Biograph (moving pictures)<br>and Mr. C. Leroy Kenny explained<br>them. I liked the pictures<br>taken from the trains C.[Canadian] P.[Pacific] R.[Railway]<br>best. The scenery was<br>beautiful. Shamrock Columbia<br>Yacht Race was good. A lot of<br>the views were of British soldiers<br>Lizzie brought the skirt home.",
	"1900-05-13" : "Went to church in morning.<br>Sermon Luke IV. 4 verse 3<sup style=&quot;font-size:x-small;\">rd</sup> miracle.<br>Went to Sunday School. Lizzie<br>called for me. Mr Perry taught<br>us as Mrs Haun was away<br>Lesson Jesus at Pharisee's House<br>Went for a walk with<br>Lizzie Papa and mamma<br>went for a drive Got quite<br>a lot of flowers. Did not<br>go to church at night.<br>Read &quot;The Dean's Daughter.&quot;",
	"1900-05-14" : "Cleaned the parlor. I dusted<br>and whipped all the<br>chairs. Mamma went to Mrs<br>Sullivan's in afternoon. Very<br>warm. Papa is taking a<br>magazine called Collier's<br>Weekly. The May Musicians<br>came to-day. Has a Lecture<br>of Paderewski in it. Papa<br>went down to the canal<br>shooting before tea then<br>after tea he went to see<br>a man catch some fish.",
	"1900-05-15" : "Mrs. Tish is here cleaning.<br>Of all the stuff I ever<br>saw us in papas room.<br>Sorted it. The men have<br>torn up the boulevard<br>to-day and are laying a<br>granolithic sidewalk<br>very, very warm worse<br>than yesterday. Had<br>thunderstorms. In <a href=\"/s/ital-iasc-2q90/page/locations#HaynesAvenuePresbyterianChurch\">Hayne's Avenue<br>Presbyterian church</a> they<br>had a service of song &quot;The<br>Battle of Life.&quot;",
	"1900-05-16" : "About 3 o' clock this morning<br>mamma came in my room and<br>said &quot;If you want to see a big<br>fire come &amp; see it. And it was<br>the <a href=\"/s/ital-iasc-2q90/page/locations#WellandValeWorks\">Welland Vale bicycle<br>&amp; Axe factory</a>. Papa went down<br>and mamma &amp; I waited until<br>about 4 o'clock then went to bed.<br>Finished the sidewalk to-day. I went uptown in afternoon<br>called for Helen and Belle McClive,<br>she &amp;<br>I walked to <a href=\"/s/ital-iasc-2q90/page/locations#BlackBridge\">Black Bridge</a><br>a <a href=\"/s/ital-iasc-2q90/page/communitymembers#ClineMiss\">Miss Cline</a> from <a href=\"/s/ital-iasc-2q90/page/locations#BrownNurseries\">Brown's<br>Nurseries</a> staid [sic] here all<br>night as she is having some<br>work done and does not<br>know anyone here. Lizzie was down.",
	"1900-05-17" : "Dr. Hunt from Hamilton came<br>yesterday to do <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChatfieldMrs\">Miss Cline's</a><br>bridgework. She went up to<br>the office about 10. Mabel<br>brought a little porcelain<br>clock to hang on the wall.<br>Phoebe and I went to <a href=\"/s/ital-iasc-2q90/page/locations#JMcLarenGarden\">McLaren's<br>garden</a> for carnations. Got pansies.<br>Stopped in Mrs Pay's. Came<br>from there with Ella. Mamma<br>went to Mrs. Sullivans. Mamma &amp;<br>I went to church to hear Gaul's<br>&quot;Holy City.&quot; Miss O'Connor of Buffalo<br>was soprano, <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMattie\">Mattie Coy</a> contralto, Mr Kimberley<br>tenor, &amp; G. Waite bass.",
	"1900-05-18" : "Put our dahlias out yesterday.<br>Mamma finished cleaning<br>house to-day. Both of us<br>went uptown. Bought<br>enough blue &amp; white<br>striped goods for a sailor<br>blouse. Got a little ribbon<br>with a flag &amp; &quot;Victory&quot; printed<br>on it. Pinned it on. Mafeking<br>is relieved, and the bells<br>were ringing, whistles<br>blowing, and giantt firecrackers<br>going off. Got 9 yds. [yards] of<br>insertion for my white<br>pique dress. Papa went<br>uptown to celebrate. Mamma<br>got pulley belt rings.",
	"1900-05-19" : "I took my lesson. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ReadAngelo\">Mr. Read</a> had<br>gone uptown after a paper<br>to see about Mafeking. 22<sup style=&quot;font-size:x-small;\">nd</sup><br>Etude. Went up to<br><a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Miss Anderson's</a> and paid for<br>the insertion. Went for<br>a ride on the new cinder<br>path as far as Dwyer's farm.<br>Mamma &amp; I went to Decew in<br>afternoon. Got ferns &amp; flowers.<br>Saw two little lizards and got 9<br>snails. Papa went down to<br>see the ruins from the fire.",
	"1900-05-20" : "Went to church in morning<br>Sermom Mark I. 23 verse. When<br>I was coming home Nellie<br>Loyd told me to come in<br>and wait and see the<br>soldiers as they marched to<br><a href=\"/s/ital-iasc-2q90/page/locations#FirstPresbyterianChurch\">First Prebyterian Church</a> this<br>morning. Went over in<br><a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the Park</a>. Went to Sunday School.<br>Had Mrs. Keyes. The lesson<br>was the &quot;Parable of the Sower&quot;.<br>Came home with <a href=\"/s/ital-iasc-2q90/page/communitymembers#RollsWinnie\">Winnie<br>Rolls</a>. Was introduced to Miss Riddell.<br>Papa &amp; Mamma<br>went for a drive went to church at night<br>sermon Mark VI 2 &amp; 3 verse Mr. Coy<br>came over after church.",
	"1900-05-21" : "Went over to Carman's to see<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> about some flags she<br>told me about. Mamma<br>and I drove to woods after<br>ferns. Got quite a lot of<br>them. Ella came over<br>at night to tell me<br>about the flags. Gave her<br>20 cents for 3. Firebugs<br>tried to burn <a href=\"/s/ital-iasc-2q90/page/locations#WilsonLumberYard\">Wilson's Lumber<br>yard</a> Saturday night, and<br>last night they burnt their<br>barn with some buggies and<br>one horse.",
	"1900-05-22" : "Practiced this morning as<br>we are going out this afternoon<br>Rode up to <a href=\"/s/ital-iasc-2q90/page/locations#InksaterBros\">Inksater's</a> and<br>down to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> before we<br>started out. Mamma &amp; I<br>went to Decew Falls fishing.<br>Caught 2 large suckers.<br>Mamma got enough dock[?]<br>for greens. Got enough<br>fish for supper. Taylor<br>took the old boards from<br>our old sidewalk.",
	"1900-05-23" : "Empire Day. Mrs Trusty is<br>here, I have 14 nasturtiums<br>up. Mamma &amp; I drove<br>down to <a href=\"/s/ital-iasc-2q90/page/locations#Trumans\">Trueman's</a> for some<br>geraniums. Got 1 salmon,<br>1 red, 1 double white, &amp; 1 double<br>pink one. Went up to the<br>office. Went to <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a>, and<br>got &quot;Wyndham's Daughter&quot; by<br>Annie S. Swan. Papa and I<br>went to <a href=\"/s/ital-iasc-2q90/page/locations#Gilmores\">Gilmore's</a> and got<br>our. stars on our wheels. Went<br>for a little ride. Maggie Smith to<br>see Pheobe. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> was over Put out a flag.",
	"1900-05-24" : "Queens Birthday. Papa and I<br>went up to grandpa's. Leta<br>went up in morning <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BeamFrank\">Frank<br>Beam</a>, Miss Kilman, Miss Green<br>of Buffalo &amp; Mr Hathaway drove down<br>from Ridgeway. They got the<br>boat. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt Lillie</a> has two little<br>black cats, and they have 21 little<br>pigs and a colt. Came home at<br>5.10. The cars were crowded<br>both ways. When we stopped<br>at <a href=\"/s/ital-iasc-2q90/page/locations#CliftonHouse\">Clifton</a> coming home we saw<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#ReadAngelo\">Mr. Read</a> and he was talking<br>with us for 15 min. Leta &amp; I sat<br>together from Clifton home. She had<br>teeth filled. Papa got some Roman<br>candles, firecrackers &amp; pink light.",
	"1900-05-25" : "We expected Mrs. Jo. Overholt and<br>Frank in to-day, but they<br>couldn't get a horse. Mamma<br>was out there yesterday.<br>Planted eight little pots with<br>two nasturtiums in each.<br>Am going to start them for<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt Lillie</a>. Mamma went<br>collecting, and uptown. She got<br>a new waist. Papa wanted to<br>see my teeth so I went up, but<br>he had left the office. Mamma &amp;<br>papa were over to Pay's at night. The<br>Ladies Home Journal came to-day.",
	"1900-05-26" : "I took my music lesson. 23<sup style=&quot;font-size:x-small;\">rd</sup><br>Etude. Mrs. J. Overholt came in<br>about 10.30 to see me as it<br>was her only chance. I wanted<br>to go out on my bicycle<br>but they would not let me.<br>Went up to Miss Sutherland's<br>for a bonnet for Mrs. N. Overholt<br>as mamma is going to take it out.<br>Papa and mamma went out to<br>Overholt's. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> was over and<br>we got 10 two cent stamps instead of<br>our flags we sent to Eaton's for<br>as the flags are all mounted.<br>Went<br>over to Mr. Laren's garden and over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> with Ella. She gave me a<br>lovely bunch of lilies of the valley.<br>Mamma brought home a bag of russet apples.",
	"1900-05-27" : "Papa and I started at 10.30 for<br><a href=\"/s/ital-iasc-2q90/page/locations#QueenstonHeights\">Queenston</a>. We got there in<br>time for dinner Had a blue pickerel. Had it at<br>the <a href=\"/s/ital-iasc-2q90/page/locations#MonumentHouse\">monument House</a>. Then<br>papa and I went down to the<br>railway, but the ticket agent<br>was not there and we went after<br>him. Went as far as Chippawa<br>then when we came back we<br>got off at Niagara Falls and went over<br>to American Side through the park.<br>Then when we came back we stopped<br>at <a href=\"/s/ital-iasc-2q90/page/locations#BrockMonument\">Brock's monument</a> and I saw the<br>forts. Had a fish supper. And started home<br>10 min after seven and got home at nine.<br>Met Mr. F. Taylor &amp; wife and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllenMr\">Mr. Allen</a> &amp; his wife.",
	"1900-05-28" : "Mamma &amp; I drove up to<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CarrollFamily\">Carroll's</a>. Took Mrs. Carroll some<br>lilacs. She is very<br>miserable <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CarrollLillie\">Lillie</a> has gone to<br>New York and Mrs. Kilmer<br>is all alone. We drove up<br>to office. I took my<br>Chopin Mazurkas &amp; Valses to<br>have them bound together.<br>Mamma &amp; I were quite<br>wet when we got home as<br>it rained hard for a litte<br>while.",
	"1900-05-29" : "Mamma did some collecting<br>then we went for a drive<br>Went to Mrs. Sullivan's to<br>see when she wanted me<br>to try on my white pique<br>Drove down Geneva and &amp; out<br>Russell Ave. Mamma had a<br>caller when we were<br>out Mrs. Robertson. Helen<br>was over after me but I<br>was not here <a href=\"/s/ital-iasc-2q90/page/communitymembers#CoyMr\">Mr.</a> &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers#CoyMrs\">Mrs.<br>Coy</a> were over at night.",
	"1900-05-30" : "Was over to <a href=\"/s/ital-iasc-2q90/page/locations#JMcLarenGarden\">McLaren's garden</a><br>this morning after asparagus<br>&amp; radishes. Mamma had<br>to go to the monthly meeting<br>of Ladies Aid. They got over<br>$29.00 this month. Grace Kennedy<br>brought their fifty cents over<br>this morning. Rode up to<br><a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> got &quot;The Castle Inn&quot; by<br>Stanley J. Weyman.&quot; Mamma<br>got some brown goods for a<br>morning skirt. Frank<br>Overholt was here for tea. Is<br>to be here for a few days.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> brought us some tuberoses<br>&amp; a spotted calla lily.",
	"1900-05-31" : "At breakfast we heard whistles<br>blowing. Pretoria taken. Had to<br>go over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> and Helen came<br>in and wanted me to go uptown<br>and see what going on. Came<br>home then went for Helen. Rode<br>up to <a href=\"/s/ital-iasc-2q90/page/locations#AmericanBazaarStore\">Bazaar</a> and bought 3<br>flags. 30&cent;. Helen &amp; I called for Eloise<br>Hamilton. Was not home saw her in the<br><a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">park</a>. Rode down to <a href=\"/s/ital-iasc-2q90/page/locations#BlackBridge\">Blk. [Black] Bridge</a> &amp; back<br>to Goodman's Had a great time in<br>the Park in afternoon. Mamma &amp; I<br>went up, but missed it. Stopped in Mrs Mason's,<br>Frank &amp; papa shot 56 frogs.",
	"1900-06-01" : "Last night about 10 o' clock we had<br>an old drunken tramp after<br>something to eat. Frank went<br>home this morning. They had<br>a report that Kruger was<br>captured, but not time Mr.<br>Rollinson is dead. The Bicycle<br>Works are going to Brantford.<br>Mr Mason went Wednesday<br>night. Got a letter from Miss<br>Duval[?]&nbsp; wanting me to take her<br>hour to-morrow morning and<br>she will take mine. We have<br>had a fine rain since this<br>morning. Papa brought the<br>&quot;Wide World&quot; magazine for June to-day<br>was over in <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> in morning.",
	"1900-06-02" : "Took my lesson at 9 o'clock and<br>Miss Duval asked me whether<br>I would mind if she came at<br>8 next Saturday. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CollinsMrs\">Mrs Collins</a> took after<br>me. Took 24{th} Etude &amp; Gb valse of<br>Chopin's. Went up to office as<br>my waltzes are being bound<br>and I went up to <a href=\"/s/ital-iasc-2q90/page/locations#Osborns\">Osborn's</a>. Will be<br>done on Monday afternoon. Was<br>uptown. Met Leta and she came<br>with me in <a href=\"/s/ital-iasc-2q90/page/locations#WalkerAndAbbs\">Walker &amp; Abbs</a>, <a href=\"/s/ital-iasc-2q90/page/locations#WilsonsGrocery\">Wilson's</a><br>&amp; <a href=\"/s/ital-iasc-2q90/page/locations#JMcLarenGarden\">McLaren's garden</a>. She bought some<br>candy. Decoration Day. Veteran's<br>went down to cemetery &amp; decorated graves.",
	"1900-06-03" : "Went to church in morning.<br>Sermon Acts II. 4 verse,<br>Communion Sunday. Papa<br>and Mr. Marquis were out<br>for a walk. Papa found a<br>little mudturtle and gave it<br>to him for the baby. Papa went<br>to Mr. Rollinson's funeral.<br>Went to Sunday School, Mrs<br>Keyes taught us. To-day is<br>Whitsunday{1}. We all went to<br>church at night. St. John<br>XII. 21 verse. Mr &amp; Mrs Pay<br>and Hattie came home<br>with us.",
	"1900-06-04" : "Mr Halliday was here cutting<br>grass and cabbage rosebuds<br>too. I think he needs a pair<br>of magnifying glasses. Mamma<br>&amp; I drove down to Trusty's<br>with some things. Mrs<br>Trusty left here. Saw Anne, Susie<br>and the children. Then we<br>drove out to lake and<br>got some sand. Got dogwood<br>in Martindales. Papa brought<br>my Chopin book home. It suits<br>but they did not put leather<br>corners on it. Dr. Hunt is here for<br>Mr. McLaren's case.",
	"1900-06-05" : "Nice and warm to-day.<br>Practiced 3 hours. Pretoria is<br>taken at last and the<br>Mayor ordered the city buildings<br>and <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">post office</a> illuminated.<br>Mamma went uptown to<br>order curtains for hall door<br>and kitchen windows.<br>Then I rode up to Mrs.<br>Sullivan's to try my white<br>dress tried on. She only<br>had my skirt cut out.<br>Papa had to go uptown at<br>night to see Dr. Hunt. Dexter broke<br>his collar when Emma Jeeves came<br>in. Tommy asked us if we wanted<br>a kitten. Then he went to see Ella.",
	"1900-06-06" : "The curtains for the hall &amp; kitchen<br>windows came this morning.<br>The hall ones have lace on.<br>I finished the &quot;Castle Inn.&quot;<br>A very good story of its kind<br>but they can hardly say<br>a word without swearing.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt Lillie</a> and Uncle Horace<br>came to-night after tea.<br>Papa &amp; Uncle Horace took Rex<br>up to <a href=\"/s/ital-iasc-2q90/page/locations#MurphysLivery\">Murphy's livery</a><br>stable",
	"1900-06-07" : "Uncle Horace and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt Lillie</a><br>went uptown shopping<br>and did not get back until<br>dinner. Then Aunt Lillie &amp;<br>mamma drove down to<br><a href=\"/s/ital-iasc-2q90/page/locations#Waites\">Waite's</a> in the afternoon<br>after tea Mrs Haun came<br>down. Played some for her<br>then we all went up<br>to hear the first band<br>concert of the season<br>They played two new hymms<br>from England.",
	"1900-06-08" : "<a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt Lillie</a> and I went uptown<br>this morning. We went<br>to the bazzaar and she<br>bought two plays and I<br>brought 1 doz. little ones for<br>10{c}. We got home after twelve<br>and the horse came at 2 o'clock<br>and they started. Saw Frank<br>Ovenholt at the office. Mamma &amp; I<br>drove up to Mrs. Sullivan's. She<br>was ready. Got a piece of red<br>satin ribbon &amp; black pulley<br>belt rings for a<br>red belt for my red waist. Old Mrs. Wand[?] is dead 93 years old.",
	"1900-06-09" : "Took my lesson at 9 o'clock.<br>Saw Helen when I came<br>home. Papa and mamma<br>went frog - hunting down<br>Lake and Niagara Sts. I<br>was over to Dwyer's Beatrice<br>is home. They have four<br>cows[?]. Mrs. Pay came<br>while I was there and<br>we went uptown together.<br>Tried <a href=\"/s/ital-iasc-2q90/page/locations#Shelleys\">Shelley's</a>, <a href=\"/s/ital-iasc-2q90/page/locations#Foleys\">Foley's</a> and<br><a href=\"/s/ital-iasc-2q90/page/locations#JEHetherington\">Hetherington's</a> after tart shells<br>but could not get them. Mrs<br>Dr. Leitch is dead. Papa got<br>35 frogs.",
	"1900-06-10" : "Was at church in the morning.<br>Sermon Matt XXVII. 19 verse.<br>Trinity Sunday. Went to<br>Sunday School. Mrs. Haun<br>was there. We had one lesson<br>on our leaflets &quot;The Name of God&quot;<br>Isa 6.1-8 and one in our books<br>Death of John the Baptist Mark 6.14.29<br>and Mrs Haun took<br>the latter for<br>the lesson. Came home with Lizzie.<br>Papa &amp; mamma were out for a<br>drive. I went to church alone<br>Came home with Beatrice and<br>Hattie.",
	"1900-06-11" : "Papa got a prescription for<br>the hair filled to-day. Mrs.<br>Overholt gave it to us.<br>Mamma &amp; I went for a<br>drive down Martindale<br>through Port and home<br>There was all old woman<br>sick by <a href=\"/s/ital-iasc-2q90/page/locations#WoodruffsField\">Woodruff's field</a>.<br>Mr P. J. Price is raising<br>a subscription for an<br>ambulance for St. Catharines,<br>Thorold, Merritton &amp; Port Dalhousie.<br>Truned cooler to-night.",
	"1900-06-12" : "Went up to Mrs. Sullivan's<br>this morning but she<br>was not ready for me.<br>Mamma &amp; I went uptown<br>after dinner and I bought<br>a handkerchief tie at <a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait's</a> and<br>mamma bought one at <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">Mc<br>Laren's</a>. Got No 3 John St&quot; out<br>of <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> - Got some green<br>currants at McLaren's for a<br>pie. Mrs. Mason, Hilda, Wildrid<br>and Mrs. Mason's sister were<br>here in aftrernoon. Had<br>strawberries for first time.",
	"1900-06-13" : "Was up in Mrs. Sullivan's<br>again. She was ready.<br>Went to see if Ella would<br>go for a drive. Mamma &amp; I<br>drove uptown after two<br>painted plates papa<br>bought. Met Mrs. Sims - <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> &amp;<br>mamma drove out to lake.<br>Got real cold then a warm<br>wind sprang up in 3 min.<br>Lizzie came down to see<br>Phoebe about her waist<br>Maud Rottineier{?] was with her.<br>Took Ella a bunch of<br>syringas [sic]. &quot;Musicians&quot; for June came.<br>Mrs. &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BorrowmanLouise\">Miss Borrowman</a> called.",
	"1900-06-14" : "Ella came over in morning<br>and mamma showed her<br>how to cut a waist by new<br>pattern. Our white roses<br>are out. At noon there<br>was [sic] two circles around<br>the sun and inside of<br>the circles was a dark<br>space. Maggie brought<br>Pheobe's waist home after<br>so long a time. Frank Overholt<br>was here for tea. Had to go<br>over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> after butter. Band<br>Concert.",
	"1900-06-15" : "Frank did not stay but rode<br>home last night. Went<br>uptown to <a href=\"/s/ital-iasc-2q90/page/locations#InksaterBros\">Inksater's</a> and<br><a href=\"/s/ital-iasc-2q90/page/locations#WilsonsGrocery\">Wilson's</a>. Pretty warm<br>riding. Mamma &amp; papa<br>went out for a drive<br>after tea &amp; I had to<br>wash the dishes.<br>My white pique dress<br>and blue waist came<br>home to-night. She did<br>not do as mamma wanted<br>her to, and my blue waist<br>has the white front on the outside<br>instead of inside of waist.",
	"1900-06-16" : "Took my music lesson. Have<br>quite a bit for next week.<br>Took 25{th} Mazurka, Etude.<br>Miss Duval goes to Toronto next week<br>Mr. Read said he wanted me in<br>the winter to come over to Buffalo<br>to play in a recital. Saw Helen &amp;<br>Beatrice. Was over to Carman's<br>Mamma &amp; I went over to the<br>&quot;At Home&quot; on <a href=\"/s/ital-iasc-2q90/page/locations#RidleyCollege\">Ridley Cricket Field</a>.<br>Met <a href=\"/s/ital-iasc-2q90/page/communitymembers/#ArcherMrs\">Mrs. Archer</a>. Christened my<br>new dress. Papa went shooting<br>frogs. He got 44.",
	"1900-06-17" : "Went to church in morning<br>Sermon Matt. VIII. 2 &amp; 3 verses.<br>Lizzie came home with me<br>I gave her some roses<br>and walked as far as Pay's<br>with her. Mrs Pay called<br>me in and gave me a<br>dish of strawberries<br>and cream. Just got home<br>in time for dinner and<br>had to hurry off to Sunday<br>School. Lesson was &quot;The Feeding<br>of Five Thousand&quot; and Lizzie &amp; I<br>went for a walk to <a href=\"/s/ital-iasc-2q90/page/locations#BlackBridge\">Black<br>Bridge</a> after Sunday School. She wants<br>me to take a class for her in August<br>Papa &amp; mamma went for a drive.",
	"1900-06-18" : "Mamma &amp; I drove to Decew Falls<br>in afternoon. Stopped to get<br>some wild strawberries<br>that grow on a small hill<br>in a field as you turn to<br>go to Decew. They were dried<br>up. Got a few. Then we got<br>some more beyond the<br>Falls. Got an invitation to<br><a href=\"/s/ital-iasc-2q90/page/locations#DemillCollege\">Demill</a> Commencement<br>exercises next week. Lizzie<br>was down to get Dr. Macfarlane's<br>address for Maud Rottineier[?].",
	"1900-06-19" : "Mamma &amp; I drove to Homer<br>to get Nellie shod{1} at Mr<br>Wilson's. We went in the<br>house. I played some for Mrs.<br>Wilson. She showed us some<br>nice photographs of different<br>places Decew, 12 Mile Creek &amp; C.<br>When we were coming home<br>we were out to see her roses<br>she gave me a beautiful pink<br>one like a tearose, &amp; a white<br>moss &amp; mamma a red &amp; white moss.<br>Mr. McGinnis is going to Japan<br>and Mr. Maloney is coming in<br>his place Nice Irish names.<br>Mamma had three callers when<br>we were away.<br><br>1. past participle of to shoe.",
	"1900-06-20" : "Wash day. Mrs. Trusty has<br>been sick and Dr. Jory tells<br>her it is paralysis coming<br>on. In the afternoon I<br>practiced &amp; worked at my<br>Harmony until I did not<br>know whether I was on my<br>head or heels. Mamma went<br>uptown, and to the church. She went to pay Mrs. Sullivan for my dress.",
	"1900-06-21" : "Mamma went to Toronto this [sic]<br>to see Carrie and I have to<br>be housekeeper. I got<br>the dinner of cold meat,<br>milk potatoes, tomatoes &amp;<br>strawberries. Finished<br>John St. I do not care for<br>it. In the afternoon I took<br>it up to the office but<br>papa wanted to read it so<br>I brought it home. I sent<br>for 10 of the Brown pictures to<br>illustrate the lesson if I<br>take those kids Lizzie<br>wanted me to. Mamma came<br>home about 9. Got a hammock<br>&amp; White House Cook Book.",
	"1900-06-22" : "Carrie sent me a pampas<br>grass plume. Last night<br>was children's night in<br>the <a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">park</a> and the band<br>played twosteps for them.<br>They could make all the noise<br>they liked if they kept<br>quiet other nights. We<br>canned strawberries to-day<br>Got 15 boxes from <a href=\"/s/ital-iasc-2q90/page/locations#Jeeves\">Jeeves</a>.",
	"1900-06-23" : "Took my music lesson. Mr.<br>Read played me a suite of<br>Japanese songs of his. I have<br>to take my lesson at 8 o'clock<br>next Saturday. It is my last<br>lesson. He kept me until 10.30.<br>Walked uptown after stamps<br>and a ball for Pansy. Then<br>mamma &amp; I went for a drive.<br>To see about cherries Met <a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingSidney\">Sid<br>Bunting</a> on Niagara St. Bridge<br>Beatrice came over for me to<br>go for a ride down cinderpath.<br>Papa went frog shooting. Got<br>4 frogs. <a href=\"/s/ital-iasc-2q90/page/communitymembers#RiordonCharles\">Mr. C. Riordon</a> &amp; Miss<br>Amy Paterson were married in<br>our church at 2:30pm.",
	"1900-06-24" : "Went to church in morning<br>Sermon Matt. III 8 Verse. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleStamage\">Rev.<br>Stamage Boyle</a> read the<br>lesson. Very warm. Went to<br>Sunday School. Flower Sunday.<br>Mrs. Keyes helped take the Infant<br>class upstairs &amp; Mr. Perry asked<br>me to help her. Got a lot of<br>flowers. Mr McGinnis and<br>Mr. Boyle spoke. Mr. Boyle preached<br>in the evening. Did not go.<br>Went to Pay's and ate cherries<br>Mr. &amp; Mrs. Macgregor came after<br>we were there.",
	"1900-06-25" : "Mamma went out collecting<br>in afternoon. Very warm.<br>In the evening papa<br>caught the pigeons and Mr.<br>Coy and he went to race<br>course &amp; shot them. Dr.<br>Kilmer &amp; Mr. Lovelace did not<br>turn up. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyDell\">Della</a> mamma &amp; I<br>went for a drive. They<br>had an undergraduate<br>Music &amp; Elecution recital<br>to-night at <a href=\"/s/ital-iasc-2q90/page/locations#DemillCollege\">Demill</a>. Did not go.<br>Went home with Dell &amp;<br>over to Dwyer's, <a href=\"/s/ital-iasc-2q90/page/communitymembers/#ReadBessie\">Bessie Read</a><br>was there. Got 12 pictures<br>from <a href=\"/s/ital-iasc-2q90/page/locations#BrownAndCo\">Brown &amp; Co.</a> Mr Painter<br>gave papa four snapping turtle eggs on Saturday",
	"1900-06-26" : "They had a confirmation in&nbsp;<br>Port last night. They had<br>the closing excersises at <a href=\"/s/ital-iasc-2q90/page/locations#RidleyCollege\">Ridley</a><br>this afternoon. It was so&nbsp;<br>warm that mamma<br>would not go. Papa brought&nbsp;<br>Wide World for July. Mamma &amp; I&nbsp;<br>went to <a href=\"/s/ital-iasc-2q90/page/locations#DemillCollege\">Demill</a> commencement<br>Excercises. The graduates were<br><a href=\"href=/s/ital-iasc-2q90/page/communitymembers#PhillipsLaura\">Miss Laura Phillips</a> in Piano<br>and <a>Miss Annie McCleary in Voice</a><br>Very nice programme. Mr. Read was<br>there. Mamma &amp; I sneaked out of<br>the drawing room &amp; came home.",
	"1900-06-27" : "Very warm yet. Had my&nbsp;<br>hair washed and had to<br>sit outdoors all morning&nbsp;<br>did not get any practice<br>in in the morning. Mamma&nbsp;<br>went to church and&nbsp;<br>uptown. Only got about<br>$11. this month as half of the&nbsp;<br>lists are not in. <a href=\"/s/ital-iasc-2q90/page/locations#WilsonLumberMills\">Wilsons's<br>lumber yard</a> was set on<br>fire about 10 o'clock this&nbsp;<br>morning. They had a&nbsp;<br>supper at the <a>lodge</a> to-night.",
	"1900-06-28" : "Very Warm to-day. 100&deg;<br>yesterday. Mamma washed&nbsp;<br>her hair. Practiced 1 1/2 hours<br>in morning &amp; 1 1/2 hours in afternoon.<br><a>Ms. Ernest Groff </a> &amp; <a> Miss<br>Mabel Skinner </a> were married<br>in our church at 8.30 am<br>Miss Lane &amp; Miss Phillips<br>were in Buffalo to play at<br>a recital of Mr. Read's&nbsp;<br>Papa &amp; mamma were<br>for a drive. Mamma got&nbsp;<br>&quot;The Silver Cross&quot; by S. R. Keightley<br>Read some of it to-day.",
	"1900-06-29" : "<a>Beatrice</a> came after me this&nbsp;<br>morning to go with her to&nbsp;<br><a href=\"/s/ital-iasc-2q90/page/locations#StPaulStChurch\">St. Paul St. church</a> to practice<br>as she did not like to&nbsp;<br>go alone. She is going to&nbsp;<br>supply for <a>Miss Vanderburgh</a>.<br>Went to <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren's</a> after and&nbsp;<br>then she treated me in <a href=\"/s/ital-iasc-2q90/page/locations#JMJeans\">Jean's</a> to&nbsp;<br>an ice cream soda. Practiced in&nbsp;<br>afternoon. Then went up&nbsp;<br>to McLaren's after 2 puff ties<br>for a quarter. Lizzie was<br>down to see <a>Phoebe,</a> at&nbsp;<br>night.",
	"1900-06-30" : "Took my last music lesson<br>before the holidays. <a>Miss<br>Scott</a> took her lesson after<br>me. Had to go to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardts</a>.<br><a>Miss McCaul</a> is in <a>Miss Macfarlane's</a><br>place. Had to get &quot;<a>Fantasiest&uuml;ck Op 7.&quot; by. C.<br>Reinecke</a>, and <a>Valse Chromatiqu</a><a>e<br>Op 88, by Godard</a> to practice<br>during holidays. Papa &amp; <a>Frank<br>Overholt</a> went to <a>Dunnville</a><br>this afternoon. Mamma &amp; I<br>drove out to the bush<br>after moss. Lizzie was<br>down.",
	"1900-07-01" : "Mamma &amp; I went to church<br>in morning. Lesson <a>Matt<br>IX 2 verse</a>. Healing of Paralytic<br>Staid [sic] to Communion. Came<br>home with <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> and<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMattie\">Mattie</a>. Made some ice-<br>cream. <a>Lizzie</a> came after me<br>to go to Sunday School.<br>Lesson &quot;Christ walking on the<br>Sea.&quot; Mamma &amp; I went for<br>a drive out middle road<br>Found some mulberries<br>and wild red raspberries.<br><a>Mr &amp; Mrs. Pay</a> came over<br>to eat ice cream at night.",
	"1900-07-02" : "Holiday for Dominion day<br>Stuck out my sixteen<br>flags. Sounds big, but<br>twelve are little ones I<br>watered the road in<br>front. A large crowd<br>came over on the boat<br>Mamma &amp; I went for<br>a drive. Got some<br>daiseies near <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanMr\">Mr. Carman's</a><br>farm. Had some chocolate<br>drops and taffy I got on<br>Saturday.",
	"1900-07-03" : "Papa and Frank Overholt came<br>home. Stayed in Hamilton<br>last night. Mrs. Overholt,<br>and the boys start for Bay<br>City this morning. Very<br>warm. Makes you tired<br>Lizzie came down. Roy<br>Read brought our black<br>cherries to-night. They<br>have a festival in <a href=\"/s/ital-iasc-2q90/page/locations#StJohnsChurch\">St. Johns<br>church in Port</a> to-night.<br>He was going to it.",
	"1900-07-04" : "Canned my black cherries<br>this morning. I feel<br>horrible to-day. The fourth<br>of July. Hardley practiced<br>a bit. Had a bad<br>thunderstorm in the<br>afternoon. Papa, Mr. Coy &amp; Mr<br>Fred Southcott went out<br>to lake to see about the<br>boat. Beatrice stopped as<br>she was coming home<br>from the farm. Very hot,<br>but we got some rain which<br>we needed very much.",
	"1900-07-05" : "The lightning struck the<br>Standard office yesterday<br>aternoon. We got our<br>two baskets of red<br>cherries this morning<br>Did not get through pitting<br>them until after two o'clock.<br>There was quite a number<br>of accidents in Yankee<br>land yesterday. A colored<br>boy shot a revolver among<br>some fireworks outside of a<br>store in Philadelphia, and<br>killed seven children he among them.<br>The band concert. They played<br>&quot;Parson Ringtails' cakewalk. We<br>could not hear it.",
	"1900-07-06" : "Very warm. It has been<br>the worst day this year.<br>All foreigners are supposed<br>to have been killed in<br>Pekin. I am knitting<br>a wash cloth. Did not<br>stir much. We are to<br>have a memorial service<br>in our church Sunday<br>for R. Irwin who died in<br>Smith Africa July 1. He was<br>of first contingent.<br>Mrs. Carman &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> were<br>over to see the rambler.",
	"1900-07-07" : "Went to market after<br>peas, and to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a><br>after my music. Got Godard's<br>&quot;Valse Chormatique&quot;, but not<br>the other. Was at <a href=\"/s/ital-iasc-2q90/page/locations#WilsonsGrocery\">Wilson's</a>.<br>Had a large excursion in<br><a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the Park</a> for Toronto. The<br><a href=\"/s/ital-iasc-2q90/page/locations#DominionRadiatorCo\">Dominion Radiator Co</a>. They<br>had a baseball match between<br>Park nine &amp; themselves. Had<br>the Grenadier Band. Papa &amp;<br>mamma went frog-shooting.<br>The Buffalo Tennis Club<br>played a match with ours<br>this afternoon.",
	"1900-07-08" : "Papa &amp; I went to church in<br>the morning. They had a<br>memorial service for<br>R. Irwin who died July 1st.<br>All the soldiers and veterans<br>were out. Took our seat.<br>Sermon Ecclesiastes XII. 13&amp;14 verses.<br>Did not go to Sunday School<br>or church at night. Walter<br>Dr. Moulin the Bishop's son<br>preached in the church at<br>night. Mr. McSloy &amp; Frank<br>Overholt were here at night.<br>I have been reading &quot;Prince of House of David&quot;<br>over again.",
	"1900-07-09" : "Very chilly and damp to-day.<br>Practiced 2 hours to-day<br>as it was cool. They<br>intended having the<br>electric cars running to Falls<br>to-day but the President<br>Mr. Powers was out<br>of the city. Had an<br>excursion in <a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the Park</a><br>to-day. Very nice day<br>for once. Mr &amp; Mrs. Dwyer<br>were over in the evenening.<br>Papa &amp; mamma were<br>hunting dew worms<br>this evening.",
	"1900-07-10" : "Was over to <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren's</a><br>after beans, then came<br>home and went to<br><a href=\"/s/ital-iasc-2q90/page/locations#WWGreenwoods\">Greenwood's</a> for Phoebe<br>and to <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a>. Got<br>&quot;The Throne of David&quot; by<br>Ingraham. This afternoon<br>I dressed up and went<br>over to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allies</a>. But she was<br>at Sunday School picnic then<br>I went to see <a href=\"/s/ital-iasc-2q90/page/communitymembers/#ReadBessie\">Bessie Read</a><br>Had two Sunday School<br>excursions from Toronto in <a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the park</a><br>to-day. Papa &amp; mamma drove to the cemetary.",
	"1900-07-11" : "Was over to Carman's<br>in the forenoon to<br>ask <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> to go to Decew<br>Falls with us this<br>afternoon. But when<br>afternoon came it looked<br>so rainy that we couldn't<br>go. But we went for a<br>drive around the streets.<br>Had a thunderstorm and<br>a very high wind. <a href=\"/s/ital-iasc-2q90/page/locations#KnoxChurch\">Knox<br>Church</a> had their picnic<br>at <a href=\"/s/ital-iasc-2q90/page/locations#McCallasGrove\">McCalla's Grove</a> and <a href=\"/s/ital-iasc-2q90/page/locations#StPaulStChurch\">St.<br>Paul</a> &amp; <a href=\"/s/ital-iasc-2q90/page/locations#NiagaraStChurch\">Niagara</a> Sts. had theirs<br>to Grimsby.",
	"1900-07-12" : "Thought of going to Decew<br>again but it looked like<br>rain. Mamma &amp; I got<br>ready and went uptown<br>Went to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhart's</a> but my<br>book has not come yet.<br>Saw <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CarrollLillie\">Lillie Carroll</a>. They got<br>soaked at the picnic yesterday.<br>Had a large excursion to day:<br>Lizzie was down about 6 o'clock<br>Jennie Jeeves was married in<br>Tonawanda at 8 p.m. to Mr Charles<br>World. Mollie Phelps and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie<br>Coy</a> had a wheeling party. Papa<br>went to boat to meet Frank Overholt.",
	"1900-07-13" : "Band night (children) last night<br>in <a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the Park </a>. Was uptown<br>in the morning to <a href=\"/s/ital-iasc-2q90/page/locations#InksaterBros\">Inksatis</a> [sic]<br>&amp; <a href=\"/s/ital-iasc-2q90/page/locations#JMcLarenGarden\">McLarens garden</a>. Saw <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a><br>to tell her to get ready<br>for Decew Falls to-day.<br>Mamma, Ella &amp; I went.<br>Did not get many fish<br>Brought five home alive<br>in the minnow pail.<br>Miss Francis &amp; four other<br>girls were out with Mr<br>Webb to Decew. Papa went<br>down to the boat at night<br>to meet Frank.",
	"1900-07-14" : "Mr Overholt and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BirdsallMr\">Mr Birdsall</a><br>of Hamilton came down, and<br>papa hired a rig and<br>Mr Overholt, Mr Birdsall Frank<br>Overholt &amp; papa went out<br>plover shooting. Mamma<br>&amp; I went uptown in the<br>afternoon. Met Mrs Pay,<br>I got my &quot;Fantasiest&uuml;cke&quot;<br>at last. Met Mrs Pay at<br>Lu's and we went home<br>with her. Moore did not<br>sent some ham &amp; berries<br>down &amp; I had to go up on my wheel [?]",
	"1900-07-15" : "Very warm. 90&deg; in the<br>shade. Got dressed for<br>church, and it was late<br>when we got through<br>breakfast so I did not<br>go. The three men drove<br>out to Overholt's in the<br>afternoon. Did not got to<br>Sunday School or Church<br>at night. Were bad to-day<br>Rained very hard about<br>3 o'clock. Had pineapple<br>ice cream to-day. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BirdsallMr\">Mr<br>Birdsall</a> does not like bugs<br>and I found a snapping bug<br>and I put its head towards<br>him &amp; it crawled up his sleeve he heard",
	"1900-07-16" : "it &quot;shnappin&quot; as he said<br>Mr Overholt &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BirdsallMr\">Mr Birdsall</a><br>left this morning. Then<br>papa left for <a href=\"/s/ital-iasc-2q90/page/locations#StoneyLake\">Stoney Lake</a><br>on the Lakeside for a<br>fishing trip. Frank is<br>going with him. I went<br>up to the <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">post</a>, but did<br>not get anything. Roy<br>brought the paper &amp; letters<br>down. Mamie Utter &amp; Janie Stuart<br>are coming Friday and I had<br>to take a letter to her up to<br>the post. Mr Painter brought me<br>some fish for my aquarium.",
	"1900-07-17" : "Very warm. The exams<br>ended yesterday. I have<br>been reading &quot;Throne of<br>David&quot; nearly all day.<br>Practiced. Mamma<br>went over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> as<br>it looked like rain.<br>Did rain some. Mabel<br>brought the towels<br>and papers after tea<br>Agnes St. Methodist Church<br>of Toronto were in <a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the<br>park</a> to-day",
	"1900-07-18" : "A day of picnics. Ours went<br>to Grimsby, <a href=\"/s/ital-iasc-2q90/page/locations#WellandAvenueChurch\">Welland Ave.<br>Church</a> to <a href=\"/s/ital-iasc-2q90/page/locations#McCallasGrove\">McCalla's</a>, <a href=\"/s/ital-iasc-2q90/page/locations#StBarnabasChurch\">St.<br>Barnabas</a> to <a href=\"/s/ital-iasc-2q90/page/locations#QueenstonHeights\">Queenston</a>, &amp; <a href=\"/s/ital-iasc-2q90/page/locations#StJamesChurch\">St<br>James Merritton</a> to Port<br>Colborne. I went uptown<br>stopped for Mr Pay's keys.<br>Was to Dudley's. Leta had<br>gone to picnic. Going with<br>Allie Vanderburgh to Queen St,<br>The keys did not fit. Annie Lloyd<br>went to <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren's</a> with me.<br>A large Sons of England picnic in <a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the<br>park</a>.",
	"1900-07-19" : "Rode up to <a href=\"/s/ital-iasc-2q90/page/locations#Smiths\">Smith's</a> for meat,<br>He has quit giving trading<br>stamps. I hope I do not<br>lose my book. Mamma<br>went collecting in afternoon.<br>She was at <a href=\"/s/ital-iasc-2q90/page/locations#WoodBros\">Woods</a> to see if<br>they wanted to try[?] trading stamps<br>but they had all they wanted as<br>they quit giving out 1{st} August.<br>I went over to Leta's in the<br>afternoon. And when I came<br>away she went with me to<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie's</a> as I wanted to get<br>the address of &quot;The Etude&quot;. Mamma<br>and I went for a drive at night.<br>&quot;The Musician&quot; came to-night. The<br><a href=\"/s/ital-iasc-2q90/page/locations#WellandValeWorks\">Welland Vale</a> &amp; Kinleith Paper Co. bylaw passed.",
	"1900-07-20" : "Leta is going to Toronto to-day. I<br>had to go uptown in the<br>morning. Got 1/2 yd. of velvet<br>ribbon for my hair at <a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Anderson's</a>.<br>It rained very hard last night.<br>Finished &quot;Throne of David.&quot; I<br>enjoyed it, and think I will<br>get &quot;The Pillar of Fire&quot; as I have<br>read the two other ones. Mamie &amp;<br>Janie Stuart came this afternoon<br>Lizzie &amp; Miss Toll were down at night<br>Lizzie wants me to take her class<br>Sunday. I have consented, but oh!<br>my.",
	"1900-07-21" : "I had to go uptown in<br>morning for meat. Got<br>a hind quarter of lamb<br>$1.40. Oh my. I mailed some<br>letters for Mamie. Went<br>on market to see Mrs<br>Woodruff about berries.<br>Mamma, Jean &amp; Mamie drove<br>out to Decew in the afternoon.<br>I rode up to <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a>.<br>Got the &quot;Pillar of Fire&quot;<br>Saw <a href=\"/s/ital-iasc-2q90/page/communitymembers/#ReadBessie\">Bessie Read</a> &amp; Lulu.<br>Got the papers.",
	"1900-07-22" : "I went to Church in the<br>morning. Sermon on I Samuel<br>XII 2 &amp; 3 verses. The girls<br>would not go. Then<br>I went to Sunday School<br>and took that awful<br>class. The lesson &quot;Christ's<br>Rebuke &amp; Peter's Confession&quot;,<br>They would not pay any<br>attention to me. The Salvation<br>Army people had a great time in<br><a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the park</a>. The people went<br>for a drive down through<br>Port.",
	"1900-07-23" : "Staid [sic] around home nearly<br>all day. Roy was down<br>in the morning to find<br>papa's address then he<br>brought the papers<br>at night. Had two meals,<br>then the girls and<br>mamma went for a<br>drive to the cemetary<br>and I rode down they<br>went to Mrs Woodruff's<br>after, and got the raspberries<br>and some apples<br>Papa sent a box of fish.<br>Will not be home until<br>Wednesday night.",
	"1900-07-24" : "I went collecting for Mamma.<br>Was to Mrs Reynolds,<br>Coy's and Mrs Smith's. Got the<br>money at every place<br>Was at Mrs Smith's quite a<br>while. Then went up to<br><a href=\"/s/ital-iasc-2q90/page/locations#WilsonsGrocery\">Wilson's</a>. They drove out<br>to Overholt's with three<br>large bass. Lizzie was<br>down, and <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> brought us<br>a lovely bunch of sweet<br>peas. Got &quot;Ladie's [sic] Home Journal<br>for August. Has a sweet story<br>&quot;The Story of a Song.&quot; Schubert's love story",
	"1900-07-25" : "I had to take the money<br>to the church to-day.<br>There was only <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChatfieldMrs\">Mrs<br>Chatfield</a>, Mr Perry &amp; Mrs<br>Wyatt there. I was asked by<br>Mr Perry &quot;if I was general<br>collector for this month&quot;.<br>Waited for the names. Got<br>some fancy biscuits at <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a>.<br>Papa &amp; Mr Overholt came<br>home to-night. Papa<br>brought me some porcupine<br>quills, two hawk's feet &amp; a<br>porcupine's foot. He drove Mr<br>Overholt home.",
	"1900-07-26" : "Fixed ourselves all up<br>fancy, and went uptown<br>in afternoon. We all were<br>treated at <a href=\"/s/ital-iasc-2q90/page/locations#JMJeans\">Jean's</a> to icecream [sic]<br>by mamma. Went in the<br>stamp store. Got a<br>watermelon &amp; some bananas.<br>Papa took a fish over to Coy's<br>then we went up to<br>the band concert.<br>They played a pretty medley<br>with national airs woven<br>in.",
	"1900-07-27" : "Mame &amp; Janie went home<br>this morning on 10.33 train<br>They reach Detroit to-morrow<br>afternoon. Copied the Sunday<br>School lessons for next 2<br>Sundays. Mr Groome is<br>dead.&nbsp; Mamma &amp; I went<br>for a drive. Took Lizzie's<br>Sunday School papers home<br>then drove out Martindale<br>way lake road to <a href=\"/s/ital-iasc-2q90/page/locations#WilsonsGrocery\">Wilson's</a><br>and I down the pretty little<br>road. Got some long blackberries<br>The Success &amp; Collier's Weekly<br>came to-night.",
	"1900-07-28" : "Rode over to <a href=\"/s/ital-iasc-2q90/page/locations#JMcLarenGarden\">McLaren's</a> after<br>potatoes &amp; tomatoes. First of<br>the season. Momma &amp; I did<br>up seven quarts of huckle-<br>berries. Papa sent one doz.<br>tomatoes and two bottles<br>of Heinz's India Relish. Good.<br>Mamma &amp; I went to <a href=\"/s/ital-iasc-2q90/page/locations#WoodBros\">Wood's</a><br>in afternoon after a pair<br>of slippers for me. Got a<br>pair of Krippendorf's of Cincinnati<br>Papa &amp; Mamma went fishing.<br>Mr McIntosh was here to see<br>about a trellis for the trumpet-vine.",
	"1900-07-29" : "Went to church in the<br>morning. Sermon about Saul<br>performing the sacrifice instead<br>of waiting for Samuel. I have<br>forgotten the passage, but it was<br>in Samuel. Then I went<br>to Sunday School. The lesson<br>was &quot;The Transfiguration&quot;. Had<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#ChatfieldMrs\">Mrs Chatfield</a>. Miss Francis<br>has taken Lizzie's class for August.<br>Mr Perry wanted to know whether<br>I would take it, but Lizzie told<br>him I had enough of it.&nbsp; Pappa, mamma<br>&amp; I went to church at night. Sermon<br>2 Cor. 12.-10. It was raining hard<br>when we came out. So we<br>waited &amp; Papa went home for wraps.",
	"1900-07-30" : "Annie Trusty was here to tell<br>us her mother will come<br>to-morrow instead of Wednesday.<br>She is very anxious about<br>those stamps so in the<br>afternoon I went over to<br><a href=\"/s/ital-iasc-2q90/page/locations#Durnins\">Durnin's</a> after soap &amp; sugar<br>then up to the stamps store<br>to see if they were going<br>to stop taking books after<br>Aug first. They are. Leta, Grace<br>Woods &amp; Nell Lloyd were down<br>at night. Leta wants me to<br>go to a wheeling party tomorrow night.",
	"1900-07-31" : "Mrs Trusty washed. <a href=\"/s/ital-iasc-2q90/page/locations#WoodBros\">Wood Bros.</a><br>are giving triple stamps<br>to-day. If I had only waited<br>to get my slippers, but I was<br>not fooled as I needed a<br>pair of rubbers. Got 18 stamps.<br>Went to Dudley's to tell her<br>I couldn't go to the wheeling<br>part, but I would come about 9<br>to the house. Nellie Lloyd called<br>for me. They rode to Homer. Did<br>not get back until after 9. Had<br>ice-cream &amp; cake. Mr Reed came home<br>with me. The King of Italy<br>(Humbert) has been assassinated<br>The Queen's son Duke of Saxe-Coburg<br>Gotha {1} is dead.",
	"1900-08-01" : "This afternoon I dressed &amp;<br>went to Mrs Pay to see if<br>she would go for a drive.<br>Stella is there. She &amp; Beatrice<br>rode to Niagara this afternoon.<br>Mamma &amp; Mrs Pay went for a drive.<br>Papa went uptown at<br>night to see Dr Kilmer,<br>Beatrice gave Mrs Pay<br>146 stamps &amp; Mrs Ward 125<br>as she could not sell them.<br>Papa bought some apricots<br>to-day.",
	"1900-08-02" : "Looked like rain. Mamma<br>&amp; I went for a drive to<br>Mrs Woodruff's. We<br>will get our long<br>blackberries. Tuesday<br>I got a piece of butterfly<br>weed near Woodruff's.<br>Papa went to lodge at<br>night and I went with him<br>as far as Pay's to see<br>Stella. Had not been there<br>a minute when Beatrice &amp; Percy<br>came after her to go to <a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the park</a>.<br>We went. It was a fine<br>programme. They played<br>Kiplings Recessional{1}. Jolly<br>Fellows &amp; New twostep [??] Kinky Kink[?]. Mr Peel[?] was<br>there.",
	"1900-08-03" : "Mamma has a sore side to-day.<br>I went uptown. Took<br><a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book back and got<br>&quot;Opening of a Chestnut Burr&quot;<br>Bought two twin down<br>collars at <a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait's</a>. Got a box<br>of long berries. I got a letter<br>from <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CowieBessie\">Bessie Cowie</a> yesterday.<br>She will be at her grandma<br>to-morrow. Put my<br>aquarium up on the<br>verandah so we could<br>see them better.",
	"1900-08-04" : "Papa &amp; Frank Overholt are<br>going to 16 this afternoon<br>to stay till Monday. Mamma<br>drove Papa out. I was uptown<br>in afternoon. I tried on my<br>new collar and I have to<br>take it back it is so large.<br>Stopped in Mrs Pay's Ida &amp;<br>Stella are going to Buffalo on<br>5:20 car. I took my stamp<br>book up for 10 premiums.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BorrowmanLouise\">Louise Borrowman</a> stopped<br>&amp; borrowed our pump.&nbsp; Annie<br>McEdward &amp; Belle McClive<br>were with her. Rode up to<br>Kanes after tea for a box of berries.",
	"1900-08-05" : "Went to church in morning.<br>Sermon I Samuel XII. 6 verse.<br>Very warm. Then I went<br>to Sunday School. We got<br>nicely settled in the Bible class<br>room when Mr Perry came after<br>a teacher and asked if Miss<br>Winnie would take it to<br>oblige him so. Miss Winnie took<br>it. It was Beatrice's class. 9 were<br>there. I got along all right.<br>Lesson. Christ &amp; the children Matt XVIII<br>1-14. I finished &quot;Opening of Chestnut<br>Burr&quot; to-night. Did not go to Church.",
	"1900-08-06" : "Mr Halliday was here &amp; said<br>&quot;I did not see you at church<br>last night but I suppose you<br>would have been there if it<br>had rained: Civic Holiday. 90&deg;<br>oh! it is so warm. Mamma<br>&amp; I drove down to Mrs Woodruff's<br>after berries. Then she<br>drove out to the sixteen<br>after Papa. He brought two<br>nice fish a channel cat &amp;<br>a bass. Mr Keyes &amp; Roy were<br>out there.",
	"1900-08-07" : "Very, very warm. 96&deg; in the<br>shade. Did not do much<br>of anything. Started<br>another washrag. Have<br>had my waist turned<br>in at the neck it was<br>so warm. Went over to<br><a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> about 5 after<br>lemons. Mamma got a<br>letter from Name [?] &amp; Phoebe<br>some papers.",
	"1900-08-08" : "About 10 o'clock who marched<br>in but <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CowieBessie\">Bessie</a>, and she<br>wanted me to drive home<br>with her. She had taken her<br>cousin to the trolley &amp; she had her<br>grandmother Cowie's horse I went<br>with her. We staid [sic] at Cowie's<br>for a while &amp; I had refreshments.<br>Then we started our walk in<br>the awful hot sun got to Overholts<br>about 12 o'clock. Saw some scorpions<br>centipedes, tarantulas, lizards<br>&amp; a snake Frank brought from Africa<br>also some snapshots. He entertained<br>us with the graphophone. Mamma<br>came after me when we came<br>home Mr &amp; Mrs Pay were there.",
	"1900-08-09" : "Mr McTavish's son &amp; a Mr Smith<br>were drowned in <a href=\"/s/ital-iasc-2q90/page/locations#MalpasPond\">Malpas' pond</a><br>yesterday about 5 o'clock<br>Mamma went uptown in<br>the afternoon. She got double<br>trading stamps at <a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait's</a> &amp; I<br>only need 24 more to fill my<br>book. Got a new pair of summer<br>corsets. I was over to Carman's<br>in the afternoon. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a><br>was over at night.<br>Got some more medicine<br>from Cincinnati. Got a basket<br>of harvest apples",
	"1900-08-10" : "Had an old tramp here for<br>dinner Had a fine buckleberry<br>pie. Very warm yet. The<br>Band did not play last<br>night. Mr Peel has been<br>asked rates for the Pan-<br>American. Very warm<br>yet. At night I went<br>over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> after Butter<br>Saw Mrs Pay. Ida and<br>Stella are in the<br>country to-day and leave<br>for Toronto to-morrow.<br>Pa got a pair of white<br>trousers.",
	"1900-08-11" : "Still a roaster. The two<br>boys that were drowned<br>on Wednesday were buried<br>yesterday in one grave.<br>Beatrice has to play in<br><a href=\"/s/ital-iasc-2q90/page/locations#StPaulStChurch\">St. Paul St. Church</a> to-morrow<br>as Miss Vanderburgh is away<br>Got the &quot;Parish &amp; Home&quot; to-night,<br>and Mr &amp; Mrs Perry have gone<br>visiting to Georgian Bay<br>Rained a little in the<br>afternoon.",
	"1900-08-12" : "Much cooler. Too much of<br>a change. Did not go to<br>Church in the morning<br>or evening but went to<br>Sunday School Mrs Haun<br>is back and we are all<br>glad. They had a young<br>man this morning, and<br>next Sunday I think Mr Weaver<br>of Beamsville, then Mr Miller<br>The lesson was Matt XVIII 21-36<br>Papa &amp; mamma started for<br>a drive but it rained. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ComfortDr\">Dr<br>Comfort</a> came back with Papa<br>then when it cleared they<br>started again. Tommy paid<br>us a visit to-night",
	"1900-08-13" : "Very damp and cool<br>out to-day. I made<br>some maple cream<br>with hickory nuts<br>in to-night. Mamma<br>went over to Carman's<br>to have <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> show her<br>how to do darning needle<br>work. Had two students<br>in church last night.<br>Papa paid me $2.00. Pansy<br>caught a mouse in paper<br>basket",
	"1900-08-14" : "Mamma went to <a href=\"/s/ital-iasc-2q90/page/locations#WellandHouse\">Welland<br>House</a> to call on <a href=\"/s/ital-iasc-2q90/page/communitymembers/#TulleyMrs\">Dr Abbott's<br>sister.</a> I dressed and<br>went down to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CrawfordMiss\">Miss<br>Crawford's</a> but nobody<br>was home. Called in<br>Dwyer's and Beatrice was<br>not home. Mrs Dwyer<br>thought she had gone to St<br>David's for tea. Mabel came<br>after the towels and brought<br>a little Skye terrier pup<br>Looks like rain again<br>to-night. Kid's night in <a href=\"/s/ital-iasc-2q90/page/locations#MontebelloPark\">the<br>park</a> but I do not think<br>the band played.",
	"1900-08-15" : "Had to go uptown in the<br>morning after cake and<br>ham for to-night. Sent for<br>5 large pictures &amp; a cover from<br><a href=\"/s/ital-iasc-2q90/page/locations#BrownAndCo\">Brown &amp; Co.</a> Then in the afternoon<br>I had to go at 1.30 with papa<br>to the office. Had my teeth filled<br>Took <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book back I got<br>&quot;A Ministering Angel&quot; by Clayton.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#TulleyMrs\">Mrs Tulley</a> his sister<br>were here for tea. After tea<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr</a> &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> came over. Had<br>ice-cream. Had barn floor<br>fixed.",
	"1900-08-16" : "Papa took Nelly up to <a href=\"/s/ital-iasc-2q90/page/locations#MurphysLivery\">Murphy's</a><br>livery for a few days<br>This afternoon she was<br>hitched with another horse<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> drove down &amp; then we<br>called for <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> and took<br>her for a drive. We drove<br>to Decew Falls. Got out<br>to see the first falls.<br>The Bicycle Bylaw passed<br>yesterday but the Basket<br>factory did not Leta was<br>over in the afternoon.<br>The band played to-night.<br>Mr McIntosh came to see<br>about shingling the house.",
	"1900-08-17" : "In the afternnon <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr<br>Abbott</a> drove down for<br>mamma &amp; I. Mrs<br>Klotz was going, but sent<br>word. We drove out<br>Martindale way, past<br>Overholts down Pollywog<br>road through Port<br>and home. Papa<br>&amp; Mamma went to<br>Dr Klotz' at night Dr<br>Abbott &amp; Mrs Tulley were<br>there. Tried to get butter<br>at <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> &amp; <a href=\"/s/ital-iasc-2q90/page/locations#Durnins\">Durnin's</a>, but failed.",
	"1900-08-18" : "Had a nice rain this<br>afternoon Butter was<br>28&cent; a lb. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> &amp; his<br>brother from London<br>drove down &amp; papa was<br>going with them fishing<br>but so much rain afraid of<br>a ducking [?]. turned out bright<br>and clear. <u>Poor</u> men got [xxx]<br>their fishing and drive. Mamma<br>&amp; I were uptown in<br>afternoon. Bought a silver<br>heart with a maple<br>leaf in it. The only<br>thing that worried me was<br>the 30&cent; I paid for it Leta passed.",
	"1900-08-19" : "Papa, mamma &amp; I drove up to the<br><a href=\"/s/ital-iasc-2q90/page/locations#WellandHouse\">Welland House</a> &amp; called for<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#TulleyMrs\">Mrs Tulley</a><br>Nellie fell down. Went<br>to <a href=\"/s/ital-iasc-2q90/page/locations#QueenstonHeights\">Queenston</a> and had<br>our dinner at the<br><a href=\"/s/ital-iasc-2q90/page/locations#MonumentHouse\">Monument House</a>. I had a<br>pretty Jack on &amp; I gave it to Dr<br>Abbott. Papa &amp; I went on<br>the trolley to Chippawa<br>and Uncle Horace met us.<br>Constance was at Black<br>Creek",
	"1900-08-20" : "Rained all morning. Papa<br>went home on the 7.30<br>train. Constance &amp; I looked<br>at pictures. Then it cleared<br>off in the afternoon,<br>and we ate apples<br>and fished. Then I<br>amused them by playing<br>at night. Grandpa and<br>Mr Henderson caught<br>7 catfish and a bass",
	"1900-08-21" : "Constance and I went<br>fishing on the bridge. She<br>caught four sunfish and I<br>caught one. Then we came<br>home and changed the<br>water on her mudturtle.<br>Grandma and Aunt Lillie are<br>making elderberry jelly<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BeamAnnie\">Annie Beam</a> was<br>helping <a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt Lillie</a>. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BeamLillie\">Lillie<br>Beam</a> came up to have<br>Aunt Lillie do some shopping<br>for her in Toronto. Mr Henderson<br>took Constance &amp; I for a row on the river.",
	"1900-08-22" : "Wrote a letter to mamma<br>then went to-get ready<br>for Ridgeway. Grandpa,<br>Constance &amp; I drove up. After<br>we had been there for a<br>while <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt Allie</a> took us<br>to Murray Hibbard's and we<br>went back to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#Cutler\">Cutler's</a> and we<br>went to Murray's for dinner<br>Saw Milton, Uncle Henry. Came<br>home about 3 o'clock. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt<br>Lillie</a>, Uncle Horace &amp; Constance<br>went over to Toronto. Stella<br>&amp; Mrs Woolnough were down at<br>night. Mr Henderson went home early<br>in the morning. Saw the train<br>come in &amp; Mrs Jenks Mildred &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BeamLillie\">Lillie</a><br>came home with me.",
	"1900-08-23" : "Practiced some to-day. Got<br>some snails and water-<br>lily roots for my aquarium<br>Albion Waite, Mrs Waite, kid<br>and Mr Waite's sister were<br>here for dinner. Went to<br>see <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BeamLillie\">Lillie Beam</a> &amp; Leorena Jenks<br>Met Miss Dainty, Miss Hutt,<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoothMiss\">Miss Booth</a> and Miss Marbourgh<br>Saw the train come in at 5.40<br>Leorena came down to have<br>me drive to Stevensville with<br>her. She took the washwoman home<br>Saw the searchlight from the falls.",
	"1900-08-24" : "Gloomy again this morning<br>Grandpa caught me<br>two mudturtles. Read<br>some &amp; played with the<br>kitten. Waites are here yet.<br>Got two more water<br>lily roots. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BeamLillie\">Lillie Beam</a><br>came to see me in the<br>afternoon. Came home on<br>the 5.10. Had company. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AdieJessie\">Jessie<br>Adie</a> was coming home from<br>Buffalo. Mamma met me at<br><a href=\"/s/ital-iasc-2q90/page/locations#CliftonHouse\">Clifton</a>. Had my first ride on<br>the new trolley. Met Beatrice<br>Papa is not well",
	"1900-08-25" : "Got my mudturtles ready.<br>Put them in the tin tub<br>after dinner mamma<br>saw a water lily root on<br>the ground, and here<br>Dexter had taken my<br>mudturtles out and the lilies.<br>Did not find them. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a><br>was down in the afternoon<br>I had to go over to Carmans<br>after papa. Saw <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanSam\">Sam Carman</a><br>Mrs Carman has been away<br>Rev McKerr's son was buried<br>this afternoon.",
	"1900-08-26" : "Did not go to church as<br>it was too warm. Tried<br>to find some pictures for a<br>small frame, but couldn't.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#TulleyMrs\">Mrs Tulley</a> were<br>down in the afternoon<br>and Dr and papa went to<br>the sixteen. They brought<br>a basket of apples down<br>with them. Then they<br>went back to the hotel<br>and came down again<br>after supper. The band has<br>not given a sacred concert this<br>year.",
	"1900-08-27" : "Tommy was over.<br>Mamma &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#TulleyMrs\">Mrs Tulley</a> went<br>for a drive I sent for<br>some minature pictures<br>of musicians &amp; C from<br><a href=\"/s/ital-iasc-2q90/page/locations#BrownAndCo\">Brown's</a>. Was over to Dudley's.<br>Ida Woods was there.<br>Nellie Lloyd went up to<br>the <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">post</a> with me. I<br>got the mail for Mrs<br>Pay. Dr Overholt of Hamilton<br>was here for tea",
	"1900-08-28" : "Eva Tucker was over nearly<br>all morning; and I couldn't<br>get much practicing done<br>Nellie has a lame foot.<br>Mamma and I drove up<br>to the office and I took the<br>towels up, and he brought<br>down the small medicine<br>cabinet. Then we drove out to<br>Overholt's. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CowieBessie\">Bessie</a> was over to<br>Grandma Cowie's. Did not see her.<br>Got some sweet apples.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#TulleyMrs\">his sister</a><br>were down at night. Played<br>for them.",
	"1900-08-29" : "Practiced in the morning as<br>we are going uptown in the<br>afternoon. Mrs Trusty was<br>here. Mamma took <a href=\"/s/ital-iasc-2q90/page/communitymembers#TulleyMrs\">Mrs Tulley</a><br>a bunch of flowers and her<br>lace pattern back. Staid [sic] awhile<br>at the hotel. Then went to<br><a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait's</a>. Just got 19 stamps<br>enough to fill my book.<br>The stamp store was closed.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#ColganDr\">Dr Colgan</a> was down to see<br>Nellie We have new neighbors.<br>A little kitten has been visiting<br>us the last couple of nights.",
	"1900-08-30" : "Eva brought her kittens<br>over for me to see<br>them. Cracked enough<br>hickorynuts to make candy<br>and cake. Eva helped me<br>pick them out. Mamma and<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#TulleyMrs\">Mrs Tulley</a> went for a<br>drive. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanBlanche\">Blanche Carman</a><br>brought mamma's doily<br>home. Got a letter from<br>Mr Read yesterday and I<br>commence lessons on the 8th<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> and Mrs Tulley were<br>down at night.",
	"1900-08-31" : "I had a present given to<br>me. Eva brought a small<br>muskmelon about the size<br>of an [sic] large orange. Brought<br>some books down for her<br>Mamma &amp; I went to the<br>hotel this afternoon and<br>invited <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Mrs Tulley</a><br>for tea Sunday evening. Was<br>at the stamp store. Got a<br>silver teapot. Mrs Tulley<br>treated us to ice-cream. Eva brought<br>me another melon. Mamma<br>went over to Pay's.",
	"1900-09-01" : "Eva was in again this<br>morning. I made the candy<br>for grandpa. Papa and<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> went out fishing.<br>Were at the 1618, and twenty.<br>Leta came over to have<br>me go uptown with her.<br>She took me in <a href=\"/s/ital-iasc-2q90/page/locations#Shelleys\">Shelley's</a><br>and we got chocolate soda<br>then took her to <a href=\"/s/ital-iasc-2q90/page/locations#JMJeans\">Jeans</a> and<br>we got pineapple. Eva<br>brought over a book by<br>Mary J Holmes &quot;Tempest<br>and Sunshine&quot;. Grandpa<br>did not come.",
	"1900-09-02" : "Very warm. Did not go to church<br>all day. Read &quot;Tempest and<br>Sunshine&quot; Eva and Tom<br>over and Tom was chasing<br>poor Dexter. Eva brought a<br>paper with a continued story<br>in it over. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#TulleyMrs\">Mrs Tulley</a> and<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> had tea here.<br>Mamma, Mrs Tulley and I<br>had a walk.",
	"1900-09-03" : "Had a candy braom [??] given<br>me. Eva bought us all<br>some candy Mr Pay was over<br>and wanted to buy our<br>pears and some Crawford<br>peaches. We intended going<br>to the sixteen for a picnic,<br>but the rain prevented<br>us. There was a gentleman<br>here looking after Fitzgerald's<br>house. Eva lent me<br>another book. &quot;<a href=\"https://www.jeromekjerome.com/bibliography/books/three-men-on-wheels/\">Three Men<br>on Wheels</a>&quot; by Jerome. Eva &amp;<br>Tom were over nearly all day.<br>Mr Taylor is picking pears.",
	"1900-09-04" : "Was reading &quot;Three men on<br>Wheels&quot; when <a href=\"/s/ital-iasc-2q90/page/communitymembers/#TulleyMrs\">Mrs Tulley</a><br>and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> came in.<br>They wanted papa, mamma<br>&amp; I to go to the <a href=\"/s/ital-iasc-2q90/page/locations#WellandHouse\">Welland<br>House</a> for tea. Dr Abbott<br>hurried up to the office<br>and caught papa. Had a<br>very good supper. They<br>walked home with<br>us. Mrs Tulley told about<br>a good books &quot;<a href=\"https://books.google.ca/books?id=_WU5AAAAMAAJ&amp;pg=PA124&amp;lpg=PA124&amp;dq=%22Uarda%22+by+14+Ebeer&amp;source=bl&amp;ots=4XOVP70XXs&amp;sig=ACfU3U2Cbtb4DwOUo-B5VP1aD_-sI6xvZw&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwi0qN_i7a_gAhUBOq0KHeR7DrYQ6AEwBnoECAMQAQ#v=onepage&amp;q=%22Uarda%22%20by%2014%20Ebeer&amp;f=false\">Uarda</a>&quot; by<br>Ebeer [sic].",
	"1900-09-05" : "Mamma and I drove up to<br>McLaren's and to the <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a><br>Changed my book for &quot;<a href=\"https://books.google.ca/books?id=XGslAAAAMAAJ&amp;pg=PR1&amp;lpg=PR1&amp;dq=A+Country+Minister%27s+Love+story++Maria+Bell&amp;source=bl&amp;ots=APy0471K2Q&amp;sig=ACfU3U1CM76v4IoMBDkPKVKVni5ww5WfkQ&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwj5zZDT7q_gAhVNja0KHVY0BXcQ6AEwCHoECAQQAQ#v=onepage&amp;q=A%20Country%20Minister's%20Love%20story%20%20Maria%20Bell&amp;f=false\">A Country<br>Minister's Love story</a>&quot; by<br>Maria Bell.&nbsp; Nell sat down<br>by <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren's</a>. I was skeered.<br>We drove out Martindale<br>way. Got some plums,<br>Went over to Carmans and<br>asked <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanBlanche\">Blanche</a>, <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanSam\">Sam</a> over; but<br>the gentleman had flown.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#AbbottDr\">Dr Abbott</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers#TulleyMrs\">Mrs Tulley</a><br>were down for the last<br>time. Had melons.",
	"1900-09-06" : "<a href=\"/s/ital-iasc-2q90/page/communitymembers/#TulleyMrs\">Mrs Tulley</a> started for New York<br>this morning and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a><br>was going to the Bridge<br>with her. Miss Mabel<br>Groome has started to give<br>lessons to a &quot;limited&quot; number.<br>Eva was here in the afternoon<br>They have a new grammar<br>and geography. Then Eva<br>and her kitten were in after<br>tea. She had me running<br>and playing hide &amp; seek.",
	"1900-09-07" : "Canned tomatoes this morning<br>Very cool to-day. Mamma<br>and I went for a drive<br>We went down to <a href=\"/s/ital-iasc-2q90/page/locations#Frasers\">Fraser's</a><br>to see about our elderberries<br>and someone had stolen all&nbsp;<br>of them. Then we drove to<br>Homer to order Damson plums<br>from Mr Dow [?]. We came up a<br>road I have never been<br>on. Eva was over at night<br>Mr Inksater's little boy is<br>dead.",
	"1900-09-08" : "Took my first music lesson<br>after the holidays. Had<br>to go to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a> after<br>Kullak's Octave Studies, Bal<br>Masque by Jadassohn, Valse by<br>Wrangell. Saw Miss McFarlane<br>She has been away three months<br>Eva was over and she brought<br>some transfer pictures and Jessie<br>Jones &amp; Eva transferred them out on<br>the verandeh [sic]. Rode up to <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren's</a><br>and then I forgot a postcard to<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> and had to go again. Papa<br>&amp; mamma were out to lake. Got our elderberries.",
	"1900-09-09" : "Went to church in morning<br>Mr Perry is back and I guess<br>all are glad. Sermon {2nd} Cor. 1-2<br>Finished the &quot;Country<br>Minister's Love Story. Papa<br>and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr Coy</a> went out for<br>a drive. I went to Sunday<br>School. Had <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChatfieldMrs\">Mrs Chatfield</a><br>Lesson &quot;The Good Samaritan&quot; Luke<br>X, 26 to 37. They gave us some<br>papers &quot;Young People's Weekly&quot;<br>Was in <a href=\"/s/ital-iasc-2q90/page/locations#Lloyds\">Lloyd's</a> as Nellie called<br>me in. Leta is going to Model<br>School to-morrow.",
	"1900-09-10" : "Canned peaches (Mountain<br>Rose) and Mr Dow [?] brought<br>us a basket of the blue<br>Damson plums. Eva brought<br>her scrap-book over. I took<br>some plums over to Carman's<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> was incapitated [sic]. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a><br>was over. Took her with<br>us uptown as we were all<br>ready then she came back<br>with us. She has made&nbsp;<br>a mash of a millionaire. Got<br>&quot;The Trial&quot; by C. Young. I think<br>is is no good.",
	"1900-09-11" : "Canned pears. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt Lillie</a><br>and Uncle Horace arrived<br>about 11.30. Eva had<br>been uptown and got<br>some transfer pictures.<br>Uncle Horace went<br>to the office after<br>dinner to have his teeth<br>fixed. They had an awful<br>storm at Galveston, Texas<br>Saturday between 1000 and<br>10,000 dead{1} and the loss betwen<br>$10,000,000 &amp; $50,000,000. <a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingSidney\">Sydney<br>Bunting's</a> mother died this<br>afternoon about 2 o'clock. I wrote<br>a card to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbotDr\">Dr Abbott</a> and asked<br>him why the setting sun was like a<br>peanut stand.",
	"1900-09-12" : "<a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt Lillie</a> and Uncle Horace<br>were up to the office<br>in the morning Mrs Trusty<br>was here. Had to go over to<br><a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> in the morning. Uncle<br>Horace and Aunt Lillie drove<br>out to the Johnson farm in<br>Grantham Had some<br>old transfers so I finished<br>some this afternoon Pasted<br>them in German grammar like a kid.<br>Had a band concert for children<br>to-night Henry King of Toronto<br>is dead. Eva brought me some walnuts.",
	"1900-09-13" : "<a href=\"/s/ital-iasc-2q90/page/communitymembers/#LillieAunt\">Aunt Lillie</a> was writing off<br>receipts this morning. Tommy<br>and Eva were over. Uncle<br>Horace and Aunt Lillie went<br>to office about 1.30 They wanted<br>to get away on the three o'clock<br>car but couldn't. Mamma &amp;<br>I drove up to the office, and<br>papa took the horse and went<br>to Mrs Wyatt's funeral. Got<br>my music. The two books (Kullak's<br>Bal Masque/and piece &quot;Petite Valse&quot; were<br>$4.15 but I got them for $5.35 Met<br>two <a href=\"/s/ital-iasc-2q90/page/communitymembers#CloyMiss\">Miss Cloys</a>, and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BandCharles\">Mr Charles Band</a>,<br>Uncle Horace and Aunt Lillie went<br>home at five. Mamma got some<br>preserved ginger.",
	"1900-09-14" : "Canned Crawford peaches and<br>mamma made pear chips.<br>Eva, Tom &amp; Leila Smith were over<br>fooling around. Papa went<br>to Beamsville _ Drove and<br>took Dexter along, I rode<br>up to the <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">post</a> and to<br>Hodgins on my wheel.<br>Got a &quot;Puck&quot; book for Eva.<br>H.P. was coming over<br>to-morrow but papa wrote<br>a card saying he would be<br>away.",
	"1900-09-15" : "Took my music lesson.<br>Did not take any of my<br>new music as I have to finish<br>the old. Mr Read played me a<br>solo for a Cantata he is<br>composing. This solo was on the<br>death of Saul and Jonathan. I told<br>him about &quot;The Throne of David&quot;<br>Started Harmony again. Rode uptown<br>and changed my libary book<br>Got &quot;The Tragedy of Wild River<br>Valley&quot; by Martha Findley. I tried to<br>get &quot;When Knighthood was in Flower&quot;.<br>Mr Read told me about it. Mamma<br>was uptown. Mrs Pay has been<br>sick.",
	"1900-09-16" : "Went to church in the<br>morning. Had Mr Perry<br>sermon I Sam XV1-12 verse. Came<br>home with Lizzie. Eva was<br>over before I got dressed. Went<br>to Sunday School in<br>the afternoon. Lesson Luke<br>XII 13 to 23 verses. We did not<br>get our &quot;picture papers&quot; and Mrs<br>Haun went after them. Papa<br>came home about 5 oclock.<br>Brought a basket of grapes.",
	"1900-09-17" : "Very cool to-day. Had to<br>close windows and doors.<br>Canned peaches in the<br>morning and tomatoes<br>in the afternoon I<br>finished my Harmony<br>I started on Saturday<br>very gloomy and&nbsp;<br>depressing at night",
	"1900-09-18" : "Mamma went collecting<br>this afternoon. I went<br>over to Shoe Hospital on<br>James St. to have my old<br>slipper patched. Saw Beatrice.<br>Went to <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> and<br>got &quot;Danesbury House&quot;<br>by Mrs Henry Wod. The<br>catalogue no [number] of it was wrong.<br>Had the last band concert of<br>the season. Played in pavilion<br>and charged admission for a&nbsp;<br>Family Beaver/, <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr Coy</a> came&nbsp;<br>home with papa.",
	"1900-09-19" : "I guess Eva is away as we<br>have not seen her since<br>Sunday. Mamma and I<br>drove on Martindale<br>way to the lake after<br>sand. The apples cover&nbsp;<br>the ground in some places<br>and peach trees broken from<br>the high wind we had<br>last week. Mr Perry<br>called and we were out<br>as usual. Papa has been<br>talking about me going to<br><a href=\"/s/ital-iasc-2q90/page/locations#DemillCollege\">Demill</a>. He had to go uptown<br>to meet Mr Marquis and <a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingSidney\">Sidney</a><br>Bunting.",
	"1900-09-20" : "Nasty gloomy day. Mr<br>McSloy sent papa five<br>trout from Quebec. Had&nbsp;<br>them Tuesday night.<br>They tried to stop the&nbsp;<br>ringing of the 6, 2, 5, &amp; 6<br>bells. Crazy.",
	"1900-09-21" : "Helped dust. In the afternoon<br>we hurried around and<br>went uptown. Mamma went<br>collecting and then went<br>to <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChatfieldMrs\">Mr Chatfield's</a>. I went<br>to the office and watched&nbsp;<br>for her. Nellie Lloyd was<br>in the office. The <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">Collegiate</a><br>games were to-day.<br>Johnson won the race.<br>We were at <a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Anderson's</a> to<br>see the hats. We had<br>two sent down.",
	"1900-09-22" : "Took my music lesson, Mr Read&nbsp;<br>was not there, came a little<br>after eight. Spoke to him of<br><a href=\"/s/ital-iasc-2q90/page/locations#DemillCollege\">Demill</a>. He did not advise it<br>They are painting <a href=\"/s/ital-iasc-2q90/page/locations#StGeorgeChurch\">St. George's<br>Church</a> a canary yellow.<br>Granpa came in morning.<br>Mamma &amp; I were uptown<br>again. Got a hat this time.<br>Grandpa and papa were out<br>hunting. Got four squirrels.<br>Was over to Carman's. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> has<br>been sick",
	"1900-09-23" : "Went to church. Sermon I Sam.<br>XVIII. 5 verse. Grandpa was at<br>the Baptist Church. Papa and&nbsp;<br>Mr Marquis were out for a<br>walk. We are going to<br>have a missionary Sunday<br>in the Sunday School. Had&nbsp;<br>recitations a duett &amp; missionary<br>hymns. Mr Owen from England<br>staying at Mr H. O'Loughlin's<br>spoke to us. He is to preach<br>to-night read the lessons in<br>morning. Miss Elliots 'cousin sang<br>this morning. She had a nice voice<br>Papa &amp; grandpa went to church<br>at night. They were to<br>baptize some people.",
	"1900-09-24" : "Grandpa went uptown<br>in the morning. Then&nbsp;<br>in the afternoon mamma<br>drove him down to <a href=\"/s/ital-iasc-2q90/page/locations#Waites\">Waites</a>.<br>I made him some candy<br>and he went on the<br>5 o'clock car. The Ladies<br>Home Journal came to-day.<br>It has a story entitled &quot;The Story<br>of a Young Man&quot; by Clifford Howard<br>It is a story of Christ. Eva<br>wrote me a letter and I<br>answered it to-night.",
	"1900-09-25" : "Mamma hurried and went<br>over to Mr Rykerts' collecting<br>then she came back<br>and we went for a drive.<br>Took <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book back<br>and got &quot;Postle Farm&quot;&nbsp; by<br>George Ford. Got a bottle of<br>ink. We drove down to Mrs<br>Gray's for little green beans<br>Mrs Milner died yesterday<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#ArcherMrs\">Mrs Archer</a> and her son came<br>down at night She wanted&nbsp;<br>something done to her<br>teeth. Got my harmony done&nbsp;<br>at last",
	"1900-09-26" : "Wash day Annie Trusty was<br>here begging for the<br>Salvation army. I had to<br>take the money to the<br>church. Gave it to Mr Perry.<br>Gave Mrs Trusty my pink<br>waist. Mamma went to<br><a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Miss Anderson's</a>. Got me a&nbsp;<br>&quot;Scribbling Pad&quot;. A hat is&nbsp;<br>going to come to-morrow<br>she picked out.",
	"1900-09-27" : "Mamma hats came this<br>morning, but she decided<br>after dinner not to keep<br>any. We drove up Mary<br>St. and I took them back<br>Then we drove out to<br>Overholt's. Saw Mrs Williams<br>Mrs Overholt was in town.<br>They have a cute little collie<br>pup. Papa went to office<br>them to <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a> to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BlackwellMiss\">Miss<br>Blackwell's</a> recital. Will<br>Thompson played, and<br>Miss Vanderburgh accompanist.",
	"1900-09-28" : "Our old head man came<br>again to-day. Mr Vickers.<br>Mamma &amp; I went for a<br>drive. Drove to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> and<br><a href=\"/s/ital-iasc-2q90/page/locations#Shelleys\">Shelly's</a> then down to<br>Mrs Grays to pay for some<br>green beans we bought.<br>Saw <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> she is much<br>better. &quot;Success&quot; came&nbsp;<br>and it had a good thing<br>in about Canadian boys<br>in American cities. We come<br>from &quot;Frozen north&quot;.",
	"1900-09-29" : "Raining very hard. took<br>my music lesson. Had to<br>have a light it was so<br>dark. Book II of Jadassohn's<br>Op 26. Rita Scott took her<br>lesson after mine. Eva is<br>home. She brought some<br>cards over and she got a&nbsp;<br>fan for dancing the cake-walk.<br>Papa bought a book<br>called &quot;Triumphs and&nbsp;<br>Wonders of the XIX century&quot;",
	"1900-09-30" : "Eva cut a slice out of her finger<br>last night and came in for some<br>courtplaster. Went to church.<br>Sermon Prov XXVIII. 26 verse.<br>Papa drove down Lake st.<br>to the little cottage below<br>railway and got a hound<br>they gave him. Its name is<br>Dewey. Went to Sunday School<br>Had review. Mamma and<br>I were at church at night<br>Sermon Mk. VI. 2 I think Came home<br>with Dwyers.",
	"1900-10-01" : "Had to get up early this<br>morning as papa and<br>mamma are going<br>to Buffalo by 9 o'clock<br>car Did my Harmony.&nbsp;<br>They got home about<br>8 o'clock. Mamma looked<br>for some pictures of musicians<br>but did not get one. She<br>brought me some pretty&nbsp;<br>blue ribbon and white silk<br>tie and a linen hankerchief<br>Got some candy. They saw<br>Dick and had to wait on<br>Yankee side for a car. So they<br>took in the <a href=\"/s/ital-iasc-2q90/page/locations#BuffaloHistoricalMuseum\">museum</a>.",
	"1900-10-02" : "Eva says she is not going<br>to school this afternoon<br>as the whole room is in<br>for a licking. Mamma and<br>I drove down to Trusty's<br>for hops then to <a href=\"/s/ital-iasc-2q90/page/locations#Waites\">Waites</a><br>for peony root. When we<br>came home I dressed went<br>uptown to <a href=\"/s/ital-iasc-2q90/page/locations#Library\">Library</a> and<br>got Attila by G.P.R. James no good<br>And I went to see <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a><br>she was not home when I<br>got there but came later.<br>They have a reception for Dr. Smith &amp; bride<br>to-night.",
	"1900-10-03" : "Very fine and warm<br>Mamma and I drove&nbsp;<br>uptown. Took a trap to&nbsp;<br>papa's office. Papa gave me<br>a $1.00 I got a book<br>&quot;Steadfast&quot; by Rose Terry<br>Cook. Sent for a sample<br>of hair stuff. Then we<br>drove out to Decew Falls<br>for some earth. I caught<br>a frog and got 6 snails<br>Got enough mushrooms for<br>tea. Mr Pay wants mamma&nbsp;<br>to be judge at the fair<br>to-morrow.",
	"1900-10-04" : "Mamma had to go down to<br>the fair at 1 o'clock. Cab called<br>for her. So I had to clear<br>the dinner &amp; c.[?]. Then after&nbsp;<br>I got through I rode<br>uptown to <a href=\"/s/ital-iasc-2q90/page/locations#InksaterBros\">Inksater's</a> as<br>I ordered some cotton on Tuesday<br>and it has not came yet.<br>Miss Muir and her mother<br>called. Mamma said the<br>fair is no good. Got<br>four tickets.",
	"1900-10-05" : "I thought I would rather<br>go to Decew Falls hunting<br>mushrooms than go to<br>the fair so mamma &amp;<br>I went. We got quite a&nbsp;<br>few. It was fun. Coming&nbsp;<br>home we saw some of<br>the prize cattle &amp; horses.<br>Coming from the fair. Saw<br>some red pigs. Eva came over<br>to show me her cards but&nbsp;<br>I was not home. Papa<br>had to go to lodge for&nbsp;<br>a supper and great<br>doings[?] they are to have<br>to-night.",
	"1900-10-06" : "Took my music lesson.<br>Had 1{st} piece Bolero Op 26 Jadassohn<br>for lesson. Mr Read said that it&nbsp;<br>and valse. Op 1 by Wrangell would<br>be good ones for musical.<br>Mrs Overholt was in for<br>a few minutes on her way<br>home. Papa drove to grandpas&nbsp;<br>to-night. Took Dexter. Eva<br>brought me two pieces of<br>music she got at the fair.",
	"1900-10-07" : "Went to church in the&nbsp;<br>morning. Sermon Psalm 51.<br>Staid [sic] to Communion. Eva came<br>over and said she was<br>going to our Sunday<br>School as she went to Jones<br>and she &amp; Jessie came after me.<br>We had a special offering for<br>the expenses of Sunday School.<br>We got $13.51. Pretty good for kids.<br>Poured as we were ready to<br>come home. Nellie Lloyd lent me<br>her heptonette. Met mamma<br>coming after me. <a href=\"/s/ital-iasc-2q90/page/locations#StGeorgeChurch\">St George's</a><br>re-opened to-day. <a href=\"/s/ital-iasc-2q90/page/locations#StBarnabasChurch\">St Barnabas</a><br>had a Harvest Home service",
	"1900-10-08" : "Cooler than it has been.<br>took Nellie's heptonette<br>home. Then I mailed<br>a letter for mamma and<br>started for <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CrawfordMiss\">Miss Crawford's</a>.<br>Met her on Church Street<br>so I turned and came<br>back as far as <a href=\"/s/ital-iasc-2q90/page/locations#AlbertCox\">Cox's</a><br>with her. Came home then<br>went and called&nbsp;<br>on Ethel and Mabel<br>Tucker. Got the free<br>sample of hair stuff",
	"1900-10-09" : "Eva borrowed my gold bracelet<br>yesterday and brought it back<br>at noon.I made some<br>cream candy but it was&nbsp;<br>not as good as the old kind.<br>Papa came home. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt Allie</a><br>sent me seven books and<br>a quilt. Papa shot 3 woodcock<br>and a partridge. Eva had the<br>two little Lawrence girls in<br>here she brought me some<br>&quot;Cracker - Jack&quot;. Papa brought<br>some shekel pears home.<br>Had a sham [?] fight on<br><a href=\"/s/ital-iasc-2q90/page/locations#HainersHill\">Hainer's Hill</a> to-night.",
	"1900-10-10" : "Cool and frosty. Mamma was<br>going uptown so I got&nbsp;<br>ready and went with her.<br>She went to Mrs Sullivan's<br>to see about our clothes.<br>We were at <a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Miss<br>Anderson's</a> and mamma<br>picked out a very<br>pretty hat. I changed<br>the <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book and<br>got 'Mr Faversham's New Years&nbsp;<br>guest&quot;.",
	"1900-10-11" : "Mamma cleaned the little<br>front room to-day. In afternoon<br>mamma went to call on&nbsp;<br>Ms Read who was staying<br>at Dwyer's. She was gone and<br>mamma was in Mrs Pay's<br>for a while. Miss Nora McSloy<br>had a &quot;Book Tea&quot; yesterday.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a> won first prize.<br>I had to go to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> saw<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> and when I came<br>home Eva was here with<br>some popcorn.",
	"1900-10-12" : "Did not practice much<br>to-day. After dinner<br>mamma and I<br>went for a drive. We<br>drove to Sixteen and<br>got a tick and<br>looking glass out of&nbsp;<br>the cottage. Pappa wanted<br>to take them up<br>North with him.<br>Got some very hard<br>apples on the tree by<br>cottage",
	"1900-10-13" : "Took my music IV. of<br>Jadassohn's Op 26. Eva<br>came over and she is going<br>to the Falls. Papa and&nbsp;<br>mamma started right after<br>dinner for the twenty. I<br>washed the dishes and<br>ironed some small things.<br>Mrs Trusty did our washing to-day<br>Then Phoebe and I went<br>uptown. She got a skirt and&nbsp;<br>took Paderewski to have him&nbsp;<br>framed. Eva bought me a Union<br>Jack Hatpin from Falls. Mamma<br>found some lovely apples in the<br>marsh. I made some candy<br>with chocolate in &quot;Fudge&quot;.",
	"1900-10-14" : "I was over to Tucker's last<br>night and asked Mabel to go<br>to church with me. We went&nbsp;<br>Sermon John I. 29 &amp; 30 I think<br>Eva was over and stayed&nbsp;<br>until I came home. Went<br>to Sunday School. Lesson&nbsp;<br>Parable of Great Supper&quot;.<br>Papa was out with Dexter<br>He went to call on Locke Dudley<br>at night. Mamma and I&nbsp;<br>went to church. Sermon Judges<br>XIII. 14 verse. Pays &amp; Dwyers came<br>home with us.",
	"1900-10-15" : "It is a lovely day. When I<br>was waiting for mamma<br>to hitch up I ran across<br>to Woodruff's and got a&nbsp;<br>basketful of walnuts.<br>Ethel Tucker came &amp; helped<br>me get a few. We drove<br>down to <a href=\"http://www.ghosttowns.com/canada/ontario/homer.html\">Homer</a> to have Nell<br>shod. I think we saw Rev.<br>Mr Maloney. Had some grapes<br>We went to Mrs Woodruff's then<br>after some squashes. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a><br>was over to see me.<br>Eva and Tom were over<br>nearly all evening",
	"1900-10-16" : "The <a href=\"/s/ital-iasc-2q90/page/locations#StCatharinesGasWorks\">gas works</a> burned last<br>night. Eva came and told us<br>before breakfast, then she<br>was over after. Turned&nbsp;<br>quite cool. Gave Eva some<br>fans. I took Mrs Carman<br>two cosmos to let her<br>see the size of them. They<br>were painting the kitchen<br>floor bright yellow.<br>Fixed a picture for my<br>room. Hofmann's &quot;Christ in garden&nbsp;<br>of Gethsemane.&quot;",
	"1900-10-17" : "The man came and cleaned<br>the stoves. The sweet&nbsp;<br>potatoes we had last night<br>went for me. Mamma went<br>up to the church. I read<br>&quot;Haran the Hermit&quot; then I<br>got ready and started. Met<br>mamma &amp; Mrs Haun at the&nbsp;<br>corner. We went to<br><a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren's</a> and got goods for&nbsp;<br>my green skirt. Then to<br><a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Miss Anderson's</a>. Got some&nbsp;<br>narrow velvet ribbon for my hair<br>Met Mrs Pay. I got &quot;When Knighthood<br>was in Flower&quot; at <a href=\"/s/ital-iasc-2q90/page/locations#Library\">Library</a>. Went&nbsp;<br>to <a href=\"/s/ital-iasc-2q90/page/locations#MYKeating\">Keating's</a> after my picture.<br>Pays have sold their house and we go<br>there Friday",
	"1900-10-18" : "Thanksgiving. Did not go<br>to church. Had a nice<br>young turkey for dinner.<br>Mamma and I were for<br>a drive in afternoon.<br>We called at Mr Ross' to<br>have him clean windows.<br>Mamma went to Mrs<br>Sullivan's. We drove out<br>Geneva Street and came<br>home Lake street.",
	"1900-10-19" : "Cooler to-day. Papa ate<br>some herring last night<br>and does not feel well<br>to-day. Mamma went<br>uptown right after<br>dinner and I washed<br>dishes. She came home<br>and went to Mrs Sullivan's<br>again. Will Marquis was&nbsp;<br>here to see papa. Mamma and&nbsp;<br>I went to Pay's at night. Mrs Pay<br>is having all the club in as<br>she has sold their house. The<br>two Misses Taylor were there.<br>Mrs McGhie won ladies prize<br>and Mr Dwyer's gentlemans<br>Had distribution of prizes at <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">Collegiate</a>.",
	"1900-10-20" : "Took my music lesson. Have<br>VI Jadassohn. Mr Read wanted to know<br>whether I sang as it would be benefical [sic]<br>to go to the oratorio rehersal he is<br>going to have at <a href=\"/s/ital-iasc-2q90/page/locations#DemillCollege\">Demill</a>. Have to get<br>three pieces, but I think I have one<br>so I came home, then went back<br>to <a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a>. Got &quot;Valse Chromatique by Leschetizky<br>&amp; Passepied from Le Roi s'amuse by Delibes.<br>Mrs J. Overholt came in to see us&nbsp;<br>and Mr Overholt came after her. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a><br>brought us some pears. Had to go to<br><a href=\"/s/ital-iasc-2q90/page/locations#AMeyerCoLtd\">Myers</a> so I went to see Leta. I saw<br>her this morning &amp; she wanted me to come.",
	"1900-10-21" : "Very warm. Went to church<br>St. John I. 57. I came home with<br>Beatrice. Walked down to Macdonald's<br>with her. Frank Coy has typhoid.<br>Papa let Dewey loose and he<br>ran for home but papa caught<br>him. Papa &amp; mamma went for a&nbsp;<br>drive and I went to Sunday<br>School. Lesson &quot;Parable of Lost Sheep<br>and Lost Corn&quot;. Papa found some<br>lovely mushrooms around<br>Decew Falls.",
	"1900-10-22" : "Very warm. Mamma cleaned<br>their bedroom. We went&nbsp;<br>for a drive in the<br>afternoon. Drove up to Mrs<br>Sullivan's. She measured me<br>for my green skirt. It is to<br>be 41 inches in front &amp; 42 in back.<br>Went to office after balm<br>and some certificates of&nbsp;<br>papa's. He went to Falls&nbsp;<br>on 7 o'clock trolley to get<br>his license. Saw Mrs<br>Pay.",
	"1900-10-23" : "Eva came over in the morning.<br>Her uncle is very sick.<br>Did my Harmony. Eva brought&nbsp;<br>her cousin over. Mamma<br>had to go to the office<br>to have her teeth<br>fixed. Papa got the October<br>&quot;Wide World&quot; Magazine.<br>Eva was her [sic] for tea and&nbsp;<br>is going to stay here all<br>night. Her cousin is going&nbsp;<br>to stay at Carmans.",
	"1900-10-24" : "Eva staid [sic] all night. We put her<br>in the spare room but she came<br>and slept with me. They took<br>her uncle away this morning<br>Ethel came after her and she had<br>to go to school. Mamma went<br>to Mrs Sullivan's and she<br>was not ready. She won't be ready<br>for me to-morrow. Phoebe is&nbsp;<br>going to have <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleMiss\">Miss Boyle</a> make her<br>skirt. Papa went to see<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingSidney\">Mr Sidney Bunting</a> at<br>night.",
	"1900-10-25" : "The weather is fine. Got &quot;The&nbsp;<br>Ladies Home Journal&quot; and &quot;Success&quot;.<br>Mamma and I drove uptown. Went<br>to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BiggarMiss\">Miss Biggar</a> after a lily, then<br>to Mrs Sullivan's. I went to<br><a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a> &amp; got my two pieces<br>Passepeid by Delibes &amp; Valse<br>Chromatique by Leschetizky We&nbsp;<br>drove down to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BruceMr\">Mr Bruce's</a><br>to see if he could keep<br>Nellie this winter, but&nbsp;<br>he can't as the barns are [xxx]<br>on the place he is going to",
	"1900-10-26" : "My room was cleaned this<br>morning. I had to go to Mrs<br>Sullivan's and she can't do&nbsp;<br>my skirt this week. Phoebe<br>is having a skirt made at<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleMiss\">Miss Boyle's</a>. We went for&nbsp;<br>a drive. Intended going<br>around Grange Hall way but<br>it looked like rain so we<br>came through Port. Papa went<br>to the Falls withh Mr<br>Marquis to-night.",
	"1900-10-27" : "Mrs Trusty came to iron. Took<br>my lesson. Took &quot;Passepied&quot;<br>and am to start &quot;Murmuring<br>Zephyrs&quot; by Jensen. Papa got<br>two nice baskets of apples<br>of an old man. Eva was<br>over to show us some<br>silver hearts she got. I went&nbsp;<br>uptown met <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> and went<br>with her to Stamp Store. She&nbsp;<br>lent me a &quot;Foregone Conclusion&quot;<br>by W. D. Howells. Mamma<br>came over as I was there to<br>get her belt [?] but <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BiggarMiss\">Miss Biggar</a><br>did not come. We went over<br>on racecourse to see how the&nbsp;<br>railway was progressing.",
	"1900-10-28" : "Eva was over with a new dress<br>on. Went to church. Had Rev.<br>Helier [?] Hamilton of Japan. Sermon<br>St Matt. I. 21 were. Two young<br>gentleman sat in our seat.<br>Papa and mamma went for<br>a drive. I went to Sunday School.<br>We had <a href=\"/s/ital-iasc-2q90/page/communitymembers#CleghornMiss\">Miss Cleghorn</a> for teacher.<br>Mr Hamilton spoke to us. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a><br>brought the bulbs over.<br>Papa &amp; mamma were at Overholt's<br>Mr Overholt is sick. Papa got<br>some chestnuts.",
	"1900-10-29" : "Papa went away this morning<br>for Muskoka. Took Dewey<br>with him. Mamma cleaned<br>Phoebe room. [???] Then in&nbsp;<br>afternoon we drove to Homer<br>to see if Mr Wilson knew<br>anything about Mr Pringle<br>who keeps horses there.<br>We came home Queenston<br>Street but did not meet any<br>cars. Mrs Keating died Saturday<br>and was buried this<br>morning.",
	"1900-10-30" : "Very rainy and gloomy.<br>Cleaned Papa's room<br>and the hall. Mamma<br>had to go uptown in<br>the rain. Mrs Sullivan wanted<br>me instead of mamma. A<br>Mr Lee killed and himself<br>this morning. He lived on<br>Court and Centre St. There is a<br>lecture in the church on<br>Japan. Could not go for this rain.<br>Pansy caught a large<br>rat.",
	"1900-10-31" : "I went up to <a href=\"/s/ital-iasc-2q90/page/locations#Smiths\">Smith's</a> for<br>meat their to Mrs Sullivan's<br>She had the <span title=&quot;A strip of fabric attached at one edge.\">flounce cut out.<br>Got a book out of <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a><br>&quot;My Musical Experiences&quot;<br>by B. Walker I enjoyed<br>it. Wrote a letter to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt<br>allie</a>. Mamma went to the&nbsp;<br>Church as it is annual<br>meeting of Ladies Aid. They<br>have made about $225 this<br>year. Not bad. Eva and Tom<br>came in with very pretty<br>falsefaces on. Then after<br>Jessie Jones and the two came<br>again. Eva had some taffy.</span>",
	"1900-11-01" : "I went up to the <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">post</a> to<br>mail some letters and<br>papers for papa as it<br>was so rainy we couldnt<br>go yesterday. Cleaned the&nbsp;<br>parlor. Then mamma<br>and I painted the kitchen<br>floor with first coat. Borrowed<br>some boards from Mrs<br>Carman. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanTom\">Tom</a> was in and<br>wanted to paint, but we&nbsp;<br>did not let him.",
	"1900-11-02" : "Mamma cleaned the halls.<br>I fixed some blue velvet<br>ribbon for a tie. Miss<br>Seymour was here collecting<br>for the Bible Society.<br>Mamma and I went&nbsp;<br>uptown. Frank Coy is<br>much better. Had a card from<br>papa. Anna Lloyd appealed<br>and she did not get it<br>so she has to go down<br>stairs again with the<br>kids. Mrs Pay took us<br>through her house.",
	"1900-11-03" : "Took my music lesson.<br>Was to Mrs Sullivan's and<br>to Hodgin's for chickens.<br>Cleaned my fish and Eva<br>brought some candy she<br>made. Mamma and I put<br>on the second coat of paint<br>to kitchen floor. Was up to<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleMiss\">Miss Boyles</a> to see about<br>making me a waist. Got a&nbsp;<br>programme of the Strauss<br>concert in <a href=\"/s/ital-iasc-2q90/page/locations#MYKeating\">Keating's</a>. Got my<br>green skirt to-night.",
	"1900-11-04" : "Eva was over and borowed<br>two books. Went to church.<br>Sermon St. John IV. 50 verse<br>Mamma bought some candy<br>yesterday. Went to Sunday<br>School. Lesson &quot;The Unjust<br>Steward&quot;. Had <a href=\"/s/ital-iasc-2q90/page/communitymembers#CleghornMiss\">Miss Cleghorn</a>.<br>Came down Church St with<br>Winnie Rolls. Caught up to<br>Tommy and he came home<br>with me. Mamma and I were at<br>church in evening. Mr Perry<br>is starting a series of sermons.<br>St. Matt V. The congregational<br>social is to be on the 18{th}",
	"1900-11-05" : "Cleaned the sitting room this<br>morning. Washed some of the&nbsp;<br>little things. Did not get<br>through until nearly four<br>o clock. Then mamma went<br>uptown. While she was gone<br>an awful wind came up and<br>I brought my fish in the<br>house. She borowed a umbrella<br>of Mr Kane. Got a sample picture<br>from <a href=\"/s/ital-iasc-2q90/page/locations#PerryCo\">Perry Co.</a> Malden, Mass.",
	"1900-11-06" : "Cleaned the dining room. <a href=\"/s/ital-iasc-2q90/page/locations#ChaplinSawWorks\">Chaplain's<br>saw works</a> were burned this<br>morning. I went uptown the&nbsp;<br>afternoon. Ordered some oats<br>and meat. Was to <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">post</a> and office<br>Mr Wilson cheated me out of<br>3 cents he said cocanut wafers<br>were 15 instead of 12{c} a lb. Met<br>Helen as I was coming home<br>and went back uptown<br>with her. We saw the fire.<br>Mrs Chatfeld called. I got a good<br>book out of the <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> &quot;Edith<br>Vernon's Life Work&quot;. The Strauss<br>concert was to-night in the<br><a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a>.",
	"1900-11-07" : "Wash day. Rainy and<br>disagreeable. Mamma went<br>uptown to the <a href=\"/s/ital-iasc-2q90/page/locations#PostOffice\">post</a> in<br>the afternoon. Eva and<br>Tom were over at night<br>and Eva takes her first<br>music lesson to-morrow<br>of Miss Holden. Election day<br>to-day. Hurrah for Gibson.<br>Sir Wilfrid Laurier was here<br>Monday afternoon at the <a href=\"/s/ital-iasc-2q90/page/locations#WellandDepot\">Welland&nbsp;<br>Depot</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers#CartwrightRichard\">Sir Richard Cartwright</a><br>at the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a> in the<br>evening",
	"1900-11-08" : "Lancaster is elected but we<br>don't care. Laurier is in and<br>the Grits have the whole<br>show. I went uptown after<br>the papers &amp;c[?}. Got mamma's<br>silver teapot. Maybee [sic] fixed it[?]<br>My: how it did rain. The&nbsp;<br>Corticelli book came. Got two<br>cards from papa. Frank and&nbsp;<br>he have not got a deer yet.<br>Mr Joseph Murphy is at the&nbsp;<br><a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a> to-night in<br>&quot;Shaun Rhue&quot;.",
	"1900-11-09" : "Very cold and snowy.<br>Mamma cleaned the<br>woodshed. I started to read<br>&quot;Vanity Fair&quot; by Thackeray.<br>Was uptown to-day.<br>Ordered chickens. Got another<br>card from papa. He and Frank<br>have one deer a piece and<br>expect to get their two.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie Coy</a> came after the<br>quinges[?]. Got a book describing<br>the play &quot;Way down East&quot; which<br>is to be here Monday night. We<br>have missed the good ones.",
	"1900-11-10" : "Took my lesson. After I went<br>to the office with a telegram<br>for Dick. Had to take it<br>myself as Sid was not there<br>yet. Cleaned my fish. Eva brought<br>me some taffy she made.<br>Then mamma and I went<br>uptown afternoon I got<br>enough red goods for a waist<br>Went to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleMiss\">Miss Boyle's</a> and had<br>my measure taken. I ordered<br>three pieces. I love thee by<br>Grieg, Harlequin by H. N. Bartlett<br>and La Papillon. Etude de<br>Concert by C. Lavallee. Got a<br>catalogue from Kent's. Mr Read<br>showed me some of <a href=\"/s/ital-iasc-2q90/page/communitymembers#CampbellRobert\">R. Campbell's</a> sketches.",
	"1900-11-11" : "Got ready for church but it<br>looked rainy and I did<br>not go. I was picking out<br>a ring I would like.<br>Have been reading &quot;Vanity<br>Fair&quot;. Went to Sunday School.<br>Had <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChatfieldMrs\">Mrs Chatfield</a>. There<br>is a social of the Y.P.A.<br>on Wednesday and the<br>congregational social os<br>Friday night.",
	"1900-11-12" : "Mamma cleaned the pantry<br>and got the plants in<br>We went uptown in&nbsp;<br>the afternoon. I had to<br>go to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleMiss\">Miss Boyles</a> to have<br>my waist fit. Miss Nelson<br>has a lot of pretty paintings.<br>We were at Madame&nbsp;<br>Sullivans about mammas<br>skirt and she had forgotten<br>about it. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BuckeleyMiss\">Miss Buckeley</a> is<br>dead. Died yesterday afternoon.<br>Fern Healey came down at<br>night to tell me Mr Perry<br>had elected me on the Music<br>Committee of the Y. P. A. and<br>I have to go Wednesday.",
	"1900-11-13" : "The first good snowstorm<br>of the season. Mr Lee<br>brought a basket of<br>Baldwin apples. Snow<br>turned to rain. Wrote to<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CowieBessie\">Bessie Cowie</a>. Was going<br>after the papers, but it<br>was too bad. &quot;Way Down<br>East&quot; last night was<br>not very good. Mamma is<br>making us some Battenburg<br>ends for ties.",
	"1900-11-14" : "About 2 o'clock Uncle Freeman<br>came in as he had been&nbsp;<br>to Port for sand. We<br>were waiting dinner for<br>papa, as he is coming<br>home. Came with his<br>deer. The one is a fine<br>buck. I went uptown<br>after the papers and<br>mail. Had dinner so<br>late we did not have<br>any tea. Then Mamma<br>went with me to the<br>Church. Mr Perry wants<br>Beatrice and I to play Friday night<br>We just had business tonight<br>about the reception.",
	"1900-11-15" : "Papa went to the office<br>in the morning then<br>came home early in<br>the afternoon as Frank<br>Overholt was coming to<br>help him skin the deer.<br>Papa got the picture of the&nbsp;<br>twins. I was uptown to<br><a href=\"/s/ital-iasc-2q90/page/locations#Eckhardts\">Eckhardt's</a>. Did not get<br>what I was after. Had<br>my waist tried on. Wrote<br>out papa's diary to-night.",
	"1900-11-16" : "I got a book in the&nbsp;<br><a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> yesterday &quot;A Strange<br>Temptation&quot; by Mrs Spender.<br>Mamma went uptown<br>in the afternoon for&nbsp;<br>some cake and to see if<br>they wanted her to help at&nbsp;<br>the church. Papa went with&nbsp;<br>mamma &amp; I then came<br>back later. I was talking<br>with Eloise Hamilton then I got<br>with Grace &amp; Mayde Greenwood, <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a> &amp;<br>Mallie, &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#ElliotBessie\">Bessie Elliot</a>. Mr Skey &amp;<br>Mr Lane gave speeches and<br>Beatrice &amp; I played. Had a very<br>good time. I have to play on<br>Wednesday.",
	"1900-11-17" : "Miss McFarlane brought my<br>music last night. Took my<br>lesson. Took &quot;Harlequin&quot; by<br>H. N. Bartlett for my lesson.<br>Have the first chorale in<br>Harmony for next week. Went<br>to Dwyer's to ask Beatrice to<br>play. Saw their new dog &amp; cats.<br>Got ten pictures from the<br>Perry Pictures last night. Have a<br>cold. Went and had my<br>waist tried on. She will not<br>have it done until Monday.",
	"1900-11-18" : "Eva was in as usual on<br>Sunday morning. Had her hair<br>all frizzed. She is going to get<br>2 dozen scarfpins to sell and<br>get a watch. Went to<br>church. Sermon Gen.&nbsp; 25. 27 verse.<br>Instead of having a Friday<br>evening service they are<br>going to have a Bible<br>class. Papa went down<br>to the old Maris[?] who let<br>him have Dewey with<br>a piece of venison. Did not<br>go to Sunday School. Mamma<br>has a bad cold.",
	"1900-11-19" : "Very gloomy and rainy<br>all day. Mr J. P. Merritt<br>died yesterday afternoon<br>about 6.30. Have been<br>harmonizing &quot;God Save the<br>Queen&quot; in Soprano and do it<br>in Tenor to-morrow.<br>about 5 o'clock I took<br>some venison in to<br>Tucker's",
	"1900-11-20" : "Rainy again I wish we<br>could see the sun once<br>more. My cold is worse<br>to-day. In the afternoon<br>Eva came in then went<br>home again &amp; I was dressing<br>and she came upstairs with<br>my Christmas present; a<br>mother of pearl mudturtle brooch[?].<br>I went to Pays, Dwyers,<br>and Hodgetts with venison,<br>and to <a href=\"/s/ital-iasc-2q90/page/locations#AMeyerCoLtd\">Myer's</a> after molasses.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#ReadBessie\">Bessie Read's</a> father died<br>yesterday. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr</a> and <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> and<br>Sidney were over at night. A meeting<br>of the active members of the<br>Musical Circle was held at Miss Vanderburghs'<br>to-night, but I did not go.",
	"1900-11-21" : "Mrs James Keyes called on<br>mamma &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> yesterday<br>morning. Mrs Trusty is here.<br>Eva brought Phoebe a<br>Christmas a [sic] spoon. She is<br>selling pins to get a watch. Papa<br>took one. Beatrice came after<br>me at night. I played &quot;Valse<br>Arabesque&quot; by Lack. Mine was the<br>first on the programme. Miss Prior<br>sang &quot;Tit for Tat&quot; and Beatrice played.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BatesMiss\">Miss Bates</a> gave a recitation. Fern<br>Healey, Roy Gobb &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BradleyMr\">Mr Bradley</a> gave<br>speeches.",
	"1900-11-22" : "My cold is worse than ever.<br>Have a cold in my head<br>Eva came over at night and<br>gave mamma a diamond<br>pin and papa a catseye for<br>a ring. &quot;The Christian&quot; Hall<br>Caine's book is coming to the<br><a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a> next Wednesday.<br>Mrs Vale on Queen St. is<br>dead. She was 90 yrs. old.<br>Rainy at night.",
	"1900-11-23" : "This morning I went uptown<br>after my pins and to<br>change my <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book.<br>Got &quot;Leofwine the Monk&quot;.<br>Very nice day. Mamma<br>went uptown in the<br>afternoon. <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren's</a> and<br><a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Anderson's</a> have their Christmas<br>things in. The <a href=\"/s/ital-iasc-2q90/page/locations#CollegiateInstitute\">Collegiate</a> Cadets<br>have a concert to-night. Miss<br>Murray is to sing, Miss McCallum<br>recite and the flag is to be<br>presented to the cadets.",
	"1900-11-24" : "Took my music lesson.<br>Mr Read was not there. He<br>stays at the college nights.<br>I have to harmonize &quot;As pants<br>the Hart&quot; in Soprano &amp; Bass.<br>Eva brought the two little<br>Riley girls in this morning.<br>Leta came over in the<br>afternoon, and I went uptown<br>and home with her. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BogardusLottie\">Lottie<br>Bogardus</a> was there. Mrs<br>Kellogg and Miss Kottmeier<br>were down in the<br>afternoon.",
	"1900-11-25" : "Eva was in this morning. Papa<br>put the deer tails on her<br>cap. Lent her two books &quot;The<br>Wide Wide World&quot; &amp; &quot;Bhelma&quot;. Did<br>not go out all day,<br>as they were afraid I<br>would catch more cold.<br>Snowy out. Read &quot;John<br>Marmaduke&quot; by Samuel<br>Harden Church. Finished Leofwine<br>the Monk&quot; Mabel lent papa<br>the other book. It is a<br><a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book.",
	"1900-11-26" : "Very stormy to-day. It<br>commenced with rain and<br>then snow very heavy.<br>We got the Ladies' Home<br>Journal for December &amp; Collier's<br>Weekly to-day. Sir Arthur<br>Sullivan died last week.<br>Have not much to say<br>as the weather is so<br>bad.",
	"1900-11-27" : "Muddy to-day Mrs O'Loughlin<br>called on mamma. I was<br>over to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a> and coming<br>home, I saw Eva. She has<br>her pins. These are prettier<br>than the others.<br>Mamma was over to<br>Carman's. &quot;The Wide Wide<br>World&quot; and &quot;Success&quot; came<br>to-night. Finished my<br>harmony. Franck Overholt<br>gave papa six quail.",
	"1900-11-28" : "Helped mamma. Picked all<br>the quail, and chopped suet<br>raisins, &amp; citron. Mamma made<br>a cake for the church. She<br>went up to the Auxiliary<br>&amp; Ladies Aid so she took it<br>up. Came after our crokinole<br>board. Papa went as far as<br>the church with me. Had games<br>crokinole, Jenkin's up. Parcheesi &amp; c.<br>Had quite a time finding my<br>crokinole men. Mr Roy Grobb [?]<br>was coming but he asked me<br>first. The &quot;Christian&quot; was<br>in the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a> to-night.",
	"1900-11-29" : "A colored german came about<br>our kitchen stove. The things<br>were wrong. So they have<br>to send to the factory again<br>Mamma got a letter from<br>Mamie yesterday &amp; Mr<br>Zimmerman was here for dinner.<br>Took Dudleys umbrella<br>home and went to <a href=\"/s/ital-iasc-2q90/page/locations#Lees\">Lee's</a>.<br>Miss Bird died yesterday<br>morning.",
	"1900-11-30" : "Started to read &quot;Home Influence&quot;<br>by Grace Aguilar when mamma<br>was sweeping. Mamma<br>went to the church to<br>help quilt. Eva and<br>Tom were in. Eva<br>wants me to make two<br>wishbone penwipers.<br>Papa went to St.<br>Andrew's supper to-night.<br>Mr Macgregor invited<br>him.",
	"1900-12-01" : "Took my music lesson.<br>When I went Mr. Read was<br>standing outside pounding<br>the door and we had to<br>wait for about five minutes.<br>Have &ldquo;Valse Chromatique&rdquo; by Leschitzky.<br>Fixed Eva&rsquo;s penwipers. Then<br>I called for Beatrice to go uptown<br>but she had to go to the <a href=\"/s/ital-iasc-2q90/page/locations#DennysonClub\">Dennyson<br>club</a>. Got a <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book &lsquo;Letters on<br>Music&rsquo; by Ehlert. Bought Eva&rsquo;s Christmas<br>present &ldquo;The Twentieth Door, by Sheldon.<br>Beatrice &amp; I were in to Henderson&rsquo;s<br>May ran a needle in her foot.",
	"1900-12-02" : "Eva was in to show her new<br>furs. Went to church.<br>Sermon XII, 11 verse. A young man<br>sat in our seat. Eva was over<br>again with a new hat. Then<br>I went to Sunday School,<br>The lesson was on the<br>&ldquo;Rich Young Ruler, Matt 19. Did not<br>go out at night. We have<br>new lesson leaflets.<br>Have pictures on the lesson,<br>and a short story Road<br>&ldquo;The Twentieth Door &amp; Letters for<br>Music.",
	"1900-12-03" : "A lovely day. Mamma and<br>I went uptown in the<br>afternoon to see about<br>a new hat for me. Had<br>a whale grebe [?] &amp; some green<br>velvet for it. Got some silk<br>for ties. Went over to <a href=\"/s/ital-iasc-2q90/page/locations#AMeyerCoLtd\">Myer&rsquo;s</a><br>&amp; mamma went to Mrs<br>Pays. Saw Mrs Dudley<br>stopped in Pays for mamma.<br>Got &ldquo;Dr Glenner&rsquo;s[?] Daughter&rdquo;<br>out of the <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a>.",
	"1900-12-04" : "Raining again Papa got the<br>Christmas Globe last night<br>and the new book by<br>Marie Corelli &ldquo;The Master<br>Christian&rdquo;. The Globe has<br>one very pretty water color<br>sketch. Got the letter<br>ready to night to send<br>for a year&rsquo;s subscription<br>to the &ldquo;Etude&rdquo;. My<br>tie ends are finished.<br>The Band has a concert<br>assisted by Harold Jarvis<br>in the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a>.",
	"1900-12-05" : "Mamma went up to the<br>church to help quilt.<br>Then at night I got<br>ready and was to meet<br>Beatrice at Pay&rsquo;s. Ida Ross<br>was with them. A little<br>kitten followed us in the<br>church. Mrs Perry took it home.<br>Molly Phelps &amp; Nora McClelland played Mabel<br>Greenwood sang. The debate was, &ldquo;Slate<br>Support in higher education is not<br>beneficial to Canada.&rdquo; The affirmative<br>were Mr Prior, Fern Healey &amp; the negative<br>Mr. Richards &amp; Roy Grabb; the negative won.",
	"1900-12-06" : "Eva is sick and came over this<br>morning, I was ready to go<br>uptown. Eva came over and<br>went with me. She bought<br>a rose for me at <a href=\"/s/ital-iasc-2q90/page/locations#NWhitingAndSons\">Mr Whiting&rsquo;s</a><br>and the old thing broke off<br>about ten minutes after. Was<br>to <a href=\"/s/ital-iasc-2q90/page/locations#MissesAnderson\">Miss Andersons</a> to try on<br>my hat. It looks swell.<br>Eva bought her mother a<br>calendar and then went to the<br>church to practice. I called into<br>Chapman&rsquo;s to see if <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChapmanGenevra\">Genevra</a> would<br>sing next Wednesday night as<br>I have change of the programme<br>then called at <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie&rsquo;s</a> &amp; she was<br>out so I was disappointed all around.&nbsp;",
	"1900-12-07" : "Cleaned my bicycle and papa&rsquo;s.<br>The spokes were all rusty<br>Practiced all afternoon.<br>Then when papa came<br>home at night he asked<br>mamma and I whether we<br>would like to go &amp; hear<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BarrieDr\">Dr Barrie</a> who has just<br>returned from South Africa.<br>So we went. The meeting<br>was held in the <a href=\"/s/ital-iasc-2q90/page/locations#FirstPresbyterianChurch\">First<br>Presbyterian Church</a>. Christened<br>my new hat.",
	"1900-12-08" : "Took my lessons this<br>morning. Have &ldquo;Papillion [sic]&rdquo; by<br>Lavallee for next day. He told<br>me my rhythm was much<br>better than it used to be.<br>Got <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a> to play for me<br>next Wednesday night. She<br>has a dear little kitten.<br>We have two ducks, spareribs &amp;<br>sausage. I think we will have<br>enough to eat. Mamma &amp; I were<br>uptown in afternoon. I bought<br>a rubber doll &amp; horse for the<br>Dorsey children. Collin&rsquo;s Weekly<br>is illustrated very nicely<br>with colored pictures this week.",
	"1900-12-09" : "This is our anniversary<br>Sunday. We had Rev. Arthur<br>Murphy. His sermon in the<br>morning was on Heaven John 3-13<br>Eva was in. Went to Sunday School<br>Mr Murphy addressed us. Song of<br>Solomon II 15. The girls are talking<br>of giving Mrs Haun a<br>Christmas present. Papa, mamma<br>&amp; I were out at night. Sermon&rsquo;<br>God&rsquo;s Love II Samuel IX. 3 verse. I am<br>reading &ldquo;Home Influence&rdquo; by<br>Grace Aguilar.",
	"1900-12-10" : "In the afternoon I went<br>uptown to change two<br>presents I got on Saturday<br>for Phoebe. They did not<br>suit. Then I went to the<br><a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> and got the<br>&ldquo;Etude&rdquo; from Jany [sic] to June<br>1900. Mamma was out<br>calling. Called on Mrs<br>Dwyer, Dudley, McLean. Mrs Dwyer<br>is going to have the club<br>Thursday night as Percy &nbsp;<br>is coming home to-night.",
	"1900-12-11" : "Did not do much all day.<br>Had quite a small snow<br>blizzard in the<br>afternoon. Then at night<br>mamma and I went<br>to the Musical. Its first<br>meeting for the year.<br>Mrs Williams is Editor in<br>place of <a href=\"/s/ital-iasc-2q90/page/communitymembers#BurrellMr\">Mr Burrell</a>. The<br>first piece was nice &ldquo;Morsica&rdquo;<br>by Oliver King, the second was<br>better. Improvisata by Reinecke.<br>Mrs Marquis &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChaplinMiss\">Mrs Chaplin</a> played the 1{st}<br>&amp; Miss Paterson &amp; Miss Chaplin the 2{nd}.",
	"1900-12-12" : "Mamma had to go to the<br>church in the afternoon to<br>keep quiet. She was in<br>to <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren</a> about a set of<br>dishes. When papa came<br>home to supper he had<br>a letter from <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a> saying<br>she cannot play. So I have to.<br>Papa went with me. Kate<br>Sutton played a valse &amp; I played<br>Bolero by Jadassohn. Mr McIntyre<br>gave a fine lecture on his<br>trip. Then I played, &ldquo;God Save the Queen&rdquo;.<br>I got a little mixed on it. Papa<br>&amp; I had to go home with Miss<br>McGibbon. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> was over at night.",
	"1900-12-13" : "Was in the house all day.<br>Kate Sutton &amp; I got a little<br>puff in the Journal. Papa,<br>mamma &amp; I went over to<br>Dwyer&rsquo;s at night. All the<br>old Club were there. Mr<br>Pay was late. I nearly got<br>the prize. Mrs Macgregor<br>won it. A little cream &amp; sugar<br>Mr Notinau [?] won the gentleman&rsquo;s<br>&amp; Mrs Notinau[?] the booby[?] a calendar<br>&amp; candy roaster. I helped with<br>the eatables. Bertha Read was<br>there.",
	"1900-12-14" : "Eva was in at noon and<br>she has her watch. A very<br>nice little nickel one.<br>She had her pictures taken<br>and brought me one.<br>Mamma had to go to<br>the church to quilt.<br>Am reading the &ldquo;Etude&rdquo;<br>now.",
	"1900-12-15" : "Mr. Read was not at <a href=\"/s/ital-iasc-2q90/page/communitymembers#CampbellMrs\">Mrs Campbell&rsquo;s</a><br>when I got there so little <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarpenterLloyd\">Lloyd<br>Carpenter</a> played me a piece and<br>said &ldquo;That is my lesson&ldquo; Took my<br>lesson. They have started a Musical<br>in Port. Got the &ldquo;Etude&rdquo; to-day.<br>Like it very much. It is a Wagner<br>number. Went uptown. Bought<br>a calendar for Lizzie. Got some<br>grey matting for my little pictures<br>of musicians. Bought mamma&rsquo;s<br>present a little oak tabourette.<br>Got the matting ready for the pictures",
	"1900-12-16" : "Went to church in the morning.<br>Sermon on Gen XXV. 31 verse. Came<br>down Queen Street with<br>Beatrice, Eva brought my<br>book home. Was at Sunday<br>School. Lesson &quot;Zacchaeus, the<br>Publican&quot;. All the Bible class<br>staid [sic] after Sunday School<br>to see about Mrs Haun's<br>present. We only have $2.50<br>and <a href=\"/s/ital-iasc-2q90/page/communitymembers#RollsWinnie\">Winnie Rolls</a>, Miss<br>Francis and I have to<br>go to morrow and<br>pick it out.",
	"1900-12-17" : "Finished my pictures I was<br>fixing of musicians. At 3.30<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#RollsWinnie\">Winnie Rolls</a> and Miss<br>Francis called for me as we<br>have to pick out Mrs Haun&rsquo;s<br>present. We were to see Miss<br>Keyes then went around to<br><a href=\"/s/ital-iasc-2q90/page/locations#RidleyCollege\">Ridley</a> &amp; got a quarter out of<br>Mrs Smith. We got an ebony<br>brush &amp; comb &amp; imitation ebony<br>mirror. It cost $3.00. Got some<br>blue ribbon for my<br>pictures.",
	"1900-12-18" : "Mild out to-day. Finished<br>my harmony I got another<br>picture I want mounted<br>a landscape. Mamma<br>went uptown. Sent some<br>money with her to get some<br>stuff for a bag for <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt Allie</a> &amp;<br>a gray &amp; green mat. I mounted<br>both pictures at night.<br>Papa went to <a href=\"/s/ital-iasc-2q90/page/communitymembers#BuntingSidney\">Sid<br>Bunting&rsquo;s</a> to-night. Mrs<br>Kennedy of St. Louis<br>died yesterday. <a href=\"/s/ital-iasc-2q90/page/locations#DemillCollege\">Demill<br>College</a> had its closing<br>exercises to-night.",
	"1900-12-19" : "Got our new set of dishes<br>from <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren&rsquo;s</a> so mamma<br>&amp; I had a washing time<br>all morning Mrs Trusty is<br>here. Mamma went uptown<br>by herself this afternoon.<br>I went over to Coy&rsquo;s to see<br>if <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMattie\">Mattie</a> would sing next<br>Wednesday then I went to<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie&rsquo;s</a>. I got her to play all<br>right. She is going to get a<br>new fur coat from everybody.",
	"1900-12-20" : "Yesterday morning I fixed a<br>picture of Pharoah&rsquo;s [sic] horses on<br>a piece of gray mat I had<br>left. We are making fruit<br>cake. Eva come in early<br>this morning with her<br>eyes as large as saucers<br>said &ldquo;I have bad new&rdquo;<br>The next door neighbors<br>have diptheria [sic]. Dr O&rsquo;Glynn<br>and Sidney were here<br>for tea. They played<br><a title=&quot;card game\">King Pedro</a> after.",
	"1900-12-21" : "Mamma is not feeling well to-day<br>Mrs Trusty came in the<br>afternoon to iron. Mamma &amp;<br>I went uptown. Mamma got<br>Eva a silver bean for her<br>bracelet &amp; we got a little<br>strawberry cream pitcher for<br>Annie Trusty. I bought papa<br>a Fountain pen, at Fairfield&rsquo;s.<br>There is a confirmation in<br><a href=\"/s/ital-iasc-2q90/page/locations#StGeorgeChurch\">St. George&rsquo;s</a> to-night. Miss<br>McLaren &amp; Mrs Moore have a<br>ball to-night.",
	"1900-12-22" : "Took my lesson. Have &ldquo;Ich liebe<br>dich&rdquo; for two weeks from<br>to-day as I don&rsquo;t have to take a<br>lesson next week. A lovely<br>day. Called in Coy&rsquo;s. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMattie\">Mattie</a><br>cannot sing. <a href=\"/s/ital-iasc-2q90/page/communitymembers#ClarkKate\">Miss Clarke</a> came<br>to give <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyDell\">Dell</a> a lesson. I went<br>out in the afternoon. Took Lizzie&rsquo;s<br>calendar called at Chapman&rsquo;s<br>to see if <a href=\"/s/ital-iasc-2q90/page/communitymembers#ChapmanGenevra\">Genevra</a> could sing. She<br>is away. Went to <a href=\"/s/ital-iasc-2q90/page/locations#WWGreenwoods\">Greenwood&rsquo;s</a>. Mabel<br>will sing I was up to office and<br>papa gave me money to get Eva a<br>hatpin. Got a sample copy of<br>the &ldquo;Musician&rdquo; for December. Sent <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt<br>Allie&rsquo;s</a> bag off. Was at Dwyer&rsquo;s. Beatrice<br>was uptown. Then went down to<br>Dudley&rsquo;s.",
	"1900-12-23" : "Very rainy about church<br>time so I did not go in<br>the morning. Eva brought<br>papa a piece of hyrianthe[?].<br>Went to Sunday School with<br>Mrs Haun&rsquo;s present. Lesson<br>Matt II. 1-18. Mrs Haun surprised<br>us by giving each one a<br>prayer &amp; hymn book, then<br>we surprised her. Lizzie was<br>there. Papa, mamma &amp; I were<br>at church. Sermon on Beatitudes<br>Matt V, 8. Papa went for a walk.<br>The Young People&rsquo;s Association is postponed<br>for a week after all my trouble.",
	"1900-12-24" : "I did not intend going uptown<br>but <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren</a> sent the tabourette<br>I got for mamma and it<br>was all scratched so I went<br>up to give them a setting out.<br>They did not have another like<br>it so I have to give 30&cent; more.<br>Mamma got Tommy a ball<br>&amp; Phoebe got him a box of<br>candy. Mamma gave <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyDell\">Dell Coy</a> a<br>box of candy. I took Eva and Tom&rsquo;s<br>presents over. Papa went<br>uptown at night.",
	"1900-12-25" : "<p style=&quot;text-indent:30%\">Sermon Isiah 60.-1.2.3.<br>Merry Christmas &amp; C [?] - Eva was over<br>early with her presents. I went<br>to church, Papa came in too. He<br>was uptown. I was going to stay<br>after church but I came home<br>with him. The first thing we saw was<br>the deer&rsquo;s head, &amp; then Dr Harry sent<br>me a lovely 2 lb. box of candy, papa 3 boxes of<br>cigars &amp; Mrs Tulley sent mamma a handker-<br>chief. Mrs Overholt sent a teapot handle.<br>Ate &amp; ate till we are sick. Tom brought<br>his presents in. Lizzie brought me a pretty little<br>blue pincushion. I was down to <a href=\"/s/ital-iasc-2q90/page/locations#Smiths\">Smith&rsquo;s</a> for<br>some grapes for Eva as she was afraid.",
	"1900-12-26" : "Papa took a chest protector to Dr.<br>McCoy. <a href=\"/s/ital-iasc-2q90/page/communitymembers#AbbotDr\">Dr Abbott</a> sent it I did not<br>have time to say what mamma<br>&amp; papa gave me. Mamma&rsquo;s present was<br>a pretty [xxx] waist &amp; papa&rsquo;s pair<br>of kid gloves &amp; a bottle of perfume.<br>About 10 30 <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt Allie</a> came<br>in. We did not expect her.<br>We went uptown in the<br>afternoon as Aunt Allie<br>wanted to see some capes.<br>Went into <a href=\"/s/ital-iasc-2q90/page/locations#McLarenAndCo\">McLaren&rsquo;s</a> &amp; <a href=\"/s/ital-iasc-2q90/page/locations#Taits\">Tait&rsquo;s</a>.<br>I settled my bill at McLaren&rsquo;s<br>was in the <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a>. Got Sarah<br>de Berenger, by J Ingelow. Bought<br>some gray matting.",
	"1900-12-27" : "Got a Christmas Globe yesterday<br>for 25&cent; for Phoebe for Mrs Uttler[?]. At<br>noon we got some presents<br>from Mame a handkerchief<br>for mamma, a book about<br>Burningham for Phoebe &amp; a<br>calendar for me. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt<br>Allie</a> &amp; I have been<br>washing dishes. Got all<br>my Harmony done. Hurrah!<br>Sunday School Xmas concert<br>to-night. Did not go.",
	"1900-12-28" : "Have been fixing pictures nearly<br>all day. I had to wash the<br>dinner dishes as mamma<br>had to go uptown with<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt Allie</a> about her cape.<br>She bought a new skirt.<br>Papa, mamma &amp; I went to<br>A. Macgregor&rsquo;s as the club met<br>there Colin Macgregor was there &amp;<br>Mr &amp; Mrs S. Jenkon[?] Mrs Dwyer<br>won ladies, Mr Pay gentlemen&rsquo;s<br>Mr Dwyer the booby[?]. They<br>were a pomade[?] glass. A very large<br>cup and a paperweight.",
	"1900-12-29" : "Seems funny to not have to<br>take a lesson. Mamma &amp;<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#AllieAunt\">Aunt Allie</a> were uptown<br>again to-day. Aunt Allie got<br>a capenine[?] of persian Lamb [sic]<br>&amp; bearskin for aunt Rebecca.<br>She started for Ridgeway on<br>the 6.06 train. Did not to [sic]<br>much of anything. Eva was<br>in to have her hair curled<br>last night for their<br>entertainment.",
	"1900-12-30" : "Did not go to church this<br>morning as I have a bad<br>coldsore [sic] on my lip. And by<br>Sunday School time it was<br>no better so I did not go.<br>Eva was over. Brought one<br>of her Christmas presents<br>&ldquo;Grandma Elsie&rdquo; over for me<br>to read and I lent her<br>&ldquo;Tip Lewis and this Lamp&rdquo;. Papa,<br>mamma and I went to Church<br>at night Sermon on the<br>Beatitudes &ldquo;Blessed are the<br>peacemakers&rdquo;. Came home<br>with Coys and papa &amp; mamma<br>went to their place with<br>them. Papa came home first &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a><br>came with him.",
	"1900-12-31" : "A rather gloomy day. Mamma swept<br>this morning. Finished<br>Eva&rsquo;s book. In the afternoon<br>we got a very pretty<br>azaela [sic]. Think it came<br>from Mrs Pay. Papa<br>went to the Falls to-<br>night, and will go to<br>Black Creek in the morning.<br>Fern Healy was down<br>at night to see about<br>Wednesday night. Dr Greenwood<br>was here at night",
	"1901-01-01" : "The first day of the 20th century<br>They had a service in<br>the church last night<br>Got some old medicine<br>this morning. Eva was<br>over. Papa came home<br>to&ndash;night. He never told<br>Mattie last night at all<br>and now I don&rsquo;t know<br>who to get for to-morrow.",
	"1901-01-02" : "Have been working at a<br>very pretty doily. Mamma<br>went uptown in the afternoon.<br>Wanted her to get a Golden Text<br>Book for 1901 but they were all gone.<br>Leta was over to see me<br>in the afternoon. She got<br>some very nice Xmas presents.<br>Eva was over. Borrowed a book.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyAllie\">Allie</a>, papa &amp; I went to church at night.<br>Mr Perry gave us slips of paper with<br>names on them for impromptu speeches.<br>Mine was &ldquo;Santa Claus&rdquo; Mr. Reavely, Mr Read<br>&amp; Allie played &amp; Mr Rothwell sang. Papa&rsquo;s",
	"1901-01-03" : "speech was on &ldquo;Bad Habits&rdquo;. We had<br>lots of fun. I finished my<br>doily all but the border.<br>Papa brought a shield home<br>at night for the deer&rsquo;s head<br>&amp; mounted it. Mamma made<br>me a shawl for evenings the<br>other day. She wore it to&ndash;night<br>as she &amp; papa went over to<br>Kennedy&rsquo;s to spend the evening.<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr</a> &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a> were there. Mr Skey [?]<br>was presented &amp; Saturday<br>evening was presented by the<br>Young People of Merriton with<br>a surplice<sup>1</sup> &amp; stole before he left<br>for Hamilton.<br><br><small>1. A loose white linen vestment worn at Christian church services.</small>",
	"1901-01-04" : "Am reading some of my<br>Pansy Books. The one I am<br>reading now is a &quot;New Graft<br>on the Family Tree&quot;. Am<br>working an edge on my<br>doily. Eva left a Birthday<br>letter for me at the door,<br>but she was mistaken<br>in the date. She &amp; Tom<br>were in after school. She<br>had a quarrel with Marguerite<br>Carlisle. Am going to send for<br>some Brown Pictures tomorrow.",
	"1901-01-05" : "Took my lesson after the<br>holidays. Have &ldquo;Ich Liele Dich&rdquo;<br>again. For next week. Called<br>in Dwyers to tell Beatrice she<br>had the musical programme<br>for the next Young People&rsquo;s Meeting.<br>Finished my doily. Mrs Trusty<br>is here. Mr Pearson &amp; man came<br>to fix the gas burner. Mamma<br>&amp; I were uptown in the<br>afternoon. I bought a round<br>doily for comb &amp; brush. Sent<br>my letter away for the<br>pictures.",
	"1901-01-06" : "To&ndash;day is the beginning of our<br>three weeks mission by Mr Murphy.<br>Sermon was on Rom VIII.29. Staid<br>to communion. When I came home<br>Dr Greenwood was there. He wants<br>me to come to his office to-morrow at<br>2. Went to Sunday School. Mr<br>Murphy addressed us. There<br>is to be a service for children<br>every day at 4.15 &amp; adults at 8.<br>Papa, mamma &amp; I were at<br>church. Sermon Gen VII.16<br>verse.",
	"1901-01-07" : "My birthday 19 yrs old. At noon<br>Eva came in with a<br>birthday present. A football<br>with an inkwell inside.<br>Mamma went with me<br>to the doctor as I was going<br>to have my throat treated.<br>We went into <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarrollFamily\">Carroll&rsquo;s</a> to see<br>how they were. I went to<br>the office &amp; waited for mamma.<br>She got me a Golden Text<br>Book for 1901 and I went to<br><a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleMiss\">Miss Boyle&rsquo;s</a> to have may waist<br>tried on. Election day. We did<br>not go to the missions to&ndash;day.",
	"1901-01-08" : "We really got up a little<br>bit early this morning. Mr<br>McIntyre is Mayor.<br>Practiced 2 hours this morning.<br>Started to the Dr. at 20 min of 2<br>was back 20 min after. Turned<br>out stormy to&ndash;night. Musical<br>night, but if it had been<br>nice we would have<br>went to church instead.<br>Got Jany [sic] Ladies Home Journal.",
	"1901-01-09" : "A very mild day. Eva was<br>in to see how Phoebe was.<br>The Dr was not in when I<br>first went in, but came in<br>soon. Mamma and I went<br>to the church. Papa could<br>not go as he was to meet <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr Coy</a>.<br>They have mission books<br>with mission service<br>and mission hymns in which[sic]<br>they use. Mr Murphy spoke<br>on Prodigal Son. Luke 15-17.<br>Mr Perry inquired after my cold.<br>Mrs Hodgins was there.",
	"1901-01-10" : "Very horrible day. Raining.<br>Didnot [sic] go to the Dr. as it<br>was so damp. Counldn&rsquo;t go to<br>church. I am so sorry the<br>weather has been so<br>bad. Got the pictures from<br><a href=\"/s/ital-iasc-2q90/page/locations#BrownAndCo\">Brown&rsquo;s</a> to&ndash;night. There are<br>some very pretty ones<br>Papa and I played<br>euchre. He beat. Expect the<br>soldiers home to&ndash;morrow.<br>Modjeska was at the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera<br>House</a> to&ndash;night.",
	"1901-01-11" : "Woke up with a very bad<br>cold in my head. Mrs Marquis<br>came to ask me if I<br>would play next night Jan<br>22<sup style=&quot;font-size:x-small;\">nd</sup>. French night &amp; to send<br>my pieces in. The Dr is sick<br>with a cold so I had my walk<br>for nothing. It said in the<br>paper there were about 300<br>children at the church yesterday.<br>Papa &amp; I played euchre again<br>&amp; I won this time.",
	"1901-01-12" : "My cold is worse and<br>papa would not let me<br>go to my lesson. It is the<br>first one I have ever missed.<br>Papa is going to tell Mr Read.<br>Mamma had to go uptown and do<br>a dozen errands. She went to<br>Mrs Marquis &amp; told her I could<br>not play at the next Musical.<br>Mamma changed my <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a><br>book &amp; got &ldquo;Twice Tried&rdquo; by Anne Swan.<br>I am to go to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleMiss\">Miss Boyle&rsquo;s</a> Monday.<br>The soldier boys are home<br>and having a good time.",
	"1901-01-13" : "Did not go out all day.<br>Ate peanuts, Lizzie was<br>down after Sunday School<br>to see what was the<br>matter with us all. She<br>was telling us Mr Perry<br>has got out souvenirs, a<br>picture of himself. Papa,<br>&amp; mamma went to<br>church.",
	"1901-01-14" : "Very nice in morning<br>but turned out rainy.<br>Took all the pictures out<br>of all the &ldquo;Musicians&rdquo;. The little<br>Moore girl brought a slip<br>of paper with services on for this<br>week. Papa asked <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMr\">Mr</a> &amp; <a href=\"/s/ital-iasc-2q90/page/communitymembers/#CoyMrs\">Mrs Coy</a><br>to go with them to the concert<br>as I can&rsquo;t go. Miss Lillian<br>Carlsmith &amp; the New York<br>Ladies Trio are in the <a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera<br>House</a>. Am reading the<br>&ldquo;Wide, Wide World&rdquo; over again.",
	"1901-01-15" : "Could not go out again. <a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a><br>came over in the afternoon.<br>Carman wants &ldquo;She&rdquo; and said<br>wants to come &amp; see my fish. Papa<br>&amp; mamma went to Notmans to the<br>Club.",
	"1901-01-16" : "Mrs Trusty is here. Papa won<br>the prize last night. Eva,<br>Tom and Jessie Jones were in for a<br>while was not out.",
	"1901-01-17" : "Papa went to Hamilton this morning.<br>I started out for a walk<br>to&ndash;day for the first. Then took<br>Scotch songs back to Carman&rsquo;s. Mrs<br>Carman entertained me. The &ldquo;Etude&rdquo; came to&ndash;night. Has a nice<br>colored supplement in &ldquo;Sacred<br>Music&rdquo;.",
	"1901-01-18" : "Papa will not be home<br>until 6.30 to&ndash;night. He sent<br>word with Mabel. Went for<br>another walk. Mamma went<br>up to Dr. for Phoebe. She is<br>worse to&ndash;day. <a href=\"/s/ital-iasc-2q90/page/communitymembers/#AbbsMr\">Mr Abbs</a> was<br>married yesterday to Miss<br>Parnell.",
	"1901-01-19" : "Very cold &amp; windy so papa<br>would not let me got to<br>my lesson again. The Dr. sent<br>me a bottle of medicine<br>last night. Papa gave me<br>a little pin with <a title=&quot;Possibly Sir Wilfred Laurier\">Laurier</a> on<br>it. Finished my little doily.<br>Mrs Trusty is here. Was over<br>to Mrs Pay&rsquo;s nearly all afternoon.<br>She got a pig you blow up the<br>it dies with a squeal. Papa<br>got some calendars &amp; pictures in<br>Hamilton.",
	"1901-01-20" : "Did not go out to-day. My<br>head is worse. Am reading<br>Oliver Twist.",
	"1901-01-21" : "The Queen is not expected<br>to live. Mamma had to go<br>to Mrs. Sullivan&rsquo;s. She changed<br>my <a href=\"/s/ital-iasc-2q90/page/locations#Library\">library</a> book. Got Ursula<br>Vivian by Anne Swan. Read it<br>to&ndash;night. Beatrice came over<br>in the afternoon to see me.<br>Mr Murphy is here until<br>Wednesday",
	"1901-01-22" : "A very fine day. The Queen<br>died this morning at 6.30 and<br>the Prince is now King Edward<br>VII. Eva was in. I went up<br>to <a href=\"/s/ital-iasc-2q90/page/communitymembers/#BoyleMiss\">Miss Boyle&rsquo;s</a> to try my<br>waist on after so long a<br>time. Mamma went to the<br>church to the service then<br>uptown to buy me an<br>apron. Mrs Kilner was<br>down &amp; mamma was away<br>as usual.",
	"1901-01-23" : "Papa brought a man home with<br>him at noon. He is going to put<br>a hot air pipe in Phoebe&rsquo;s room.<br>I went to church this<br>afternoon. Mr Murphy<br>spoke on how to read the Bible.  Mr &amp; Mrs Pay were over for tea.<br>Had a pigeon for supper. I broke one<br>of the new saucers.",
	"1901-01-24" : "A gloomy day. The men fixed<br>the pipes this afternoon.<br>Mamma was over to Carman&rsquo;s<br>for eggs. They are draping<br>our city buildings in black<br>in memory of the Queen. Papa<br>went to <a href=\"http://www.georgewpeck.com/minstrels.htm&quot; title=&quot;A Theatre group\">Hi Henry&rsquo;s minstrals</a><br>to&ndash;night. On Tuesday Mr<br>Stewart&rsquo;s pet fox got away &amp;<br>Laurie Wilson shot it. It killed<br>some of Mrs Pay&rsquo;s chickens.",
	"1901-01-25" : "One of pipes was put up wrong.<br>The men cam &amp; fixed it.<br>Mamma was uptown<br>in afternoon. She got enough<br>brown goods to lengthen my<br>skirt. Got &ldquo;Success&rdquo;. The Buffalo<br>Express is full of pictures of<br>the Queen.",
	"1901-01-26" : "Took me lesson this morning<br>Mr Read said he was glad to see<br>me. Have 3<sup style=&quot;font-size:x-small;\">rd</sup> of Mendelssoln&rsquo;s. In<br>the afternoon I went over to<br>see Leta. She was just going to [xxx]<br>at home at Annie McEdward. Got the<br>Journal to &ndash; night &amp; a nice calendar<br>from <a href=\"/s/ital-iasc-2q90/page/locations#PetersCartridgeCo\">Peter&rsquo;s Cartridge Co.</a>",
	"1901-01-27" : "Went to church this morning<br>Mr Perry was out He has had the<br>grippe. He spoke on the Queen<br>I Cor. 15-26. Then went to<br>Sunday School. Miss Reyes[?]<br>is going to give me a souvenir<br>if I come to see her next<br>Saturday. Papa &amp; Mamma<br>went to church. I was<br>reading about the Queen",
	"1901-01-28" : "Phoebe had the Dr. down<br>in the afternoon Mrs Dwyer<br>was in. Then Mamma<br>went with her as she<br>had to go to Mrs Sullivans<br><a href=\"/s/ital-iasc-2q90/page/communitymembers#CarmanElla\">Ella</a> was over. They are<br>going to have a united[?]<br>memorial service in the<br><a href=\"/s/ital-iasc-2q90/page/locations#GrandOperaHouse\">Opera House</a> Saturday afternoon<br>There are six deaths in<br>the paper. Dr. Smith is<br>very sick",
	"1901-01-29" : "Tuesday January 29<sup>th</sup> 1901<br>clear&nbsp;&amp; cold out. <a>Verdi</a> is dead.<br>Died last week on Friday or Sat.<br>The <a>Musical Circle</a> lecture is<br>postponed. I went up to<br>the library in the afternoon.<br>Got one of <a>Pansey's</a> books<br><a>&quot;Miss Priscilla Hunter&quot;</a>. Papa<br>has the [xxx] are to much candy<br><a>Mrs Marquis</a> came &amp; told<br>us the meeting was postponed<br>until Feb 12<sup style=&quot;font-size: x-small;\">th</sup>",
	"1901-01-30" : "Wednesday Jan 30<sup>th</sup> 1901.<br><a>Mrs Trusty</a> is here to-day.<br>Mamma had to go to the<br><a>church</a> &amp; to <a> Mrs Sullivan's</a><br>She got some very pretty<br>samples of waist goods. I am<br>going to get one with pieces like<br>honiton braid running through<br>it. <a>Ella</a> was in. Poor <a> Tommy</a><br>is very sick with pneumonia.<br>They have a debate to-night<br>in the church between a<br>boy &amp; girl. Last night our<br><a>Society</a> debated against <a> Y.M.C.A</a><br>in their rooms."
}